a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h


/********** PERIPHERAL: HSE **********/

/*** REGISTER: HSE_STARTUP ***/
#define HSE_STARTUP_TIMEOUT_gm ((uint16_t)0x0500)
#define HSE_STARTUP_TIMEOUT_gp 8


/********** PERIPHERAL: HSI **********/
#define HSI_STARTUP_TIMEOUT_gm ((uint16_t)0x0500)
#define HSI_STARTUP_TIMEOUT_gp 8


/********** PERIPHERAL: SRAM **********/

/*** REGISTER: SRAM_BB ***/
#define SRAM_BB_BASE_gm ((uint32_t)0x22000000)
#define SRAM_BB_BASE_gp 25


/********** PERIPHERAL: PERIPH **********/
#define PERIPH_BB_BASE_gm ((uint32_t)0x42000000)
#define PERIPH_BB_BASE_gp 25


/********** PERIPHERAL: ADC **********/

/*** REGISTER: ADC_ISR ***/
#define ADC_ISR_ADRD_gm ((uint32_t)0x00000001)
#define ADC_ISR_ADRD_gp 0
#define ADC_ISR_EOSMP_gm ((uint32_t)0x00000002)
#define ADC_ISR_EOSMP_gp 1
#define ADC_ISR_EOC_gm ((uint32_t)0x00000004)
#define ADC_ISR_EOC_gp 2
#define ADC_ISR_EOS_gm ((uint32_t)0x00000008)
#define ADC_ISR_EOS_gp 3
#define ADC_ISR_OVR_gm ((uint32_t)0x00000010)
#define ADC_ISR_OVR_gp 4
#define ADC_ISR_JEOC_gm ((uint32_t)0x00000020)
#define ADC_ISR_JEOC_gp 5
#define ADC_ISR_JEOS_gm ((uint32_t)0x00000040)
#define ADC_ISR_JEOS_gp 6
#define ADC_ISR_AWD1_gm ((uint32_t)0x00000080)
#define ADC_ISR_AWD1_gp 7
#define ADC_ISR_AWD2_gm ((uint32_t)0x00000100)
#define ADC_ISR_AWD2_gp 8
#define ADC_ISR_AWD3_gm ((uint32_t)0x00000200)
#define ADC_ISR_AWD3_gp 9
#define ADC_ISR_JQOVF_gm ((uint32_t)0x00000400)
#define ADC_ISR_JQOVF_gp 10

/*** REGISTER: ADC_IER ***/
#define ADC_IER_RDY_gm ((uint32_t)0x00000001)
#define ADC_IER_RDY_gp 0
#define ADC_IER_EOSMP_gm ((uint32_t)0x00000002)
#define ADC_IER_EOSMP_gp 1
#define ADC_IER_EOC_gm ((uint32_t)0x00000004)
#define ADC_IER_EOC_gp 2
#define ADC_IER_EOS_gm ((uint32_t)0x00000008)
#define ADC_IER_EOS_gp 3
#define ADC_IER_OVR_gm ((uint32_t)0x00000010)
#define ADC_IER_OVR_gp 4
#define ADC_IER_JEOC_gm ((uint32_t)0x00000020)
#define ADC_IER_JEOC_gp 5
#define ADC_IER_JEOS_gm ((uint32_t)0x00000040)
#define ADC_IER_JEOS_gp 6
#define ADC_IER_AWD1_gm ((uint32_t)0x00000080)
#define ADC_IER_AWD1_gp 7
#define ADC_IER_AWD2_gm ((uint32_t)0x00000100)
#define ADC_IER_AWD2_gp 8
#define ADC_IER_AWD3_gm ((uint32_t)0x00000200)
#define ADC_IER_AWD3_gp 9
#define ADC_IER_JQOVF_gm ((uint32_t)0x00000400)
#define ADC_IER_JQOVF_gp 10

/*** REGISTER: ADC_CR ***/
#define ADC_CR_ADEN_gm ((uint32_t)0x00000001)
#define ADC_CR_ADEN_gp 0
#define ADC_CR_ADDIS_gm ((uint32_t)0x00000002)
#define ADC_CR_ADDIS_gp 1
#define ADC_CR_ADSTART_gm ((uint32_t)0x00000004)
#define ADC_CR_ADSTART_gp 2
#define ADC_CR_JADSTART_gm ((uint32_t)0x00000008)
#define ADC_CR_JADSTART_gp 3
#define ADC_CR_ADSTP_gm ((uint32_t)0x00000010)
#define ADC_CR_ADSTP_gp 4
#define ADC_CR_JADSTP_gm ((uint32_t)0x00000020)
#define ADC_CR_JADSTP_gp 5
#define ADC_CR_ADVREGEN_gm ((uint32_t)0x30000000)
#define ADC_CR_ADVREGEN_gp 28
#define ADC_CR_ADVREGEN0_gm ((uint32_t)0x10000000)
#define ADC_CR_ADVREGEN0_gp 28
#define ADC_CR_ADVREGEN1_gm ((uint32_t)0x20000000)
#define ADC_CR_ADVREGEN1_gp 29
#define ADC_CR_ADCALDIF_gm ((uint32_t)0x40000000)
#define ADC_CR_ADCALDIF_gp 30
#define ADC_CR_ADCAL_gm ((uint32_t)0x80000000)
#define ADC_CR_ADCAL_gp 31

/*** REGISTER: ADC_CFGR ***/
#define ADC_CFGR_DMAEN_gm ((uint32_t)0x00000001)
#define ADC_CFGR_DMAEN_gp 0
#define ADC_CFGR_DMACFG_gm ((uint32_t)0x00000002)
#define ADC_CFGR_DMACFG_gp 1
#define ADC_CFGR_RES_gm ((uint32_t)0x00000018)
#define ADC_CFGR_RES_gp 3
#define ADC_CFGR_RES0_gm ((uint32_t)0x00000008)
#define ADC_CFGR_RES0_gp 3
#define ADC_CFGR_RES1_gm ((uint32_t)0x00000010)
#define ADC_CFGR_RES1_gp 4
#define ADC_CFGR_ALIGN_gm ((uint32_t)0x00000020)
#define ADC_CFGR_ALIGN_gp 5
#define ADC_CFGR_EXTSEL_gm ((uint32_t)0x000003C0)
#define ADC_CFGR_EXTSEL_gp 6
#define ADC_CFGR_EXTSEL0_gm ((uint32_t)0x00000040)
#define ADC_CFGR_EXTSEL0_gp 6
#define ADC_CFGR_EXTSEL1_gm ((uint32_t)0x00000080)
#define ADC_CFGR_EXTSEL1_gp 7
#define ADC_CFGR_EXTSEL2_gm ((uint32_t)0x00000100)
#define ADC_CFGR_EXTSEL2_gp 8
#define ADC_CFGR_EXTSEL3_gm ((uint32_t)0x00000200)
#define ADC_CFGR_EXTSEL3_gp 9
#define ADC_CFGR_EXTEN_gm ((uint32_t)0x00000C00)
#define ADC_CFGR_EXTEN_gp 10
#define ADC_CFGR_EXTEN0_gm ((uint32_t)0x00000400)
#define ADC_CFGR_EXTEN0_gp 10
#define ADC_CFGR_EXTEN1_gm ((uint32_t)0x00000800)
#define ADC_CFGR_EXTEN1_gp 11
#define ADC_CFGR_OVRMOD_gm ((uint32_t)0x00001000)
#define ADC_CFGR_OVRMOD_gp 12
#define ADC_CFGR_CONT_gm ((uint32_t)0x00002000)
#define ADC_CFGR_CONT_gp 13
#define ADC_CFGR_AUTDLY_gm ((uint32_t)0x00004000)
#define ADC_CFGR_AUTDLY_gp 14
#define ADC_CFGR_AUTOFF_gm ((uint32_t)0x00008000)
#define ADC_CFGR_AUTOFF_gp 15
#define ADC_CFGR_DISCEN_gm ((uint32_t)0x00010000)
#define ADC_CFGR_DISCEN_gp 16
#define ADC_CFGR_DISCNUM_gm ((uint32_t)0x000E0000)
#define ADC_CFGR_DISCNUM_gp 17
#define ADC_CFGR_DISCNUM0_gm ((uint32_t)0x00020000)
#define ADC_CFGR_DISCNUM0_gp 17
#define ADC_CFGR_DISCNUM1_gm ((uint32_t)0x00040000)
#define ADC_CFGR_DISCNUM1_gp 18
#define ADC_CFGR_DISCNUM2_gm ((uint32_t)0x00080000)
#define ADC_CFGR_DISCNUM2_gp 19
#define ADC_CFGR_JDISCEN_gm ((uint32_t)0x00100000)
#define ADC_CFGR_JDISCEN_gp 20
#define ADC_CFGR_JQM_gm ((uint32_t)0x00200000)
#define ADC_CFGR_JQM_gp 21
#define ADC_CFGR_AWD1SGL_gm ((uint32_t)0x00400000)
#define ADC_CFGR_AWD1SGL_gp 22
#define ADC_CFGR_AWD1EN_gm ((uint32_t)0x00800000)
#define ADC_CFGR_AWD1EN_gp 23
#define ADC_CFGR_JAWD1EN_gm ((uint32_t)0x01000000)
#define ADC_CFGR_JAWD1EN_gp 24
#define ADC_CFGR_JAUTO_gm ((uint32_t)0x02000000)
#define ADC_CFGR_JAUTO_gp 25
#define ADC_CFGR_AWD1CH_gm ((uint32_t)0x7C000000)
#define ADC_CFGR_AWD1CH_gp 26
#define ADC_CFGR_AWD1CH0_gm ((uint32_t)0x04000000)
#define ADC_CFGR_AWD1CH0_gp 26
#define ADC_CFGR_AWD1CH1_gm ((uint32_t)0x08000000)
#define ADC_CFGR_AWD1CH1_gp 27
#define ADC_CFGR_AWD1CH2_gm ((uint32_t)0x10000000)
#define ADC_CFGR_AWD1CH2_gp 28
#define ADC_CFGR_AWD1CH3_gm ((uint32_t)0x20000000)
#define ADC_CFGR_AWD1CH3_gp 29
#define ADC_CFGR_AWD1CH4_gm ((uint32_t)0x40000000)
#define ADC_CFGR_AWD1CH4_gp 30

/*** REGISTER: ADC_SMPR1 ***/
#define ADC_SMPR1_SMP0_gm ((uint32_t)0x00000007)
#define ADC_SMPR1_SMP0_gp 0
#define ADC_SMPR1_SMP1_gm ((uint32_t)0x00000038)
#define ADC_SMPR1_SMP1_gp 3
#define ADC_SMPR1_SMP2_gm ((uint32_t)0x000001C0)
#define ADC_SMPR1_SMP2_gp 6
#define ADC_SMPR1_SMP3_gm ((uint32_t)0x00000E00)
#define ADC_SMPR1_SMP3_gp 9
#define ADC_SMPR1_SMP4_gm ((uint32_t)0x00007000)
#define ADC_SMPR1_SMP4_gp 12
#define ADC_SMPR1_SMP5_gm ((uint32_t)0x00038000)
#define ADC_SMPR1_SMP5_gp 15
#define ADC_SMPR1_SMP6_gm ((uint32_t)0x001C0000)
#define ADC_SMPR1_SMP6_gp 18
#define ADC_SMPR1_SMP7_gm ((uint32_t)0x00E00000)
#define ADC_SMPR1_SMP7_gp 21
#define ADC_SMPR1_SMP8_gm ((uint32_t)0x07000000)
#define ADC_SMPR1_SMP8_gp 24
#define ADC_SMPR1_SMP9_gm ((uint32_t)0x38000000)
#define ADC_SMPR1_SMP9_gp 27

/*** REGISTER: ADC_SMPR2 ***/
#define ADC_SMPR2_SMP10_gm ((uint32_t)0x00000007)
#define ADC_SMPR2_SMP10_gp 0
#define ADC_SMPR2_SMP11_gm ((uint32_t)0x00000038)
#define ADC_SMPR2_SMP11_gp 3
#define ADC_SMPR2_SMP12_gm ((uint32_t)0x000001C0)
#define ADC_SMPR2_SMP12_gp 6
#define ADC_SMPR2_SMP13_gm ((uint32_t)0x00000E00)
#define ADC_SMPR2_SMP13_gp 9
#define ADC_SMPR2_SMP14_gm ((uint32_t)0x00007000)
#define ADC_SMPR2_SMP14_gp 12
#define ADC_SMPR2_SMP15_gm ((uint32_t)0x00038000)
#define ADC_SMPR2_SMP15_gp 15
#define ADC_SMPR2_SMP16_gm ((uint32_t)0x001C0000)
#define ADC_SMPR2_SMP16_gp 18
#define ADC_SMPR2_SMP17_gm ((uint32_t)0x00E00000)
#define ADC_SMPR2_SMP17_gp 21
#define ADC_SMPR2_SMP18_gm ((uint32_t)0x07000000)
#define ADC_SMPR2_SMP18_gp 24

