a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: ADC_TR1 ***/
#define ADC_TR1_LT1_gm ((uint32_t)0x00000FFF)
#define ADC_TR1_LT1_gp 0
#define ADC_TR1_HT1_gm ((uint32_t)0x0FFF0000)
#define ADC_TR1_HT1_gp 16

/*** REGISTER: ADC_TR2 ***/
#define ADC_TR2_LT2_gm ((uint32_t)0x000000FF)
#define ADC_TR2_LT2_gp 0
#define ADC_TR2_HT2_gm ((uint32_t)0x00FF0000)
#define ADC_TR2_HT2_gp 16

/*** REGISTER: ADC_TR3 ***/
#define ADC_TR3_LT3_gm ((uint32_t)0x000000FF)
#define ADC_TR3_LT3_gp 0
#define ADC_TR3_HT3_gm ((uint32_t)0x00FF0000)
#define ADC_TR3_HT3_gp 16

/*** REGISTER: ADC_SQR1 ***/
#define ADC_SQR1_L_gm ((uint32_t)0x0000000F)
#define ADC_SQR1_L_gp 0
#define ADC_SQR1_L0_gm ((uint32_t)0x00000001)
#define ADC_SQR1_L0_gp 0
#define ADC_SQR1_L1_gm ((uint32_t)0x00000002)
#define ADC_SQR1_L1_gp 1
#define ADC_SQR1_L2_gm ((uint32_t)0x00000004)
#define ADC_SQR1_L2_gp 2
#define ADC_SQR1_L3_gm ((uint32_t)0x00000008)
#define ADC_SQR1_L3_gp 3
#define ADC_SQR1_SQ1_gm ((uint32_t)0x000007C0)
#define ADC_SQR1_SQ1_gp 6
#define ADC_SQR1_SQ2_gm ((uint32_t)0x0001F000)
#define ADC_SQR1_SQ2_gp 12
#define ADC_SQR1_SQ3_gm ((uint32_t)0x007C0000)
#define ADC_SQR1_SQ3_gp 18
#define ADC_SQR1_SQ4_gm ((uint32_t)0x1F000000)
#define ADC_SQR1_SQ4_gp 24

/*** REGISTER: ADC_SQR2 ***/
#define ADC_SQR2_SQ5_gm ((uint32_t)0x0000001F)
#define ADC_SQR2_SQ5_gp 0
#define ADC_SQR2_SQ6_gm ((uint32_t)0x000007C0)
#define ADC_SQR2_SQ6_gp 6
#define ADC_SQR2_SQ7_gm ((uint32_t)0x0001F000)
#define ADC_SQR2_SQ7_gp 12
#define ADC_SQR2_SQ8_gm ((uint32_t)0x007C0000)
#define ADC_SQR2_SQ8_gp 18
#define ADC_SQR2_SQ9_gm ((uint32_t)0x1F000000)
#define ADC_SQR2_SQ9_gp 24

/*** REGISTER: ADC_SQR3 ***/
#define ADC_SQR3_SQ10_gm ((uint32_t)0x0000001F)
#define ADC_SQR3_SQ10_gp 0
#define ADC_SQR3_SQ11_gm ((uint32_t)0x000007C0)
#define ADC_SQR3_SQ11_gp 6
#define ADC_SQR3_SQ12_gm ((uint32_t)0x0001F000)
#define ADC_SQR3_SQ12_gp 12
#define ADC_SQR3_SQ13_gm ((uint32_t)0x007C0000)
#define ADC_SQR3_SQ13_gp 18
#define ADC_SQR3_SQ14_gm ((uint32_t)0x1F000000)
#define ADC_SQR3_SQ14_gp 24
#define ADC_SQR3_SQ15_gm ((uint32_t)0x0000001F)
#define ADC_SQR3_SQ15_gp 0
#define ADC_SQR3_SQ16_gm ((uint32_t)0x000007C0)
#define ADC_SQR3_SQ16_gp 6

/*** REGISTER: ADC_DR ***/
#define ADC_DR_RDATA_gm ((uint32_t)0x0000FFFF)
#define ADC_DR_RDATA_gp 0
#define ADC_DR_RDATA0_gm ((uint32_t)0x00000001)
#define ADC_DR_RDATA0_gp 0
#define ADC_DR_RDATA1_gm ((uint32_t)0x00000002)
#define ADC_DR_RDATA1_gp 1
#define ADC_DR_RDATA2_gm ((uint32_t)0x00000004)
#define ADC_DR_RDATA2_gp 2
#define ADC_DR_RDATA3_gm ((uint32_t)0x00000008)
#define ADC_DR_RDATA3_gp 3
#define ADC_DR_RDATA4_gm ((uint32_t)0x00000010)
#define ADC_DR_RDATA4_gp 4
#define ADC_DR_RDATA5_gm ((uint32_t)0x00000020)
#define ADC_DR_RDATA5_gp 5
#define ADC_DR_RDATA6_gm ((uint32_t)0x00000040)
#define ADC_DR_RDATA6_gp 6
#define ADC_DR_RDATA7_gm ((uint32_t)0x00000080)
#define ADC_DR_RDATA7_gp 7
#define ADC_DR_RDATA8_gm ((uint32_t)0x00000100)
#define ADC_DR_RDATA8_gp 8
#define ADC_DR_RDATA9_gm ((uint32_t)0x00000200)
#define ADC_DR_RDATA9_gp 9
#define ADC_DR_RDATA10_gm ((uint32_t)0x00000400)
#define ADC_DR_RDATA10_gp 10
#define ADC_DR_RDATA11_gm ((uint32_t)0x00000800)
#define ADC_DR_RDATA11_gp 11
#define ADC_DR_RDATA12_gm ((uint32_t)0x00001000)
#define ADC_DR_RDATA12_gp 12
#define ADC_DR_RDATA13_gm ((uint32_t)0x00002000)
#define ADC_DR_RDATA13_gp 13
#define ADC_DR_RDATA14_gm ((uint32_t)0x00004000)
#define ADC_DR_RDATA14_gp 14
#define ADC_DR_RDATA15_gm ((uint32_t)0x00008000)
#define ADC_DR_RDATA15_gp 15

/*** REGISTER: ADC_JSQR ***/
#define ADC_JSQR_JL_gm ((uint32_t)0x00000003)
#define ADC_JSQR_JL_gp 0
#define ADC_JSQR_JL0_gm ((uint32_t)0x00000001)
#define ADC_JSQR_JL0_gp 0
#define ADC_JSQR_JL1_gm ((uint32_t)0x00000002)
#define ADC_JSQR_JL1_gp 1
#define ADC_JSQR_JEXTSEL_gm ((uint32_t)0x0000003C)
#define ADC_JSQR_JEXTSEL_gp 2
#define ADC_JSQR_JEXTSEL0_gm ((uint32_t)0x00000004)
#define ADC_JSQR_JEXTSEL0_gp 2
#define ADC_JSQR_JEXTSEL1_gm ((uint32_t)0x00000008)
#define ADC_JSQR_JEXTSEL1_gp 3
#define ADC_JSQR_JEXTSEL2_gm ((uint32_t)0x00000010)
#define ADC_JSQR_JEXTSEL2_gp 4
#define ADC_JSQR_JEXTSEL3_gm ((uint32_t)0x00000020)
#define ADC_JSQR_JEXTSEL3_gp 5
#define ADC_JSQR_JEXTEN_gm ((uint32_t)0x000000C0)
#define ADC_JSQR_JEXTEN_gp 6
#define ADC_JSQR_JEXTEN0_gm ((uint32_t)0x00000040)
#define ADC_JSQR_JEXTEN0_gp 6
#define ADC_JSQR_JEXTEN1_gm ((uint32_t)0x00000080)
#define ADC_JSQR_JEXTEN1_gp 7
#define ADC_JSQR_JSQ1_gm ((uint32_t)0x00001F00)
#define ADC_JSQR_JSQ1_gp 8
#define ADC_JSQR_JSQ2_gm ((uint32_t)0x0007C000)
#define ADC_JSQR_JSQ2_gp 14
#define ADC_JSQR_JSQ3_gm ((uint32_t)0x01F00000)
#define ADC_JSQR_JSQ3_gp 20
#define ADC_JSQR_JSQ4_gm ((uint32_t)0x7C000000)
#define ADC_JSQR_JSQ4_gp 26

/*** REGISTER: ADC_OFR1 ***/
#define ADC_OFR1_OFFSET1_gm ((uint32_t)0x00000FFF)
#define ADC_OFR1_OFFSET1_gp 0
#define ADC_OFR1_OFFSET1_CH_gm ((uint32_t)0x7C000000)
#define ADC_OFR1_OFFSET1_CH_gp 26
#define ADC_OFR1_OFFSET1_CH_0_gm ((uint32_t)0x04000000)
#define ADC_OFR1_OFFSET1_CH_0_gp 26
#define ADC_OFR1_OFFSET1_CH_1_gm ((uint32_t)0x08000000)
#define ADC_OFR1_OFFSET1_CH_1_gp 27
#define ADC_OFR1_OFFSET1_CH_2_gm ((uint32_t)0x10000000)
#define ADC_OFR1_OFFSET1_CH_2_gp 28
#define ADC_OFR1_OFFSET1_CH_3_gm ((uint32_t)0x20000000)
#define ADC_OFR1_OFFSET1_CH_3_gp 29
#define ADC_OFR1_OFFSET1_CH_4_gm ((uint32_t)0x40000000)
#define ADC_OFR1_OFFSET1_CH_4_gp 30
#define ADC_OFR1_OFFSET1_EN_gm ((uint32_t)0x80000000)
#define ADC_OFR1_OFFSET1_EN_gp 31

/*** REGISTER: ADC_OFR2 ***/
#define ADC_OFR2_OFFSET2_gm ((uint32_t)0x00000FFF)
#define ADC_OFR2_OFFSET2_gp 0
#define ADC_OFR2_OFFSET2_CH_gm ((uint32_t)0x7C000000)
#define ADC_OFR2_OFFSET2_CH_gp 26
#define ADC_OFR2_OFFSET2_CH_0_gm ((uint32_t)0x04000000)
#define ADC_OFR2_OFFSET2_CH_0_gp 26
#define ADC_OFR2_OFFSET2_CH_1_gm ((uint32_t)0x08000000)
#define ADC_OFR2_OFFSET2_CH_1_gp 27
#define ADC_OFR2_OFFSET2_CH_2_gm ((uint32_t)0x10000000)
#define ADC_OFR2_OFFSET2_CH_2_gp 28
#define ADC_OFR2_OFFSET2_CH_3_gm ((uint32_t)0x20000000)
#define ADC_OFR2_OFFSET2_CH_3_gp 29
#define ADC_OFR2_OFFSET2_CH_4_gm ((uint32_t)0x40000000)
#define ADC_OFR2_OFFSET2_CH_4_gp 30
#define ADC_OFR2_OFFSET2_EN_gm ((uint32_t)0x80000000)
#define ADC_OFR2_OFFSET2_EN_gp 31

