a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: ADC_OFR3 ***/
#define ADC_OFR3_OFFSET3_gm ((uint32_t)0x00000FFF)
#define ADC_OFR3_OFFSET3_gp 0
#define ADC_OFR3_OFFSET3_CH_gm ((uint32_t)0x7C000000)
#define ADC_OFR3_OFFSET3_CH_gp 26
#define ADC_OFR3_OFFSET3_CH_0_gm ((uint32_t)0x04000000)
#define ADC_OFR3_OFFSET3_CH_0_gp 26
#define ADC_OFR3_OFFSET3_CH_1_gm ((uint32_t)0x08000000)
#define ADC_OFR3_OFFSET3_CH_1_gp 27
#define ADC_OFR3_OFFSET3_CH_2_gm ((uint32_t)0x10000000)
#define ADC_OFR3_OFFSET3_CH_2_gp 28
#define ADC_OFR3_OFFSET3_CH_3_gm ((uint32_t)0x20000000)
#define ADC_OFR3_OFFSET3_CH_3_gp 29
#define ADC_OFR3_OFFSET3_CH_4_gm ((uint32_t)0x40000000)
#define ADC_OFR3_OFFSET3_CH_4_gp 30
#define ADC_OFR3_OFFSET3_EN_gm ((uint32_t)0x80000000)
#define ADC_OFR3_OFFSET3_EN_gp 31

/*** REGISTER: ADC_OFR4 ***/
#define ADC_OFR4_OFFSET4_gm ((uint32_t)0x00000FFF)
#define ADC_OFR4_OFFSET4_gp 0
#define ADC_OFR4_OFFSET4_CH_gm ((uint32_t)0x7C000000)
#define ADC_OFR4_OFFSET4_CH_gp 26
#define ADC_OFR4_OFFSET4_CH_0_gm ((uint32_t)0x04000000)
#define ADC_OFR4_OFFSET4_CH_0_gp 26
#define ADC_OFR4_OFFSET4_CH_1_gm ((uint32_t)0x08000000)
#define ADC_OFR4_OFFSET4_CH_1_gp 27
#define ADC_OFR4_OFFSET4_CH_2_gm ((uint32_t)0x10000000)
#define ADC_OFR4_OFFSET4_CH_2_gp 28
#define ADC_OFR4_OFFSET4_CH_3_gm ((uint32_t)0x20000000)
#define ADC_OFR4_OFFSET4_CH_3_gp 29
#define ADC_OFR4_OFFSET4_CH_4_gm ((uint32_t)0x40000000)
#define ADC_OFR4_OFFSET4_CH_4_gp 30
#define ADC_OFR4_OFFSET4_EN_gm ((uint32_t)0x80000000)
#define ADC_OFR4_OFFSET4_EN_gp 31

/*** REGISTER: ADC_JDR1 ***/
#define ADC_JDR1_JDATA_gm ((uint32_t)0x0000FFFF)
#define ADC_JDR1_JDATA_gp 0
#define ADC_JDR1_JDATA0_gm ((uint32_t)0x00000001)
#define ADC_JDR1_JDATA0_gp 0
#define ADC_JDR1_JDATA1_gm ((uint32_t)0x00000002)
#define ADC_JDR1_JDATA1_gp 1
#define ADC_JDR1_JDATA2_gm ((uint32_t)0x00000004)
#define ADC_JDR1_JDATA2_gp 2
#define ADC_JDR1_JDATA3_gm ((uint32_t)0x00000008)
#define ADC_JDR1_JDATA3_gp 3
#define ADC_JDR1_JDATA4_gm ((uint32_t)0x00000010)
#define ADC_JDR1_JDATA4_gp 4
#define ADC_JDR1_JDATA5_gm ((uint32_t)0x00000020)
#define ADC_JDR1_JDATA5_gp 5
#define ADC_JDR1_JDATA6_gm ((uint32_t)0x00000040)
#define ADC_JDR1_JDATA6_gp 6
#define ADC_JDR1_JDATA7_gm ((uint32_t)0x00000080)
#define ADC_JDR1_JDATA7_gp 7
#define ADC_JDR1_JDATA8_gm ((uint32_t)0x00000100)
#define ADC_JDR1_JDATA8_gp 8
#define ADC_JDR1_JDATA9_gm ((uint32_t)0x00000200)
#define ADC_JDR1_JDATA9_gp 9
#define ADC_JDR1_JDATA10_gm ((uint32_t)0x00000400)
#define ADC_JDR1_JDATA10_gp 10
#define ADC_JDR1_JDATA11_gm ((uint32_t)0x00000800)
#define ADC_JDR1_JDATA11_gp 11
#define ADC_JDR1_JDATA12_gm ((uint32_t)0x00001000)
#define ADC_JDR1_JDATA12_gp 12
#define ADC_JDR1_JDATA13_gm ((uint32_t)0x00002000)
#define ADC_JDR1_JDATA13_gp 13
#define ADC_JDR1_JDATA14_gm ((uint32_t)0x00004000)
#define ADC_JDR1_JDATA14_gp 14
#define ADC_JDR1_JDATA15_gm ((uint32_t)0x00008000)
#define ADC_JDR1_JDATA15_gp 15

/*** REGISTER: ADC_JDR2 ***/
#define ADC_JDR2_JDATA_gm ((uint32_t)0x0000FFFF)
#define ADC_JDR2_JDATA_gp 0
#define ADC_JDR2_JDATA0_gm ((uint32_t)0x00000001)
#define ADC_JDR2_JDATA0_gp 0
#define ADC_JDR2_JDATA1_gm ((uint32_t)0x00000002)
#define ADC_JDR2_JDATA1_gp 1
#define ADC_JDR2_JDATA2_gm ((uint32_t)0x00000004)
#define ADC_JDR2_JDATA2_gp 2
#define ADC_JDR2_JDATA3_gm ((uint32_t)0x00000008)
#define ADC_JDR2_JDATA3_gp 3
#define ADC_JDR2_JDATA4_gm ((uint32_t)0x00000010)
#define ADC_JDR2_JDATA4_gp 4
#define ADC_JDR2_JDATA5_gm ((uint32_t)0x00000020)
#define ADC_JDR2_JDATA5_gp 5
#define ADC_JDR2_JDATA6_gm ((uint32_t)0x00000040)
#define ADC_JDR2_JDATA6_gp 6
#define ADC_JDR2_JDATA7_gm ((uint32_t)0x00000080)
#define ADC_JDR2_JDATA7_gp 7
#define ADC_JDR2_JDATA8_gm ((uint32_t)0x00000100)
#define ADC_JDR2_JDATA8_gp 8
#define ADC_JDR2_JDATA9_gm ((uint32_t)0x00000200)
#define ADC_JDR2_JDATA9_gp 9
#define ADC_JDR2_JDATA10_gm ((uint32_t)0x00000400)
#define ADC_JDR2_JDATA10_gp 10
#define ADC_JDR2_JDATA11_gm ((uint32_t)0x00000800)
#define ADC_JDR2_JDATA11_gp 11
#define ADC_JDR2_JDATA12_gm ((uint32_t)0x00001000)
#define ADC_JDR2_JDATA12_gp 12
#define ADC_JDR2_JDATA13_gm ((uint32_t)0x00002000)
#define ADC_JDR2_JDATA13_gp 13
#define ADC_JDR2_JDATA14_gm ((uint32_t)0x00004000)
#define ADC_JDR2_JDATA14_gp 14
#define ADC_JDR2_JDATA15_gm ((uint32_t)0x00008000)
#define ADC_JDR2_JDATA15_gp 15

/*** REGISTER: ADC_JDR3 ***/
#define ADC_JDR3_JDATA_gm ((uint32_t)0x0000FFFF)
#define ADC_JDR3_JDATA_gp 0
#define ADC_JDR3_JDATA0_gm ((uint32_t)0x00000001)
#define ADC_JDR3_JDATA0_gp 0
#define ADC_JDR3_JDATA1_gm ((uint32_t)0x00000002)
#define ADC_JDR3_JDATA1_gp 1
#define ADC_JDR3_JDATA2_gm ((uint32_t)0x00000004)
#define ADC_JDR3_JDATA2_gp 2
#define ADC_JDR3_JDATA3_gm ((uint32_t)0x00000008)
#define ADC_JDR3_JDATA3_gp 3
#define ADC_JDR3_JDATA4_gm ((uint32_t)0x00000010)
#define ADC_JDR3_JDATA4_gp 4
#define ADC_JDR3_JDATA5_gm ((uint32_t)0x00000020)
#define ADC_JDR3_JDATA5_gp 5
#define ADC_JDR3_JDATA6_gm ((uint32_t)0x00000040)
#define ADC_JDR3_JDATA6_gp 6
#define ADC_JDR3_JDATA7_gm ((uint32_t)0x00000080)
#define ADC_JDR3_JDATA7_gp 7
#define ADC_JDR3_JDATA8_gm ((uint32_t)0x00000100)
#define ADC_JDR3_JDATA8_gp 8
#define ADC_JDR3_JDATA9_gm ((uint32_t)0x00000200)
#define ADC_JDR3_JDATA9_gp 9
#define ADC_JDR3_JDATA10_gm ((uint32_t)0x00000400)
#define ADC_JDR3_JDATA10_gp 10
#define ADC_JDR3_JDATA11_gm ((uint32_t)0x00000800)
#define ADC_JDR3_JDATA11_gp 11
#define ADC_JDR3_JDATA12_gm ((uint32_t)0x00001000)
#define ADC_JDR3_JDATA12_gp 12
#define ADC_JDR3_JDATA13_gm ((uint32_t)0x00002000)
#define ADC_JDR3_JDATA13_gp 13
#define ADC_JDR3_JDATA14_gm ((uint32_t)0x00004000)
#define ADC_JDR3_JDATA14_gp 14
#define ADC_JDR3_JDATA15_gm ((uint32_t)0x00008000)
#define ADC_JDR3_JDATA15_gp 15

/*** REGISTER: ADC_JDR4 ***/
#define ADC_JDR4_JDATA_gm ((uint32_t)0x0000FFFF)
#define ADC_JDR4_JDATA_gp 0
#define ADC_JDR4_JDATA0_gm ((uint32_t)0x00000001)
#define ADC_JDR4_JDATA0_gp 0
#define ADC_JDR4_JDATA1_gm ((uint32_t)0x00000002)
#define ADC_JDR4_JDATA1_gp 1
#define ADC_JDR4_JDATA2_gm ((uint32_t)0x00000004)
#define ADC_JDR4_JDATA2_gp 2
#define ADC_JDR4_JDATA3_gm ((uint32_t)0x00000008)
#define ADC_JDR4_JDATA3_gp 3
#define ADC_JDR4_JDATA4_gm ((uint32_t)0x00000010)
#define ADC_JDR4_JDATA4_gp 4
#define ADC_JDR4_JDATA5_gm ((uint32_t)0x00000020)
#define ADC_JDR4_JDATA5_gp 5
#define ADC_JDR4_JDATA6_gm ((uint32_t)0x00000040)
#define ADC_JDR4_JDATA6_gp 6
#define ADC_JDR4_JDATA7_gm ((uint32_t)0x00000080)
#define ADC_JDR4_JDATA7_gp 7
#define ADC_JDR4_JDATA8_gm ((uint32_t)0x00000100)
#define ADC_JDR4_JDATA8_gp 8
#define ADC_JDR4_JDATA9_gm ((uint32_t)0x00000200)
#define ADC_JDR4_JDATA9_gp 9
#define ADC_JDR4_JDATA10_gm ((uint32_t)0x00000400)
#define ADC_JDR4_JDATA10_gp 10
#define ADC_JDR4_JDATA11_gm ((uint32_t)0x00000800)
#define ADC_JDR4_JDATA11_gp 11
#define ADC_JDR4_JDATA12_gm ((uint32_t)0x00001000)
#define ADC_JDR4_JDATA12_gp 12
#define ADC_JDR4_JDATA13_gm ((uint32_t)0x00002000)
#define ADC_JDR4_JDATA13_gp 13
#define ADC_JDR4_JDATA14_gm ((uint32_t)0x00004000)
#define ADC_JDR4_JDATA14_gp 14
#define ADC_JDR4_JDATA15_gm ((uint32_t)0x00008000)
#define ADC_JDR4_JDATA15_gp 15

/*** REGISTER: ADC_AWD2CR ***/
#define ADC_AWD2CR_AWD2CH_gm ((uint32_t)0x0007FFFE)
#define ADC_AWD2CR_AWD2CH_gp 1
#define ADC_AWD2CR_AWD2CH0_gm ((uint32_t)0x00000002)
#define ADC_AWD2CR_AWD2CH0_gp 1
#define ADC_AWD2CR_AWD2CH1_gm ((uint32_t)0x00000004)
#define ADC_AWD2CR_AWD2CH1_gp 2
#define ADC_AWD2CR_AWD2CH2_gm ((uint32_t)0x00000008)
#define ADC_AWD2CR_AWD2CH2_gp 3
#define ADC_AWD2CR_AWD2CH3_gm ((uint32_t)0x00000010)
#define ADC_AWD2CR_AWD2CH3_gp 4
#define ADC_AWD2CR_AWD2CH4_gm ((uint32_t)0x00000020)
#define ADC_AWD2CR_AWD2CH4_gp 5
#define ADC_AWD2CR_AWD2CH5_gm ((uint32_t)0x00000040)
#define ADC_AWD2CR_AWD2CH5_gp 6
#define ADC_AWD2CR_AWD2CH6_gm ((uint32_t)0x00000080)
#define ADC_AWD2CR_AWD2CH6_gp 7
#define ADC_AWD2CR_AWD2CH7_gm ((uint32_t)0x00000100)
#define ADC_AWD2CR_AWD2CH7_gp 8
#define ADC_AWD2CR_AWD2CH8_gm ((uint32_t)0x00000200)
#define ADC_AWD2CR_AWD2CH8_gp 9
#define ADC_AWD2CR_AWD2CH9_gm ((uint32_t)0x00000400)
#define ADC_AWD2CR_AWD2CH9_gp 10
#define ADC_AWD2CR_AWD2CH10_gm ((uint32_t)0x00000800)
#define ADC_AWD2CR_AWD2CH10_gp 11
#define ADC_AWD2CR_AWD2CH11_gm ((uint32_t)0x00001000)
#define ADC_AWD2CR_AWD2CH11_gp 12
#define ADC_AWD2CR_AWD2CH12_gm ((uint32_t)0x00002000)
#define ADC_AWD2CR_AWD2CH12_gp 13
#define ADC_AWD2CR_AWD2CH13_gm ((uint32_t)0x00004000)
#define ADC_AWD2CR_AWD2CH13_gp 14
#define ADC_AWD2CR_AWD2CH14_gm ((uint32_t)0x00008000)
#define ADC_AWD2CR_AWD2CH14_gp 15
#define ADC_AWD2CR_AWD2CH15_gm ((uint32_t)0x00010000)
#define ADC_AWD2CR_AWD2CH15_gp 16
#define ADC_AWD2CR_AWD2CH16_gm ((uint32_t)0x00020000)
#define ADC_AWD2CR_AWD2CH16_gp 17
#define ADC_AWD2CR_AWD2CH17_gm ((uint32_t)0x00030000)
#define ADC_AWD2CR_AWD2CH17_gp 16

/*** REGISTER: ADC_AWD3CR ***/
#define ADC_AWD3CR_AWD3CH_gm ((uint32_t)0x0007FFFE)
#define ADC_AWD3CR_AWD3CH_gp 1
#define ADC_AWD3CR_AWD3CH0_gm ((uint32_t)0x00000002)
#define ADC_AWD3CR_AWD3CH0_gp 1
#define ADC_AWD3CR_AWD3CH1_gm ((uint32_t)0x00000004)
#define ADC_AWD3CR_AWD3CH1_gp 2
#define ADC_AWD3CR_AWD3CH2_gm ((uint32_t)0x00000008)
#define ADC_AWD3CR_AWD3CH2_gp 3
#define ADC_AWD3CR_AWD3CH3_gm ((uint32_t)0x00000010)
#define ADC_AWD3CR_AWD3CH3_gp 4
#define ADC_AWD3CR_AWD3CH4_gm ((uint32_t)0x00000020)
#define ADC_AWD3CR_AWD3CH4_gp 5
#define ADC_AWD3CR_AWD3CH5_gm ((uint32_t)0x00000040)
#define ADC_AWD3CR_AWD3CH5_gp 6
#define ADC_AWD3CR_AWD3CH6_gm ((uint32_t)0x00000080)
#define ADC_AWD3CR_AWD3CH6_gp 7
#define ADC_AWD3CR_AWD3CH7_gm ((uint32_t)0x00000100)
#define ADC_AWD3CR_AWD3CH7_gp 8
#define ADC_AWD3CR_AWD3CH8_gm ((uint32_t)0x00000200)
#define ADC_AWD3CR_AWD3CH8_gp 9
#define ADC_AWD3CR_AWD3CH9_gm ((uint32_t)0x00000400)
#define ADC_AWD3CR_AWD3CH9_gp 10
#define ADC_AWD3CR_AWD3CH10_gm ((uint32_t)0x00000800)
#define ADC_AWD3CR_AWD3CH10_gp 11
#define ADC_AWD3CR_AWD3CH11_gm ((uint32_t)0x00001000)
#define ADC_AWD3CR_AWD3CH11_gp 12
#define ADC_AWD3CR_AWD3CH12_gm ((uint32_t)0x00002000)
#define ADC_AWD3CR_AWD3CH12_gp 13
#define ADC_AWD3CR_AWD3CH13_gm ((uint32_t)0x00004000)
#define ADC_AWD3CR_AWD3CH13_gp 14
#define ADC_AWD3CR_AWD3CH14_gm ((uint32_t)0x00008000)
#define ADC_AWD3CR_AWD3CH14_gp 15
#define ADC_AWD3CR_AWD3CH15_gm ((uint32_t)0x00010000)
#define ADC_AWD3CR_AWD3CH15_gp 16
#define ADC_AWD3CR_AWD3CH16_gm ((uint32_t)0x00020000)
#define ADC_AWD3CR_AWD3CH16_gp 17
#define ADC_AWD3CR_AWD3CH17_gm ((uint32_t)0x00030000)
#define ADC_AWD3CR_AWD3CH17_gp 16

