a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: ADC_DIFSEL ***/
#define ADC_DIFSEL_DIFSEL_gm ((uint32_t)0x0007FFFE)
#define ADC_DIFSEL_DIFSEL_gp 1
#define ADC_DIFSEL_DIFSEL0_gm ((uint32_t)0x00000002)
#define ADC_DIFSEL_DIFSEL0_gp 1
#define ADC_DIFSEL_DIFSEL1_gm ((uint32_t)0x00000004)
#define ADC_DIFSEL_DIFSEL1_gp 2
#define ADC_DIFSEL_DIFSEL2_gm ((uint32_t)0x00000008)
#define ADC_DIFSEL_DIFSEL2_gp 3
#define ADC_DIFSEL_DIFSEL3_gm ((uint32_t)0x00000010)
#define ADC_DIFSEL_DIFSEL3_gp 4
#define ADC_DIFSEL_DIFSEL4_gm ((uint32_t)0x00000020)
#define ADC_DIFSEL_DIFSEL4_gp 5
#define ADC_DIFSEL_DIFSEL5_gm ((uint32_t)0x00000040)
#define ADC_DIFSEL_DIFSEL5_gp 6
#define ADC_DIFSEL_DIFSEL6_gm ((uint32_t)0x00000080)
#define ADC_DIFSEL_DIFSEL6_gp 7
#define ADC_DIFSEL_DIFSEL7_gm ((uint32_t)0x00000100)
#define ADC_DIFSEL_DIFSEL7_gp 8
#define ADC_DIFSEL_DIFSEL8_gm ((uint32_t)0x00000200)
#define ADC_DIFSEL_DIFSEL8_gp 9
#define ADC_DIFSEL_DIFSEL9_gm ((uint32_t)0x00000400)
#define ADC_DIFSEL_DIFSEL9_gp 10
#define ADC_DIFSEL_DIFSEL10_gm ((uint32_t)0x00000800)
#define ADC_DIFSEL_DIFSEL10_gp 11
#define ADC_DIFSEL_DIFSEL11_gm ((uint32_t)0x00001000)
#define ADC_DIFSEL_DIFSEL11_gp 12
#define ADC_DIFSEL_DIFSEL12_gm ((uint32_t)0x00002000)
#define ADC_DIFSEL_DIFSEL12_gp 13
#define ADC_DIFSEL_DIFSEL13_gm ((uint32_t)0x00004000)
#define ADC_DIFSEL_DIFSEL13_gp 14
#define ADC_DIFSEL_DIFSEL14_gm ((uint32_t)0x00008000)
#define ADC_DIFSEL_DIFSEL14_gp 15
#define ADC_DIFSEL_DIFSEL15_gm ((uint32_t)0x00010000)
#define ADC_DIFSEL_DIFSEL15_gp 16
#define ADC_DIFSEL_DIFSEL16_gm ((uint32_t)0x00020000)
#define ADC_DIFSEL_DIFSEL16_gp 17
#define ADC_DIFSEL_DIFSEL17_gm ((uint32_t)0x00030000)
#define ADC_DIFSEL_DIFSEL17_gp 16

/*** REGISTER: ADC_CALFACT ***/
#define ADC_CALFACT_CALFACT_S_gm ((uint32_t)0x0000007F)
#define ADC_CALFACT_CALFACT_S_gp 0
#define ADC_CALFACT_CALFACT_S_0_gm ((uint32_t)0x00000001)
#define ADC_CALFACT_CALFACT_S_0_gp 0
#define ADC_CALFACT_CALFACT_S_1_gm ((uint32_t)0x00000002)
#define ADC_CALFACT_CALFACT_S_1_gp 1
#define ADC_CALFACT_CALFACT_S_2_gm ((uint32_t)0x00000004)
#define ADC_CALFACT_CALFACT_S_2_gp 2
#define ADC_CALFACT_CALFACT_S_3_gm ((uint32_t)0x00000008)
#define ADC_CALFACT_CALFACT_S_3_gp 3
#define ADC_CALFACT_CALFACT_S_4_gm ((uint32_t)0x00000010)
#define ADC_CALFACT_CALFACT_S_4_gp 4
#define ADC_CALFACT_CALFACT_S_5_gm ((uint32_t)0x00000020)
#define ADC_CALFACT_CALFACT_S_5_gp 5
#define ADC_CALFACT_CALFACT_S_6_gm ((uint32_t)0x00000040)
#define ADC_CALFACT_CALFACT_S_6_gp 6
#define ADC_CALFACT_CALFACT_D_gm ((uint32_t)0x007F0000)
#define ADC_CALFACT_CALFACT_D_gp 16
#define ADC_CALFACT_CALFACT_D_0_gm ((uint32_t)0x00010000)
#define ADC_CALFACT_CALFACT_D_0_gp 16
#define ADC_CALFACT_CALFACT_D_1_gm ((uint32_t)0x00020000)
#define ADC_CALFACT_CALFACT_D_1_gp 17
#define ADC_CALFACT_CALFACT_D_2_gm ((uint32_t)0x00040000)
#define ADC_CALFACT_CALFACT_D_2_gp 18
#define ADC_CALFACT_CALFACT_D_3_gm ((uint32_t)0x00080000)
#define ADC_CALFACT_CALFACT_D_3_gp 19
#define ADC_CALFACT_CALFACT_D_4_gm ((uint32_t)0x00100000)
#define ADC_CALFACT_CALFACT_D_4_gp 20
#define ADC_CALFACT_CALFACT_D_5_gm ((uint32_t)0x00200000)
#define ADC_CALFACT_CALFACT_D_5_gp 21
#define ADC_CALFACT_CALFACT_D_6_gm ((uint32_t)0x00400000)
#define ADC_CALFACT_CALFACT_D_6_gp 22


/********** PERIPHERAL: ADC12 **********/

/*** REGISTER: ADC12_CSR ***/
#define ADC12_CSR_ADRDY_MST_gm ((uint32_t)0x00000001)
#define ADC12_CSR_ADRDY_MST_gp 0
#define ADC12_CSR_ADRDY_EOSMP_MST_gm ((uint32_t)0x00000002)
#define ADC12_CSR_ADRDY_EOSMP_MST_gp 1
#define ADC12_CSR_ADRDY_EOC_MST_gm ((uint32_t)0x00000004)
#define ADC12_CSR_ADRDY_EOC_MST_gp 2
#define ADC12_CSR_ADRDY_EOS_MST_gm ((uint32_t)0x00000008)
#define ADC12_CSR_ADRDY_EOS_MST_gp 3
#define ADC12_CSR_ADRDY_OVR_MST_gm ((uint32_t)0x00000010)
#define ADC12_CSR_ADRDY_OVR_MST_gp 4
#define ADC12_CSR_ADRDY_JEOC_MST_gm ((uint32_t)0x00000020)
#define ADC12_CSR_ADRDY_JEOC_MST_gp 5
#define ADC12_CSR_ADRDY_JEOS_MST_gm ((uint32_t)0x00000040)
#define ADC12_CSR_ADRDY_JEOS_MST_gp 6
#define ADC12_CSR_AWD1_MST_gm ((uint32_t)0x00000080)
#define ADC12_CSR_AWD1_MST_gp 7
#define ADC12_CSR_AWD2_MST_gm ((uint32_t)0x00000100)
#define ADC12_CSR_AWD2_MST_gp 8
#define ADC12_CSR_AWD3_MST_gm ((uint32_t)0x00000200)
#define ADC12_CSR_AWD3_MST_gp 9
#define ADC12_CSR_JQOVF_MST_gm ((uint32_t)0x00000400)
#define ADC12_CSR_JQOVF_MST_gp 10
#define ADC12_CSR_ADRDY_SLV_gm ((uint32_t)0x00010000)
#define ADC12_CSR_ADRDY_SLV_gp 16
#define ADC12_CSR_ADRDY_EOSMP_SLV_gm ((uint32_t)0x00020000)
#define ADC12_CSR_ADRDY_EOSMP_SLV_gp 17
#define ADC12_CSR_ADRDY_EOC_SLV_gm ((uint32_t)0x00040000)
#define ADC12_CSR_ADRDY_EOC_SLV_gp 18
#define ADC12_CSR_ADRDY_EOS_SLV_gm ((uint32_t)0x00080000)
#define ADC12_CSR_ADRDY_EOS_SLV_gp 19
#define ADC12_CSR_ADRDY_OVR_SLV_gm ((uint32_t)0x00100000)
#define ADC12_CSR_ADRDY_OVR_SLV_gp 20
#define ADC12_CSR_ADRDY_JEOC_SLV_gm ((uint32_t)0x00200000)
#define ADC12_CSR_ADRDY_JEOC_SLV_gp 21
#define ADC12_CSR_ADRDY_JEOS_SLV_gm ((uint32_t)0x00400000)
#define ADC12_CSR_ADRDY_JEOS_SLV_gp 22
#define ADC12_CSR_AWD1_SLV_gm ((uint32_t)0x00800000)
#define ADC12_CSR_AWD1_SLV_gp 23
#define ADC12_CSR_AWD2_SLV_gm ((uint32_t)0x01000000)
#define ADC12_CSR_AWD2_SLV_gp 24
#define ADC12_CSR_AWD3_SLV_gm ((uint32_t)0x02000000)
#define ADC12_CSR_AWD3_SLV_gp 25
#define ADC12_CSR_JQOVF_SLV_gm ((uint32_t)0x04000000)
#define ADC12_CSR_JQOVF_SLV_gp 26


/********** PERIPHERAL: ADC34 **********/
#define ADC34_CSR_ADRDY_MST_gm ((uint32_t)0x00000001)
#define ADC34_CSR_ADRDY_MST_gp 0
#define ADC34_CSR_ADRDY_EOSMP_MST_gm ((uint32_t)0x00000002)
#define ADC34_CSR_ADRDY_EOSMP_MST_gp 1
#define ADC34_CSR_ADRDY_EOC_MST_gm ((uint32_t)0x00000004)
#define ADC34_CSR_ADRDY_EOC_MST_gp 2
#define ADC34_CSR_ADRDY_EOS_MST_gm ((uint32_t)0x00000008)
#define ADC34_CSR_ADRDY_EOS_MST_gp 3
#define ADC34_CSR_ADRDY_OVR_MST_gm ((uint32_t)0x00000010)
#define ADC34_CSR_ADRDY_OVR_MST_gp 4
#define ADC34_CSR_ADRDY_JEOC_MST_gm ((uint32_t)0x00000020)
#define ADC34_CSR_ADRDY_JEOC_MST_gp 5
#define ADC34_CSR_ADRDY_JEOS_MST_gm ((uint32_t)0x00000040)
#define ADC34_CSR_ADRDY_JEOS_MST_gp 6
#define ADC34_CSR_AWD1_MST_gm ((uint32_t)0x00000080)
#define ADC34_CSR_AWD1_MST_gp 7
#define ADC34_CSR_AWD2_MST_gm ((uint32_t)0x00000100)
#define ADC34_CSR_AWD2_MST_gp 8
#define ADC34_CSR_AWD3_MST_gm ((uint32_t)0x00000200)
#define ADC34_CSR_AWD3_MST_gp 9
#define ADC34_CSR_JQOVF_MST_gm ((uint32_t)0x00000400)
#define ADC34_CSR_JQOVF_MST_gp 10
#define ADC34_CSR_ADRDY_SLV_gm ((uint32_t)0x00010000)
#define ADC34_CSR_ADRDY_SLV_gp 16
#define ADC34_CSR_ADRDY_EOSMP_SLV_gm ((uint32_t)0x00020000)
#define ADC34_CSR_ADRDY_EOSMP_SLV_gp 17
#define ADC34_CSR_ADRDY_EOC_SLV_gm ((uint32_t)0x00040000)
#define ADC34_CSR_ADRDY_EOC_SLV_gp 18
#define ADC34_CSR_ADRDY_EOS_SLV_gm ((uint32_t)0x00080000)
#define ADC34_CSR_ADRDY_EOS_SLV_gp 19


/********** PERIPHERAL: ADC12 **********/
#define ADC12_CSR_ADRDY_OVR_SLV_gm ((uint32_t)0x00100000)
#define ADC12_CSR_ADRDY_OVR_SLV_gp 20


/********** PERIPHERAL: ADC34 **********/
#define ADC34_CSR_ADRDY_JEOC_SLV_gm ((uint32_t)0x00200000)
#define ADC34_CSR_ADRDY_JEOC_SLV_gp 21
#define ADC34_CSR_ADRDY_JEOS_SLV_gm ((uint32_t)0x00400000)
#define ADC34_CSR_ADRDY_JEOS_SLV_gp 22
#define ADC34_CSR_AWD1_SLV_gm ((uint32_t)0x00800000)
#define ADC34_CSR_AWD1_SLV_gp 23
#define ADC34_CSR_AWD2_SLV_gm ((uint32_t)0x01000000)
#define ADC34_CSR_AWD2_SLV_gp 24
#define ADC34_CSR_AWD3_SLV_gm ((uint32_t)0x02000000)
#define ADC34_CSR_AWD3_SLV_gp 25
#define ADC34_CSR_JQOVF_SLV_gm ((uint32_t)0x04000000)
#define ADC34_CSR_JQOVF_SLV_gp 26


/********** PERIPHERAL: ADC12 **********/

