a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: ADC12_CCR ***/
#define ADC12_CCR_MULTI_gm ((uint32_t)0x0000001F)
#define ADC12_CCR_MULTI_gp 0
#define ADC12_CCR_MULTI0_gm ((uint32_t)0x00000001)
#define ADC12_CCR_MULTI0_gp 0
#define ADC12_CCR_MULTI1_gm ((uint32_t)0x00000002)
#define ADC12_CCR_MULTI1_gp 1
#define ADC12_CCR_MULTI2_gm ((uint32_t)0x00000004)
#define ADC12_CCR_MULTI2_gp 2
#define ADC12_CCR_MULTI3_gm ((uint32_t)0x00000008)
#define ADC12_CCR_MULTI3_gp 3
#define ADC12_CCR_MULTI4_gm ((uint32_t)0x00000010)
#define ADC12_CCR_MULTI4_gp 4
#define ADC12_CCR_DELAY_gm ((uint32_t)0x00000F00)
#define ADC12_CCR_DELAY_gp 8
#define ADC12_CCR_DELAY0_gm ((uint32_t)0x00000100)
#define ADC12_CCR_DELAY0_gp 8
#define ADC12_CCR_DELAY1_gm ((uint32_t)0x00000200)
#define ADC12_CCR_DELAY1_gp 9
#define ADC12_CCR_DELAY2_gm ((uint32_t)0x00000400)
#define ADC12_CCR_DELAY2_gp 10
#define ADC12_CCR_DELAY3_gm ((uint32_t)0x00000800)
#define ADC12_CCR_DELAY3_gp 11
#define ADC12_CCR_DMACFG_gm ((uint32_t)0x00002000)
#define ADC12_CCR_DMACFG_gp 13
#define ADC12_CCR_MDMA_gm ((uint32_t)0x0000C000)
#define ADC12_CCR_MDMA_gp 14
#define ADC12_CCR_MDMA0_gm ((uint32_t)0x00004000)
#define ADC12_CCR_MDMA0_gp 14
#define ADC12_CCR_MDMA1_gm ((uint32_t)0x00008000)
#define ADC12_CCR_MDMA1_gp 15
#define ADC12_CCR_CKMODE_gm ((uint32_t)0x00030000)
#define ADC12_CCR_CKMODE_gp 16
#define ADC12_CCR_CKMODE0_gm ((uint32_t)0x00010000)
#define ADC12_CCR_CKMODE0_gp 16
#define ADC12_CCR_CKMODE1_gm ((uint32_t)0x00020000)
#define ADC12_CCR_CKMODE1_gp 17
#define ADC12_CCR_VREFEN_gm ((uint32_t)0x00400000)
#define ADC12_CCR_VREFEN_gp 22
#define ADC12_CCR_TSEN_gm ((uint32_t)0x00800000)
#define ADC12_CCR_TSEN_gp 23
#define ADC12_CCR_VBATEN_gm ((uint32_t)0x01000000)
#define ADC12_CCR_VBATEN_gp 24


/********** PERIPHERAL: ADC34 **********/
#define ADC34_CCR_MULTI_gm ((uint32_t)0x0000001F)
#define ADC34_CCR_MULTI_gp 0
#define ADC34_CCR_MULTI0_gm ((uint32_t)0x00000001)
#define ADC34_CCR_MULTI0_gp 0
#define ADC34_CCR_MULTI1_gm ((uint32_t)0x00000002)
#define ADC34_CCR_MULTI1_gp 1
#define ADC34_CCR_MULTI2_gm ((uint32_t)0x00000004)
#define ADC34_CCR_MULTI2_gp 2
#define ADC34_CCR_MULTI3_gm ((uint32_t)0x00000008)
#define ADC34_CCR_MULTI3_gp 3
#define ADC34_CCR_MULTI4_gm ((uint32_t)0x00000010)
#define ADC34_CCR_MULTI4_gp 4
#define ADC34_CCR_DELAY_gm ((uint32_t)0x00000F00)
#define ADC34_CCR_DELAY_gp 8
#define ADC34_CCR_DELAY0_gm ((uint32_t)0x00000100)
#define ADC34_CCR_DELAY0_gp 8
#define ADC34_CCR_DELAY1_gm ((uint32_t)0x00000200)
#define ADC34_CCR_DELAY1_gp 9
#define ADC34_CCR_DELAY2_gm ((uint32_t)0x00000400)
#define ADC34_CCR_DELAY2_gp 10
#define ADC34_CCR_DELAY3_gm ((uint32_t)0x00000800)
#define ADC34_CCR_DELAY3_gp 11
#define ADC34_CCR_DMACFG_gm ((uint32_t)0x00002000)
#define ADC34_CCR_DMACFG_gp 13
#define ADC34_CCR_MDMA_gm ((uint32_t)0x0000C000)
#define ADC34_CCR_MDMA_gp 14
#define ADC34_CCR_MDMA0_gm ((uint32_t)0x00004000)
#define ADC34_CCR_MDMA0_gp 14
#define ADC34_CCR_MDMA1_gm ((uint32_t)0x00008000)
#define ADC34_CCR_MDMA1_gp 15
#define ADC34_CCR_CKMODE_gm ((uint32_t)0x00030000)
#define ADC34_CCR_CKMODE_gp 16
#define ADC34_CCR_CKMODE0_gm ((uint32_t)0x00010000)
#define ADC34_CCR_CKMODE0_gp 16
#define ADC34_CCR_CKMODE1_gm ((uint32_t)0x00020000)
#define ADC34_CCR_CKMODE1_gp 17
#define ADC34_CCR_VREFEN_gm ((uint32_t)0x00400000)
#define ADC34_CCR_VREFEN_gp 22
#define ADC34_CCR_TSEN_gm ((uint32_t)0x00800000)
#define ADC34_CCR_TSEN_gp 23
#define ADC34_CCR_VBATEN_gm ((uint32_t)0x01000000)
#define ADC34_CCR_VBATEN_gp 24


/********** PERIPHERAL: ADC12 **********/

/*** REGISTER: ADC12_CDR ***/
#define ADC12_CDR_RDATA_MST_gm ((uint32_t)0x0000FFFF)
#define ADC12_CDR_RDATA_MST_gp 0
#define ADC12_CDR_RDATA_MST_0_gm ((uint32_t)0x00000001)
#define ADC12_CDR_RDATA_MST_0_gp 0
#define ADC12_CDR_RDATA_MST_1_gm ((uint32_t)0x00000002)
#define ADC12_CDR_RDATA_MST_1_gp 1
#define ADC12_CDR_RDATA_MST_2_gm ((uint32_t)0x00000004)
#define ADC12_CDR_RDATA_MST_2_gp 2
#define ADC12_CDR_RDATA_MST_3_gm ((uint32_t)0x00000008)
#define ADC12_CDR_RDATA_MST_3_gp 3
#define ADC12_CDR_RDATA_MST_4_gm ((uint32_t)0x00000010)
#define ADC12_CDR_RDATA_MST_4_gp 4
#define ADC12_CDR_RDATA_MST_5_gm ((uint32_t)0x00000020)
#define ADC12_CDR_RDATA_MST_5_gp 5
#define ADC12_CDR_RDATA_MST_6_gm ((uint32_t)0x00000040)
#define ADC12_CDR_RDATA_MST_6_gp 6
#define ADC12_CDR_RDATA_MST_7_gm ((uint32_t)0x00000080)
#define ADC12_CDR_RDATA_MST_7_gp 7
#define ADC12_CDR_RDATA_MST_8_gm ((uint32_t)0x00000100)
#define ADC12_CDR_RDATA_MST_8_gp 8
#define ADC12_CDR_RDATA_MST_9_gm ((uint32_t)0x00000200)
#define ADC12_CDR_RDATA_MST_9_gp 9
#define ADC12_CDR_RDATA_MST_10_gm ((uint32_t)0x00000400)
#define ADC12_CDR_RDATA_MST_10_gp 10
#define ADC12_CDR_RDATA_MST_11_gm ((uint32_t)0x00000800)
#define ADC12_CDR_RDATA_MST_11_gp 11
#define ADC12_CDR_RDATA_MST_12_gm ((uint32_t)0x00001000)
#define ADC12_CDR_RDATA_MST_12_gp 12
#define ADC12_CDR_RDATA_MST_13_gm ((uint32_t)0x00002000)
#define ADC12_CDR_RDATA_MST_13_gp 13
#define ADC12_CDR_RDATA_MST_14_gm ((uint32_t)0x00004000)
#define ADC12_CDR_RDATA_MST_14_gp 14
#define ADC12_CDR_RDATA_MST_15_gm ((uint32_t)0x00008000)
#define ADC12_CDR_RDATA_MST_15_gp 15
#define ADC12_CDR_RDATA_SLV_gm ((uint32_t)0xFFFF0000)
#define ADC12_CDR_RDATA_SLV_gp 16
#define ADC12_CDR_RDATA_SLV_0_gm ((uint32_t)0x00010000)
#define ADC12_CDR_RDATA_SLV_0_gp 16
#define ADC12_CDR_RDATA_SLV_1_gm ((uint32_t)0x00020000)
#define ADC12_CDR_RDATA_SLV_1_gp 17
#define ADC12_CDR_RDATA_SLV_2_gm ((uint32_t)0x00040000)
#define ADC12_CDR_RDATA_SLV_2_gp 18
#define ADC12_CDR_RDATA_SLV_3_gm ((uint32_t)0x00080000)
#define ADC12_CDR_RDATA_SLV_3_gp 19
#define ADC12_CDR_RDATA_SLV_4_gm ((uint32_t)0x00100000)
#define ADC12_CDR_RDATA_SLV_4_gp 20
#define ADC12_CDR_RDATA_SLV_5_gm ((uint32_t)0x00200000)
#define ADC12_CDR_RDATA_SLV_5_gp 21
#define ADC12_CDR_RDATA_SLV_6_gm ((uint32_t)0x00400000)
#define ADC12_CDR_RDATA_SLV_6_gp 22
#define ADC12_CDR_RDATA_SLV_7_gm ((uint32_t)0x00800000)
#define ADC12_CDR_RDATA_SLV_7_gp 23
#define ADC12_CDR_RDATA_SLV_8_gm ((uint32_t)0x01000000)
#define ADC12_CDR_RDATA_SLV_8_gp 24
#define ADC12_CDR_RDATA_SLV_9_gm ((uint32_t)0x02000000)
#define ADC12_CDR_RDATA_SLV_9_gp 25
#define ADC12_CDR_RDATA_SLV_10_gm ((uint32_t)0x04000000)
#define ADC12_CDR_RDATA_SLV_10_gp 26
#define ADC12_CDR_RDATA_SLV_11_gm ((uint32_t)0x08000000)
#define ADC12_CDR_RDATA_SLV_11_gp 27
#define ADC12_CDR_RDATA_SLV_12_gm ((uint32_t)0x10000000)
#define ADC12_CDR_RDATA_SLV_12_gp 28
#define ADC12_CDR_RDATA_SLV_13_gm ((uint32_t)0x20000000)
#define ADC12_CDR_RDATA_SLV_13_gp 29
#define ADC12_CDR_RDATA_SLV_14_gm ((uint32_t)0x40000000)
#define ADC12_CDR_RDATA_SLV_14_gp 30
#define ADC12_CDR_RDATA_SLV_15_gm ((uint32_t)0x80000000)
#define ADC12_CDR_RDATA_SLV_15_gp 31


/********** PERIPHERAL: ADC34 **********/
#define ADC34_CDR_RDATA_MST_gm ((uint32_t)0x0000FFFF)
#define ADC34_CDR_RDATA_MST_gp 0
#define ADC34_CDR_RDATA_MST_0_gm ((uint32_t)0x00000001)
#define ADC34_CDR_RDATA_MST_0_gp 0
#define ADC34_CDR_RDATA_MST_1_gm ((uint32_t)0x00000002)
#define ADC34_CDR_RDATA_MST_1_gp 1
#define ADC34_CDR_RDATA_MST_2_gm ((uint32_t)0x00000004)
#define ADC34_CDR_RDATA_MST_2_gp 2
#define ADC34_CDR_RDATA_MST_3_gm ((uint32_t)0x00000008)
#define ADC34_CDR_RDATA_MST_3_gp 3
#define ADC34_CDR_RDATA_MST_4_gm ((uint32_t)0x00000010)
#define ADC34_CDR_RDATA_MST_4_gp 4
#define ADC34_CDR_RDATA_MST_5_gm ((uint32_t)0x00000020)
#define ADC34_CDR_RDATA_MST_5_gp 5
#define ADC34_CDR_RDATA_MST_6_gm ((uint32_t)0x00000040)
#define ADC34_CDR_RDATA_MST_6_gp 6
#define ADC34_CDR_RDATA_MST_7_gm ((uint32_t)0x00000080)
#define ADC34_CDR_RDATA_MST_7_gp 7
#define ADC34_CDR_RDATA_MST_8_gm ((uint32_t)0x00000100)
#define ADC34_CDR_RDATA_MST_8_gp 8
#define ADC34_CDR_RDATA_MST_9_gm ((uint32_t)0x00000200)
#define ADC34_CDR_RDATA_MST_9_gp 9
#define ADC34_CDR_RDATA_MST_10_gm ((uint32_t)0x00000400)
#define ADC34_CDR_RDATA_MST_10_gp 10
#define ADC34_CDR_RDATA_MST_11_gm ((uint32_t)0x00000800)
#define ADC34_CDR_RDATA_MST_11_gp 11
#define ADC34_CDR_RDATA_MST_12_gm ((uint32_t)0x00001000)
#define ADC34_CDR_RDATA_MST_12_gp 12
#define ADC34_CDR_RDATA_MST_13_gm ((uint32_t)0x00002000)
#define ADC34_CDR_RDATA_MST_13_gp 13
#define ADC34_CDR_RDATA_MST_14_gm ((uint32_t)0x00004000)
#define ADC34_CDR_RDATA_MST_14_gp 14
#define ADC34_CDR_RDATA_MST_15_gm ((uint32_t)0x00008000)
#define ADC34_CDR_RDATA_MST_15_gp 15
#define ADC34_CDR_RDATA_SLV_gm ((uint32_t)0xFFFF0000)
#define ADC34_CDR_RDATA_SLV_gp 16
#define ADC34_CDR_RDATA_SLV_0_gm ((uint32_t)0x00010000)
#define ADC34_CDR_RDATA_SLV_0_gp 16
#define ADC34_CDR_RDATA_SLV_1_gm ((uint32_t)0x00020000)
#define ADC34_CDR_RDATA_SLV_1_gp 17
#define ADC34_CDR_RDATA_SLV_2_gm ((uint32_t)0x00040000)
#define ADC34_CDR_RDATA_SLV_2_gp 18
#define ADC34_CDR_RDATA_SLV_3_gm ((uint32_t)0x00080000)
#define ADC34_CDR_RDATA_SLV_3_gp 19
#define ADC34_CDR_RDATA_SLV_4_gm ((uint32_t)0x00100000)
#define ADC34_CDR_RDATA_SLV_4_gp 20
#define ADC34_CDR_RDATA_SLV_5_gm ((uint32_t)0x00200000)
#define ADC34_CDR_RDATA_SLV_5_gp 21
#define ADC34_CDR_RDATA_SLV_6_gm ((uint32_t)0x00400000)
#define ADC34_CDR_RDATA_SLV_6_gp 22
#define ADC34_CDR_RDATA_SLV_7_gm ((uint32_t)0x00800000)
#define ADC34_CDR_RDATA_SLV_7_gp 23
#define ADC34_CDR_RDATA_SLV_8_gm ((uint32_t)0x01000000)
#define ADC34_CDR_RDATA_SLV_8_gp 24
#define ADC34_CDR_RDATA_SLV_9_gm ((uint32_t)0x02000000)
#define ADC34_CDR_RDATA_SLV_9_gp 25
#define ADC34_CDR_RDATA_SLV_10_gm ((uint32_t)0x04000000)
#define ADC34_CDR_RDATA_SLV_10_gp 26
#define ADC34_CDR_RDATA_SLV_11_gm ((uint32_t)0x08000000)
#define ADC34_CDR_RDATA_SLV_11_gp 27
#define ADC34_CDR_RDATA_SLV_12_gm ((uint32_t)0x10000000)
#define ADC34_CDR_RDATA_SLV_12_gp 28
#define ADC34_CDR_RDATA_SLV_13_gm ((uint32_t)0x20000000)
#define ADC34_CDR_RDATA_SLV_13_gp 29
#define ADC34_CDR_RDATA_SLV_14_gm ((uint32_t)0x40000000)
#define ADC34_CDR_RDATA_SLV_14_gp 30
#define ADC34_CDR_RDATA_SLV_15_gm ((uint32_t)0x80000000)
#define ADC34_CDR_RDATA_SLV_15_gp 31


/********** PERIPHERAL: COMP1 **********/

/*** REGISTER: COMP1_CSR ***/
#define COMP1_CSR_COMP1EN_gm ((uint32_t)0x00000001)
#define COMP1_CSR_COMP1EN_gp 0
#define COMP1_CSR_COMP1SW1_gm ((uint32_t)0x00000002)
#define COMP1_CSR_COMP1SW1_gp 1
#define COMP1_CSR_COMP1MODE_gm ((uint32_t)0x0000000C)
#define COMP1_CSR_COMP1MODE_gp 2
#define COMP1_CSR_COMP1MODE0_gm ((uint32_t)0x00000004)
#define COMP1_CSR_COMP1MODE0_gp 2
#define COMP1_CSR_COMP1MODE1_gm ((uint32_t)0x00000008)
#define COMP1_CSR_COMP1MODE1_gp 3
#define COMP1_CSR_COMP1INSEL_gm ((uint32_t)0x00000070)
#define COMP1_CSR_COMP1INSEL_gp 4
#define COMP1_CSR_COMP1INSEL0_gm ((uint32_t)0x00000010)
#define COMP1_CSR_COMP1INSEL0_gp 4
#define COMP1_CSR_COMP1INSEL1_gm ((uint32_t)0x00000020)
#define COMP1_CSR_COMP1INSEL1_gp 5
#define COMP1_CSR_COMP1INSEL2_gm ((uint32_t)0x00000040)
#define COMP1_CSR_COMP1INSEL2_gp 6
#define COMP1_CSR_COMP1NONINSEL_gm ((uint32_t)0x00000080)
#define COMP1_CSR_COMP1NONINSEL_gp 7
#define COMP1_CSR_COMP1OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP1_CSR_COMP1OUTSEL_gp 10
#define COMP1_CSR_COMP1OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP1_CSR_COMP1OUTSEL0_gp 10
#define COMP1_CSR_COMP1OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP1_CSR_COMP1OUTSEL1_gp 11
#define COMP1_CSR_COMP1OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP1_CSR_COMP1OUTSEL2_gp 12
#define COMP1_CSR_COMP1OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP1_CSR_COMP1OUTSEL3_gp 13
#define COMP1_CSR_COMP1POL_gm ((uint32_t)0x00008000)
#define COMP1_CSR_COMP1POL_gp 15
#define COMP1_CSR_COMP1HYST_gm ((uint32_t)0x00030000)
#define COMP1_CSR_COMP1HYST_gp 16
#define COMP1_CSR_COMP1HYST0_gm ((uint32_t)0x00010000)
#define COMP1_CSR_COMP1HYST0_gp 16
#define COMP1_CSR_COMP1HYST1_gm ((uint32_t)0x00020000)
#define COMP1_CSR_COMP1HYST1_gp 17
#define COMP1_CSR_COMP1BLANKING_gm ((uint32_t)0x000C0000)
#define COMP1_CSR_COMP1BLANKING_gp 18
#define COMP1_CSR_COMP1BLANKING0_gm ((uint32_t)0x00040000)
#define COMP1_CSR_COMP1BLANKING0_gp 18
#define COMP1_CSR_COMP1BLANKING1_gm ((uint32_t)0x00080000)
#define COMP1_CSR_COMP1BLANKING1_gp 19
#define COMP1_CSR_COMP1BLANKING2_gm ((uint32_t)0x00100000)
#define COMP1_CSR_COMP1BLANKING2_gp 20
#define COMP1_CSR_COMP1OUT_gm ((uint32_t)0x40000000)
#define COMP1_CSR_COMP1OUT_gp 30
#define COMP1_CSR_COMP1LOCK_gm ((uint32_t)0x80000000)
#define COMP1_CSR_COMP1LOCK_gp 31


/********** PERIPHERAL: COMP2 **********/
#define COMP2_CSR_COMP2EN_gm ((uint32_t)0x00000001)
#define COMP2_CSR_COMP2EN_gp 0
#define COMP2_CSR_COMP2MODE_gm ((uint32_t)0x0000000C)
#define COMP2_CSR_COMP2MODE_gp 2
#define COMP2_CSR_COMP2MODE0_gm ((uint32_t)0x00000004)
#define COMP2_CSR_COMP2MODE0_gp 2
#define COMP2_CSR_COMP2MODE1_gm ((uint32_t)0x00000008)
#define COMP2_CSR_COMP2MODE1_gp 3
#define COMP2_CSR_COMP2INSEL_gm ((uint32_t)0x00000070)
#define COMP2_CSR_COMP2INSEL_gp 4
#define COMP2_CSR_COMP2INSEL0_gm ((uint32_t)0x00000010)
#define COMP2_CSR_COMP2INSEL0_gp 4
#define COMP2_CSR_COMP2INSEL1_gm ((uint32_t)0x00000020)
#define COMP2_CSR_COMP2INSEL1_gp 5
#define COMP2_CSR_COMP2INSEL2_gm ((uint32_t)0x00000040)
#define COMP2_CSR_COMP2INSEL2_gp 6
#define COMP2_CSR_COMP2NONINSEL_gm ((uint32_t)0x00000080)
#define COMP2_CSR_COMP2NONINSEL_gp 7
#define COMP2_CSR_COMP2WNDWEN_gm ((uint32_t)0x00000200)
#define COMP2_CSR_COMP2WNDWEN_gp 9
#define COMP2_CSR_COMP2OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP2_CSR_COMP2OUTSEL_gp 10
#define COMP2_CSR_COMP2OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP2_CSR_COMP2OUTSEL0_gp 10
#define COMP2_CSR_COMP2OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP2_CSR_COMP2OUTSEL1_gp 11
#define COMP2_CSR_COMP2OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP2_CSR_COMP2OUTSEL2_gp 12
#define COMP2_CSR_COMP2OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP2_CSR_COMP2OUTSEL3_gp 13
#define COMP2_CSR_COMP2POL_gm ((uint32_t)0x00008000)
#define COMP2_CSR_COMP2POL_gp 15
#define COMP2_CSR_COMP2HYST_gm ((uint32_t)0x00030000)
#define COMP2_CSR_COMP2HYST_gp 16
#define COMP2_CSR_COMP2HYST0_gm ((uint32_t)0x00010000)
#define COMP2_CSR_COMP2HYST0_gp 16
#define COMP2_CSR_COMP2HYST1_gm ((uint32_t)0x00020000)
#define COMP2_CSR_COMP2HYST1_gp 17
#define COMP2_CSR_COMP2BLANKING_gm ((uint32_t)0x000C0000)
#define COMP2_CSR_COMP2BLANKING_gp 18
#define COMP2_CSR_COMP2BLANKING0_gm ((uint32_t)0x00040000)
#define COMP2_CSR_COMP2BLANKING0_gp 18
#define COMP2_CSR_COMP2BLANKING1_gm ((uint32_t)0x00080000)
#define COMP2_CSR_COMP2BLANKING1_gp 19
#define COMP2_CSR_COMP2BLANKING2_gm ((uint32_t)0x00100000)
#define COMP2_CSR_COMP2BLANKING2_gp 20
#define COMP2_CSR_COMP2OUT_gm ((uint32_t)0x40000000)
#define COMP2_CSR_COMP2OUT_gp 30
#define COMP2_CSR_COMP2LOCK_gm ((uint32_t)0x80000000)
#define COMP2_CSR_COMP2LOCK_gp 31


