a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/********** PERIPHERAL: COMP3 **********/
#define COMP3_CSR_COMP3EN_gm ((uint32_t)0x00000001)
#define COMP3_CSR_COMP3EN_gp 0
#define COMP3_CSR_COMP3MODE_gm ((uint32_t)0x0000000C)
#define COMP3_CSR_COMP3MODE_gp 2
#define COMP3_CSR_COMP3MODE0_gm ((uint32_t)0x00000004)
#define COMP3_CSR_COMP3MODE0_gp 2
#define COMP3_CSR_COMP3MODE1_gm ((uint32_t)0x00000008)
#define COMP3_CSR_COMP3MODE1_gp 3
#define COMP3_CSR_COMP3INSEL_gm ((uint32_t)0x00000070)
#define COMP3_CSR_COMP3INSEL_gp 4
#define COMP3_CSR_COMP3INSEL0_gm ((uint32_t)0x00000010)
#define COMP3_CSR_COMP3INSEL0_gp 4
#define COMP3_CSR_COMP3INSEL1_gm ((uint32_t)0x00000020)
#define COMP3_CSR_COMP3INSEL1_gp 5
#define COMP3_CSR_COMP3INSEL2_gm ((uint32_t)0x00000040)
#define COMP3_CSR_COMP3INSEL2_gp 6
#define COMP3_CSR_COMP3NONINSEL_gm ((uint32_t)0x00000080)
#define COMP3_CSR_COMP3NONINSEL_gp 7
#define COMP3_CSR_COMP3OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP3_CSR_COMP3OUTSEL_gp 10
#define COMP3_CSR_COMP3OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP3_CSR_COMP3OUTSEL0_gp 10
#define COMP3_CSR_COMP3OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP3_CSR_COMP3OUTSEL1_gp 11
#define COMP3_CSR_COMP3OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP3_CSR_COMP3OUTSEL2_gp 12
#define COMP3_CSR_COMP3OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP3_CSR_COMP3OUTSEL3_gp 13
#define COMP3_CSR_COMP3POL_gm ((uint32_t)0x00008000)
#define COMP3_CSR_COMP3POL_gp 15
#define COMP3_CSR_COMP3HYST_gm ((uint32_t)0x00030000)
#define COMP3_CSR_COMP3HYST_gp 16
#define COMP3_CSR_COMP3HYST0_gm ((uint32_t)0x00010000)
#define COMP3_CSR_COMP3HYST0_gp 16
#define COMP3_CSR_COMP3HYST1_gm ((uint32_t)0x00020000)
#define COMP3_CSR_COMP3HYST1_gp 17
#define COMP3_CSR_COMP3BLANKING_gm ((uint32_t)0x000C0000)
#define COMP3_CSR_COMP3BLANKING_gp 18
#define COMP3_CSR_COMP3BLANKING0_gm ((uint32_t)0x00040000)
#define COMP3_CSR_COMP3BLANKING0_gp 18
#define COMP3_CSR_COMP3BLANKING1_gm ((uint32_t)0x00080000)
#define COMP3_CSR_COMP3BLANKING1_gp 19
#define COMP3_CSR_COMP3BLANKING2_gm ((uint32_t)0x00100000)
#define COMP3_CSR_COMP3BLANKING2_gp 20
#define COMP3_CSR_COMP3OUT_gm ((uint32_t)0x40000000)
#define COMP3_CSR_COMP3OUT_gp 30
#define COMP3_CSR_COMP3LOCK_gm ((uint32_t)0x80000000)
#define COMP3_CSR_COMP3LOCK_gp 31


/********** PERIPHERAL: COMP4 **********/
#define COMP4_CSR_COMP4EN_gm ((uint32_t)0x00000001)
#define COMP4_CSR_COMP4EN_gp 0
#define COMP4_CSR_COMP4MODE_gm ((uint32_t)0x0000000C)
#define COMP4_CSR_COMP4MODE_gp 2
#define COMP4_CSR_COMP4MODE0_gm ((uint32_t)0x00000004)
#define COMP4_CSR_COMP4MODE0_gp 2
#define COMP4_CSR_COMP4MODE1_gm ((uint32_t)0x00000008)
#define COMP4_CSR_COMP4MODE1_gp 3
#define COMP4_CSR_COMP4INSEL_gm ((uint32_t)0x00000070)
#define COMP4_CSR_COMP4INSEL_gp 4
#define COMP4_CSR_COMP4INSEL0_gm ((uint32_t)0x00000010)
#define COMP4_CSR_COMP4INSEL0_gp 4
#define COMP4_CSR_COMP4INSEL1_gm ((uint32_t)0x00000020)
#define COMP4_CSR_COMP4INSEL1_gp 5
#define COMP4_CSR_COMP4INSEL2_gm ((uint32_t)0x00000040)
#define COMP4_CSR_COMP4INSEL2_gp 6
#define COMP4_CSR_COMP4NONINSEL_gm ((uint32_t)0x00000080)
#define COMP4_CSR_COMP4NONINSEL_gp 7
#define COMP4_CSR_COMP4WNDWEN_gm ((uint32_t)0x00000200)
#define COMP4_CSR_COMP4WNDWEN_gp 9
#define COMP4_CSR_COMP4OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP4_CSR_COMP4OUTSEL_gp 10
#define COMP4_CSR_COMP4OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP4_CSR_COMP4OUTSEL0_gp 10
#define COMP4_CSR_COMP4OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP4_CSR_COMP4OUTSEL1_gp 11
#define COMP4_CSR_COMP4OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP4_CSR_COMP4OUTSEL2_gp 12
#define COMP4_CSR_COMP4OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP4_CSR_COMP4OUTSEL3_gp 13
#define COMP4_CSR_COMP4POL_gm ((uint32_t)0x00008000)
#define COMP4_CSR_COMP4POL_gp 15
#define COMP4_CSR_COMP4HYST_gm ((uint32_t)0x00030000)
#define COMP4_CSR_COMP4HYST_gp 16
#define COMP4_CSR_COMP4HYST0_gm ((uint32_t)0x00010000)
#define COMP4_CSR_COMP4HYST0_gp 16
#define COMP4_CSR_COMP4HYST1_gm ((uint32_t)0x00020000)
#define COMP4_CSR_COMP4HYST1_gp 17
#define COMP4_CSR_COMP4BLANKING_gm ((uint32_t)0x000C0000)
#define COMP4_CSR_COMP4BLANKING_gp 18
#define COMP4_CSR_COMP4BLANKING0_gm ((uint32_t)0x00040000)
#define COMP4_CSR_COMP4BLANKING0_gp 18
#define COMP4_CSR_COMP4BLANKING1_gm ((uint32_t)0x00080000)
#define COMP4_CSR_COMP4BLANKING1_gp 19
#define COMP4_CSR_COMP4BLANKING2_gm ((uint32_t)0x00100000)
#define COMP4_CSR_COMP4BLANKING2_gp 20
#define COMP4_CSR_COMP4OUT_gm ((uint32_t)0x40000000)
#define COMP4_CSR_COMP4OUT_gp 30
#define COMP4_CSR_COMP4LOCK_gm ((uint32_t)0x80000000)
#define COMP4_CSR_COMP4LOCK_gp 31


/********** PERIPHERAL: COMP5 **********/
#define COMP5_CSR_COMP5EN_gm ((uint32_t)0x00000001)
#define COMP5_CSR_COMP5EN_gp 0
#define COMP5_CSR_COMP5MODE_gm ((uint32_t)0x0000000C)
#define COMP5_CSR_COMP5MODE_gp 2
#define COMP5_CSR_COMP5MODE0_gm ((uint32_t)0x00000004)
#define COMP5_CSR_COMP5MODE0_gp 2
#define COMP5_CSR_COMP5MODE1_gm ((uint32_t)0x00000008)
#define COMP5_CSR_COMP5MODE1_gp 3
#define COMP5_CSR_COMP5INSEL_gm ((uint32_t)0x00000070)
#define COMP5_CSR_COMP5INSEL_gp 4
#define COMP5_CSR_COMP5INSEL0_gm ((uint32_t)0x00000010)
#define COMP5_CSR_COMP5INSEL0_gp 4
#define COMP5_CSR_COMP5INSEL1_gm ((uint32_t)0x00000020)
#define COMP5_CSR_COMP5INSEL1_gp 5
#define COMP5_CSR_COMP5INSEL2_gm ((uint32_t)0x00000040)
#define COMP5_CSR_COMP5INSEL2_gp 6
#define COMP5_CSR_COMP5NONINSEL_gm ((uint32_t)0x00000080)
#define COMP5_CSR_COMP5NONINSEL_gp 7
#define COMP5_CSR_COMP5OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP5_CSR_COMP5OUTSEL_gp 10
#define COMP5_CSR_COMP5OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP5_CSR_COMP5OUTSEL0_gp 10
#define COMP5_CSR_COMP5OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP5_CSR_COMP5OUTSEL1_gp 11
#define COMP5_CSR_COMP5OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP5_CSR_COMP5OUTSEL2_gp 12
#define COMP5_CSR_COMP5OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP5_CSR_COMP5OUTSEL3_gp 13
#define COMP5_CSR_COMP5POL_gm ((uint32_t)0x00008000)
#define COMP5_CSR_COMP5POL_gp 15
#define COMP5_CSR_COMP5HYST_gm ((uint32_t)0x00030000)
#define COMP5_CSR_COMP5HYST_gp 16
#define COMP5_CSR_COMP5HYST0_gm ((uint32_t)0x00010000)
#define COMP5_CSR_COMP5HYST0_gp 16
#define COMP5_CSR_COMP5HYST1_gm ((uint32_t)0x00020000)
#define COMP5_CSR_COMP5HYST1_gp 17
#define COMP5_CSR_COMP5BLANKING_gm ((uint32_t)0x000C0000)
#define COMP5_CSR_COMP5BLANKING_gp 18
#define COMP5_CSR_COMP5BLANKING0_gm ((uint32_t)0x00040000)
#define COMP5_CSR_COMP5BLANKING0_gp 18
#define COMP5_CSR_COMP5BLANKING1_gm ((uint32_t)0x00080000)
#define COMP5_CSR_COMP5BLANKING1_gp 19
#define COMP5_CSR_COMP5BLANKING2_gm ((uint32_t)0x00100000)
#define COMP5_CSR_COMP5BLANKING2_gp 20
#define COMP5_CSR_COMP5OUT_gm ((uint32_t)0x40000000)
#define COMP5_CSR_COMP5OUT_gp 30
#define COMP5_CSR_COMP5LOCK_gm ((uint32_t)0x80000000)
#define COMP5_CSR_COMP5LOCK_gp 31


/********** PERIPHERAL: COMP6 **********/
#define COMP6_CSR_COMP6EN_gm ((uint32_t)0x00000001)
#define COMP6_CSR_COMP6EN_gp 0
#define COMP6_CSR_COMP6MODE_gm ((uint32_t)0x0000000C)
#define COMP6_CSR_COMP6MODE_gp 2
#define COMP6_CSR_COMP6MODE0_gm ((uint32_t)0x00000004)
#define COMP6_CSR_COMP6MODE0_gp 2
#define COMP6_CSR_COMP6MODE1_gm ((uint32_t)0x00000008)
#define COMP6_CSR_COMP6MODE1_gp 3
#define COMP6_CSR_COMP6INSEL_gm ((uint32_t)0x00000070)
#define COMP6_CSR_COMP6INSEL_gp 4
#define COMP6_CSR_COMP6INSEL0_gm ((uint32_t)0x00000010)
#define COMP6_CSR_COMP6INSEL0_gp 4
#define COMP6_CSR_COMP6INSEL1_gm ((uint32_t)0x00000020)
#define COMP6_CSR_COMP6INSEL1_gp 5
#define COMP6_CSR_COMP6INSEL2_gm ((uint32_t)0x00000040)
#define COMP6_CSR_COMP6INSEL2_gp 6
#define COMP6_CSR_COMP6NONINSEL_gm ((uint32_t)0x00000080)
#define COMP6_CSR_COMP6NONINSEL_gp 7
#define COMP6_CSR_COMP6WNDWEN_gm ((uint32_t)0x00000200)
#define COMP6_CSR_COMP6WNDWEN_gp 9
#define COMP6_CSR_COMP6OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP6_CSR_COMP6OUTSEL_gp 10
#define COMP6_CSR_COMP6OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP6_CSR_COMP6OUTSEL0_gp 10
#define COMP6_CSR_COMP6OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP6_CSR_COMP6OUTSEL1_gp 11
#define COMP6_CSR_COMP6OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP6_CSR_COMP6OUTSEL2_gp 12
#define COMP6_CSR_COMP6OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP6_CSR_COMP6OUTSEL3_gp 13
#define COMP6_CSR_COMP6POL_gm ((uint32_t)0x00008000)
#define COMP6_CSR_COMP6POL_gp 15
#define COMP6_CSR_COMP6HYST_gm ((uint32_t)0x00030000)
#define COMP6_CSR_COMP6HYST_gp 16
#define COMP6_CSR_COMP6HYST0_gm ((uint32_t)0x00010000)
#define COMP6_CSR_COMP6HYST0_gp 16
#define COMP6_CSR_COMP6HYST1_gm ((uint32_t)0x00020000)
#define COMP6_CSR_COMP6HYST1_gp 17
#define COMP6_CSR_COMP6BLANKING_gm ((uint32_t)0x000C0000)
#define COMP6_CSR_COMP6BLANKING_gp 18
#define COMP6_CSR_COMP6BLANKING0_gm ((uint32_t)0x00040000)
#define COMP6_CSR_COMP6BLANKING0_gp 18
#define COMP6_CSR_COMP6BLANKING1_gm ((uint32_t)0x00080000)
#define COMP6_CSR_COMP6BLANKING1_gp 19
#define COMP6_CSR_COMP6BLANKING2_gm ((uint32_t)0x00100000)
#define COMP6_CSR_COMP6BLANKING2_gp 20
#define COMP6_CSR_COMP6OUT_gm ((uint32_t)0x40000000)
#define COMP6_CSR_COMP6OUT_gp 30
#define COMP6_CSR_COMP6LOCK_gm ((uint32_t)0x80000000)
#define COMP6_CSR_COMP6LOCK_gp 31


/********** PERIPHERAL: COMP7 **********/
#define COMP7_CSR_COMP7EN_gm ((uint32_t)0x00000001)
#define COMP7_CSR_COMP7EN_gp 0
#define COMP7_CSR_COMP7MODE_gm ((uint32_t)0x0000000C)
#define COMP7_CSR_COMP7MODE_gp 2
#define COMP7_CSR_COMP7MODE0_gm ((uint32_t)0x00000004)
#define COMP7_CSR_COMP7MODE0_gp 2
#define COMP7_CSR_COMP7MODE1_gm ((uint32_t)0x00000008)
#define COMP7_CSR_COMP7MODE1_gp 3
#define COMP7_CSR_COMP7INSEL_gm ((uint32_t)0x00000070)
#define COMP7_CSR_COMP7INSEL_gp 4
#define COMP7_CSR_COMP7INSEL0_gm ((uint32_t)0x00000010)
#define COMP7_CSR_COMP7INSEL0_gp 4
#define COMP7_CSR_COMP7INSEL1_gm ((uint32_t)0x00000020)
#define COMP7_CSR_COMP7INSEL1_gp 5
#define COMP7_CSR_COMP7INSEL2_gm ((uint32_t)0x00000040)
#define COMP7_CSR_COMP7INSEL2_gp 6
#define COMP7_CSR_COMP7NONINSEL_gm ((uint32_t)0x00000080)
#define COMP7_CSR_COMP7NONINSEL_gp 7
#define COMP7_CSR_COMP7OUTSEL_gm ((uint32_t)0x00003C00)
#define COMP7_CSR_COMP7OUTSEL_gp 10
#define COMP7_CSR_COMP7OUTSEL0_gm ((uint32_t)0x00000400)
#define COMP7_CSR_COMP7OUTSEL0_gp 10
#define COMP7_CSR_COMP7OUTSEL1_gm ((uint32_t)0x00000800)
#define COMP7_CSR_COMP7OUTSEL1_gp 11
#define COMP7_CSR_COMP7OUTSEL2_gm ((uint32_t)0x00001000)
#define COMP7_CSR_COMP7OUTSEL2_gp 12
#define COMP7_CSR_COMP7OUTSEL3_gm ((uint32_t)0x00002000)
#define COMP7_CSR_COMP7OUTSEL3_gp 13
#define COMP7_CSR_COMP7POL_gm ((uint32_t)0x00008000)
#define COMP7_CSR_COMP7POL_gp 15
#define COMP7_CSR_COMP7HYST_gm ((uint32_t)0x00030000)
#define COMP7_CSR_COMP7HYST_gp 16
#define COMP7_CSR_COMP7HYST0_gm ((uint32_t)0x00010000)
#define COMP7_CSR_COMP7HYST0_gp 16
#define COMP7_CSR_COMP7HYST1_gm ((uint32_t)0x00020000)
#define COMP7_CSR_COMP7HYST1_gp 17
#define COMP7_CSR_COMP7BLANKING_gm ((uint32_t)0x000C0000)
#define COMP7_CSR_COMP7BLANKING_gp 18
#define COMP7_CSR_COMP7BLANKING0_gm ((uint32_t)0x00040000)
#define COMP7_CSR_COMP7BLANKING0_gp 18
#define COMP7_CSR_COMP7BLANKING1_gm ((uint32_t)0x00080000)
#define COMP7_CSR_COMP7BLANKING1_gp 19
#define COMP7_CSR_COMP7BLANKING2_gm ((uint32_t)0x00100000)
#define COMP7_CSR_COMP7BLANKING2_gp 20
#define COMP7_CSR_COMP7OUT_gm ((uint32_t)0x40000000)
#define COMP7_CSR_COMP7OUT_gp 30
#define COMP7_CSR_COMP7LOCK_gm ((uint32_t)0x80000000)
#define COMP7_CSR_COMP7LOCK_gp 31


/********** PERIPHERAL: COMP **********/
#define COMP_CSR_COMPxEN_gm ((uint32_t)0x00000001)
#define COMP_CSR_COMPxEN_gp 0
#define COMP_CSR_COMP1SW1_gm ((uint32_t)0x00000002)
#define COMP_CSR_COMP1SW1_gp 1
#define COMP_CSR_COMPxMODE_gm ((uint32_t)0x0000000C)
#define COMP_CSR_COMPxMODE_gp 2
#define COMP_CSR_COMPxMODE_0_gm ((uint32_t)0x00000004)
#define COMP_CSR_COMPxMODE_0_gp 2
#define COMP_CSR_COMPxMODE_1_gm ((uint32_t)0x00000008)
#define COMP_CSR_COMPxMODE_1_gp 3
#define COMP_CSR_COMPxINSEL_gm ((uint32_t)0x00000070)
#define COMP_CSR_COMPxINSEL_gp 4
#define COMP_CSR_COMPxINSEL_0_gm ((uint32_t)0x00000010)
#define COMP_CSR_COMPxINSEL_0_gp 4
#define COMP_CSR_COMPxINSEL_1_gm ((uint32_t)0x00000020)
#define COMP_CSR_COMPxINSEL_1_gp 5
#define COMP_CSR_COMPxINSEL_2_gm ((uint32_t)0x00000040)
#define COMP_CSR_COMPxINSEL_2_gp 6
#define COMP_CSR_COMPxNONINSEL_gm ((uint32_t)0x00000080)
#define COMP_CSR_COMPxNONINSEL_gp 7
#define COMP_CSR_COMPxWNDWEN_gm ((uint32_t)0x00000200)
#define COMP_CSR_COMPxWNDWEN_gp 9
#define COMP_CSR_COMPxOUTSEL_gm ((uint32_t)0x00003C00)
#define COMP_CSR_COMPxOUTSEL_gp 10
#define COMP_CSR_COMPxOUTSEL_0_gm ((uint32_t)0x00000400)
#define COMP_CSR_COMPxOUTSEL_0_gp 10
#define COMP_CSR_COMPxOUTSEL_1_gm ((uint32_t)0x00000800)
#define COMP_CSR_COMPxOUTSEL_1_gp 11
#define COMP_CSR_COMPxOUTSEL_2_gm ((uint32_t)0x00001000)
#define COMP_CSR_COMPxOUTSEL_2_gp 12
#define COMP_CSR_COMPxOUTSEL_3_gm ((uint32_t)0x00002000)
#define COMP_CSR_COMPxOUTSEL_3_gp 13
#define COMP_CSR_COMPxPOL_gm ((uint32_t)0x00008000)
#define COMP_CSR_COMPxPOL_gp 15
#define COMP_CSR_COMPxHYST_gm ((uint32_t)0x00030000)
#define COMP_CSR_COMPxHYST_gp 16
#define COMP_CSR_COMPxHYST_0_gm ((uint32_t)0x00010000)
#define COMP_CSR_COMPxHYST_0_gp 16
#define COMP_CSR_COMPxHYST_1_gm ((uint32_t)0x00020000)
#define COMP_CSR_COMPxHYST_1_gp 17
#define COMP_CSR_COMPxBLANKING_gm ((uint32_t)0x000C0000)
#define COMP_CSR_COMPxBLANKING_gp 18
#define COMP_CSR_COMPxBLANKING_0_gm ((uint32_t)0x00040000)
#define COMP_CSR_COMPxBLANKING_0_gp 18
#define COMP_CSR_COMPxBLANKING_1_gm ((uint32_t)0x00080000)
#define COMP_CSR_COMPxBLANKING_1_gp 19
#define COMP_CSR_COMPxBLANKING_2_gm ((uint32_t)0x00100000)
#define COMP_CSR_COMPxBLANKING_2_gp 20
#define COMP_CSR_COMPxOUT_gm ((uint32_t)0x40000000)
#define COMP_CSR_COMPxOUT_gp 30
#define COMP_CSR_COMPxLOCK_gm ((uint32_t)0x80000000)
#define COMP_CSR_COMPxLOCK_gp 31


/********** PERIPHERAL: OPAMP1 **********/
#define OPAMP1_CSR_OPAMP1EN_gm ((uint32_t)0x00000001)
#define OPAMP1_CSR_OPAMP1EN_gp 0
#define OPAMP1_CSR_FORCEVP_gm ((uint32_t)0x00000002)
#define OPAMP1_CSR_FORCEVP_gp 1
#define OPAMP1_CSR_VPSEL_gm ((uint32_t)0x0000000C)
#define OPAMP1_CSR_VPSEL_gp 2
#define OPAMP1_CSR_VPSEL0_gm ((uint32_t)0x00000004)
#define OPAMP1_CSR_VPSEL0_gp 2
#define OPAMP1_CSR_VPSEL1_gm ((uint32_t)0x00000008)
#define OPAMP1_CSR_VPSEL1_gp 3
#define OPAMP1_CSR_VMSEL_gm ((uint32_t)0x00000060)
#define OPAMP1_CSR_VMSEL_gp 5
#define OPAMP1_CSR_VMSEL0_gm ((uint32_t)0x00000020)
#define OPAMP1_CSR_VMSEL0_gp 5
#define OPAMP1_CSR_VMSEL1_gm ((uint32_t)0x00000040)
#define OPAMP1_CSR_VMSEL1_gp 6
#define OPAMP1_CSR_TCMEN_gm ((uint32_t)0x00000080)
#define OPAMP1_CSR_TCMEN_gp 7
#define OPAMP1_CSR_VMSSEL_gm ((uint32_t)0x00000100)
#define OPAMP1_CSR_VMSSEL_gp 8
#define OPAMP1_CSR_VPSSEL_gm ((uint32_t)0x00000600)
#define OPAMP1_CSR_VPSSEL_gp 9
#define OPAMP1_CSR_VPSSEL0_gm ((uint32_t)0x00000200)
#define OPAMP1_CSR_VPSSEL0_gp 9
#define OPAMP1_CSR_VPSSEL1_gm ((uint32_t)0x00000400)
#define OPAMP1_CSR_VPSSEL1_gp 10
#define OPAMP1_CSR_CALON_gm ((uint32_t)0x00000800)
#define OPAMP1_CSR_CALON_gp 11
#define OPAMP1_CSR_CALSEL_gm ((uint32_t)0x00003000)
#define OPAMP1_CSR_CALSEL_gp 12
#define OPAMP1_CSR_CALSEL0_gm ((uint32_t)0x00001000)
#define OPAMP1_CSR_CALSEL0_gp 12
#define OPAMP1_CSR_CALSEL1_gm ((uint32_t)0x00002000)
#define OPAMP1_CSR_CALSEL1_gp 13
#define OPAMP1_CSR_PGGAIN_gm ((uint32_t)0x0003C000)
#define OPAMP1_CSR_PGGAIN_gp 14
#define OPAMP1_CSR_PGGAIN0_gm ((uint32_t)0x00004000)
#define OPAMP1_CSR_PGGAIN0_gp 14
#define OPAMP1_CSR_PGGAIN1_gm ((uint32_t)0x00008000)
#define OPAMP1_CSR_PGGAIN1_gp 15
#define OPAMP1_CSR_PGGAIN2_gm ((uint32_t)0x00010000)
#define OPAMP1_CSR_PGGAIN2_gp 16
#define OPAMP1_CSR_PGGAIN3_gm ((uint32_t)0x00020000)
#define OPAMP1_CSR_PGGAIN3_gp 17
#define OPAMP1_CSR_USERTRIM_gm ((uint32_t)0x00040000)
#define OPAMP1_CSR_USERTRIM_gp 18
#define OPAMP1_CSR_TRIMOFFSETP_gm ((uint32_t)0x00F80000)
#define OPAMP1_CSR_TRIMOFFSETP_gp 19
#define OPAMP1_CSR_TRIMOFFSETN_gm ((uint32_t)0x1F000000)
#define OPAMP1_CSR_TRIMOFFSETN_gp 24
#define OPAMP1_CSR_TSTREF_gm ((uint32_t)0x20000000)
#define OPAMP1_CSR_TSTREF_gp 29
#define OPAMP1_CSR_OUTCAL_gm ((uint32_t)0x40000000)
#define OPAMP1_CSR_OUTCAL_gp 30
#define OPAMP1_CSR_LOCK_gm ((uint32_t)0x80000000)
#define OPAMP1_CSR_LOCK_gp 31


/********** PERIPHERAL: OPAMP2 **********/
#define OPAMP2_CSR_OPAMP2EN_gm ((uint32_t)0x00000001)
#define OPAMP2_CSR_OPAMP2EN_gp 0
#define OPAMP2_CSR_FORCEVP_gm ((uint32_t)0x00000002)
#define OPAMP2_CSR_FORCEVP_gp 1
#define OPAMP2_CSR_VPSEL_gm ((uint32_t)0x0000000C)
#define OPAMP2_CSR_VPSEL_gp 2
#define OPAMP2_CSR_VPSEL0_gm ((uint32_t)0x00000004)
#define OPAMP2_CSR_VPSEL0_gp 2
#define OPAMP2_CSR_VPSEL1_gm ((uint32_t)0x00000008)
#define OPAMP2_CSR_VPSEL1_gp 3
#define OPAMP2_CSR_VMSEL_gm ((uint32_t)0x00000060)
#define OPAMP2_CSR_VMSEL_gp 5
#define OPAMP2_CSR_VMSEL0_gm ((uint32_t)0x00000020)
#define OPAMP2_CSR_VMSEL0_gp 5
#define OPAMP2_CSR_VMSEL1_gm ((uint32_t)0x00000040)
#define OPAMP2_CSR_VMSEL1_gp 6
#define OPAMP2_CSR_TCMEN_gm ((uint32_t)0x00000080)
#define OPAMP2_CSR_TCMEN_gp 7
#define OPAMP2_CSR_VMSSEL_gm ((uint32_t)0x00000100)
#define OPAMP2_CSR_VMSSEL_gp 8
#define OPAMP2_CSR_VPSSEL_gm ((uint32_t)0x00000600)
#define OPAMP2_CSR_VPSSEL_gp 9
#define OPAMP2_CSR_VPSSEL0_gm ((uint32_t)0x00000200)
#define OPAMP2_CSR_VPSSEL0_gp 9
#define OPAMP2_CSR_VPSSEL1_gm ((uint32_t)0x00000400)
#define OPAMP2_CSR_VPSSEL1_gp 10
#define OPAMP2_CSR_CALON_gm ((uint32_t)0x00000800)
#define OPAMP2_CSR_CALON_gp 11
#define OPAMP2_CSR_CALSEL_gm ((uint32_t)0x00003000)
#define OPAMP2_CSR_CALSEL_gp 12
#define OPAMP2_CSR_CALSEL0_gm ((uint32_t)0x00001000)
#define OPAMP2_CSR_CALSEL0_gp 12
#define OPAMP2_CSR_CALSEL1_gm ((uint32_t)0x00002000)
#define OPAMP2_CSR_CALSEL1_gp 13
#define OPAMP2_CSR_PGGAIN_gm ((uint32_t)0x0003C000)
#define OPAMP2_CSR_PGGAIN_gp 14
#define OPAMP2_CSR_PGGAIN0_gm ((uint32_t)0x00004000)
#define OPAMP2_CSR_PGGAIN0_gp 14
#define OPAMP2_CSR_PGGAIN1_gm ((uint32_t)0x00008000)
#define OPAMP2_CSR_PGGAIN1_gp 15
#define OPAMP2_CSR_PGGAIN2_gm ((uint32_t)0x00010000)
#define OPAMP2_CSR_PGGAIN2_gp 16
#define OPAMP2_CSR_PGGAIN3_gm ((uint32_t)0x00020000)
#define OPAMP2_CSR_PGGAIN3_gp 17
#define OPAMP2_CSR_USERTRIM_gm ((uint32_t)0x00040000)
#define OPAMP2_CSR_USERTRIM_gp 18
#define OPAMP2_CSR_TRIMOFFSETP_gm ((uint32_t)0x00F80000)
#define OPAMP2_CSR_TRIMOFFSETP_gp 19
#define OPAMP2_CSR_TRIMOFFSETN_gm ((uint32_t)0x1F000000)
#define OPAMP2_CSR_TRIMOFFSETN_gp 24
#define OPAMP2_CSR_TSTREF_gm ((uint32_t)0x20000000)
#define OPAMP2_CSR_TSTREF_gp 29
#define OPAMP2_CSR_OUTCAL_gm ((uint32_t)0x40000000)
#define OPAMP2_CSR_OUTCAL_gp 30
#define OPAMP2_CSR_LOCK_gm ((uint32_t)0x80000000)
#define OPAMP2_CSR_LOCK_gp 31


/********** PERIPHERAL: OPAMP3 **********/
#define OPAMP3_CSR_OPAMP3EN_gm ((uint32_t)0x00000001)
#define OPAMP3_CSR_OPAMP3EN_gp 0
#define OPAMP3_CSR_FORCEVP_gm ((uint32_t)0x00000002)
#define OPAMP3_CSR_FORCEVP_gp 1
#define OPAMP3_CSR_VPSEL_gm ((uint32_t)0x0000000C)
#define OPAMP3_CSR_VPSEL_gp 2
#define OPAMP3_CSR_VPSEL0_gm ((uint32_t)0x00000004)
#define OPAMP3_CSR_VPSEL0_gp 2
#define OPAMP3_CSR_VPSEL1_gm ((uint32_t)0x00000008)
#define OPAMP3_CSR_VPSEL1_gp 3
#define OPAMP3_CSR_VMSEL_gm ((uint32_t)0x00000060)
#define OPAMP3_CSR_VMSEL_gp 5
#define OPAMP3_CSR_VMSEL0_gm ((uint32_t)0x00000020)
#define OPAMP3_CSR_VMSEL0_gp 5
#define OPAMP3_CSR_VMSEL1_gm ((uint32_t)0x00000040)
#define OPAMP3_CSR_VMSEL1_gp 6
#define OPAMP3_CSR_TCMEN_gm ((uint32_t)0x00000080)
#define OPAMP3_CSR_TCMEN_gp 7
#define OPAMP3_CSR_VMSSEL_gm ((uint32_t)0x00000100)
#define OPAMP3_CSR_VMSSEL_gp 8
#define OPAMP3_CSR_VPSSEL_gm ((uint32_t)0x00000600)
#define OPAMP3_CSR_VPSSEL_gp 9
#define OPAMP3_CSR_VPSSEL0_gm ((uint32_t)0x00000200)
#define OPAMP3_CSR_VPSSEL0_gp 9
#define OPAMP3_CSR_VPSSEL1_gm ((uint32_t)0x00000400)
#define OPAMP3_CSR_VPSSEL1_gp 10
#define OPAMP3_CSR_CALON_gm ((uint32_t)0x00000800)
#define OPAMP3_CSR_CALON_gp 11
#define OPAMP3_CSR_CALSEL_gm ((uint32_t)0x00003000)
#define OPAMP3_CSR_CALSEL_gp 12
#define OPAMP3_CSR_CALSEL0_gm ((uint32_t)0x00001000)
#define OPAMP3_CSR_CALSEL0_gp 12
#define OPAMP3_CSR_CALSEL1_gm ((uint32_t)0x00002000)
#define OPAMP3_CSR_CALSEL1_gp 13
#define OPAMP3_CSR_PGGAIN_gm ((uint32_t)0x0003C000)
#define OPAMP3_CSR_PGGAIN_gp 14
#define OPAMP3_CSR_PGGAIN0_gm ((uint32_t)0x00004000)
#define OPAMP3_CSR_PGGAIN0_gp 14
#define OPAMP3_CSR_PGGAIN1_gm ((uint32_t)0x00008000)
#define OPAMP3_CSR_PGGAIN1_gp 15
#define OPAMP3_CSR_PGGAIN2_gm ((uint32_t)0x00010000)
#define OPAMP3_CSR_PGGAIN2_gp 16
#define OPAMP3_CSR_PGGAIN3_gm ((uint32_t)0x00020000)
#define OPAMP3_CSR_PGGAIN3_gp 17
#define OPAMP3_CSR_USERTRIM_gm ((uint32_t)0x00040000)
#define OPAMP3_CSR_USERTRIM_gp 18
#define OPAMP3_CSR_TRIMOFFSETP_gm ((uint32_t)0x00F80000)
#define OPAMP3_CSR_TRIMOFFSETP_gp 19
#define OPAMP3_CSR_TRIMOFFSETN_gm ((uint32_t)0x1F000000)
#define OPAMP3_CSR_TRIMOFFSETN_gp 24
#define OPAMP3_CSR_TSTREF_gm ((uint32_t)0x20000000)
#define OPAMP3_CSR_TSTREF_gp 29
#define OPAMP3_CSR_OUTCAL_gm ((uint32_t)0x40000000)
#define OPAMP3_CSR_OUTCAL_gp 30
#define OPAMP3_CSR_LOCK_gm ((uint32_t)0x80000000)
#define OPAMP3_CSR_LOCK_gp 31


/********** PERIPHERAL: OPAMP4 **********/
#define OPAMP4_CSR_OPAMP4EN_gm ((uint32_t)0x00000001)
#define OPAMP4_CSR_OPAMP4EN_gp 0
#define OPAMP4_CSR_FORCEVP_gm ((uint32_t)0x00000002)
#define OPAMP4_CSR_FORCEVP_gp 1
#define OPAMP4_CSR_VPSEL_gm ((uint32_t)0x0000000C)
#define OPAMP4_CSR_VPSEL_gp 2
#define OPAMP4_CSR_VPSEL0_gm ((uint32_t)0x00000004)
#define OPAMP4_CSR_VPSEL0_gp 2
#define OPAMP4_CSR_VPSEL1_gm ((uint32_t)0x00000008)
#define OPAMP4_CSR_VPSEL1_gp 3
#define OPAMP4_CSR_VMSEL_gm ((uint32_t)0x00000060)
#define OPAMP4_CSR_VMSEL_gp 5
#define OPAMP4_CSR_VMSEL0_gm ((uint32_t)0x00000020)
#define OPAMP4_CSR_VMSEL0_gp 5
#define OPAMP4_CSR_VMSEL1_gm ((uint32_t)0x00000040)
#define OPAMP4_CSR_VMSEL1_gp 6
#define OPAMP4_CSR_TCMEN_gm ((uint32_t)0x00000080)
#define OPAMP4_CSR_TCMEN_gp 7
#define OPAMP4_CSR_VMSSEL_gm ((uint32_t)0x00000100)
#define OPAMP4_CSR_VMSSEL_gp 8
#define OPAMP4_CSR_VPSSEL_gm ((uint32_t)0x00000600)
#define OPAMP4_CSR_VPSSEL_gp 9
#define OPAMP4_CSR_VPSSEL0_gm ((uint32_t)0x00000200)
#define OPAMP4_CSR_VPSSEL0_gp 9
#define OPAMP4_CSR_VPSSEL1_gm ((uint32_t)0x00000400)
#define OPAMP4_CSR_VPSSEL1_gp 10
#define OPAMP4_CSR_CALON_gm ((uint32_t)0x00000800)
#define OPAMP4_CSR_CALON_gp 11
#define OPAMP4_CSR_CALSEL_gm ((uint32_t)0x00003000)
#define OPAMP4_CSR_CALSEL_gp 12
#define OPAMP4_CSR_CALSEL0_gm ((uint32_t)0x00001000)
#define OPAMP4_CSR_CALSEL0_gp 12
#define OPAMP4_CSR_CALSEL1_gm ((uint32_t)0x00002000)
#define OPAMP4_CSR_CALSEL1_gp 13
#define OPAMP4_CSR_PGGAIN_gm ((uint32_t)0x0003C000)
#define OPAMP4_CSR_PGGAIN_gp 14
#define OPAMP4_CSR_PGGAIN0_gm ((uint32_t)0x00004000)
#define OPAMP4_CSR_PGGAIN0_gp 14
#define OPAMP4_CSR_PGGAIN1_gm ((uint32_t)0x00008000)
#define OPAMP4_CSR_PGGAIN1_gp 15
#define OPAMP4_CSR_PGGAIN2_gm ((uint32_t)0x00010000)
#define OPAMP4_CSR_PGGAIN2_gp 16
#define OPAMP4_CSR_PGGAIN3_gm ((uint32_t)0x00020000)
#define OPAMP4_CSR_PGGAIN3_gp 17
#define OPAMP4_CSR_USERTRIM_gm ((uint32_t)0x00040000)
#define OPAMP4_CSR_USERTRIM_gp 18
#define OPAMP4_CSR_TRIMOFFSETP_gm ((uint32_t)0x00F80000)
#define OPAMP4_CSR_TRIMOFFSETP_gp 19
#define OPAMP4_CSR_TRIMOFFSETN_gm ((uint32_t)0x1F000000)
#define OPAMP4_CSR_TRIMOFFSETN_gp 24
#define OPAMP4_CSR_TSTREF_gm ((uint32_t)0x20000000)
#define OPAMP4_CSR_TSTREF_gp 29
#define OPAMP4_CSR_OUTCAL_gm ((uint32_t)0x40000000)
#define OPAMP4_CSR_OUTCAL_gp 30
#define OPAMP4_CSR_LOCK_gm ((uint32_t)0x80000000)
#define OPAMP4_CSR_LOCK_gp 31


