a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/********** PERIPHERAL: OPAMP **********/
#define OPAMP_CSR_OPAMPxEN_gm ((uint32_t)0x00000001)
#define OPAMP_CSR_OPAMPxEN_gp 0
#define OPAMP_CSR_FORCEVP_gm ((uint32_t)0x00000002)
#define OPAMP_CSR_FORCEVP_gp 1
#define OPAMP_CSR_VPSEL_gm ((uint32_t)0x0000000C)
#define OPAMP_CSR_VPSEL_gp 2
#define OPAMP_CSR_VPSEL0_gm ((uint32_t)0x00000004)
#define OPAMP_CSR_VPSEL0_gp 2
#define OPAMP_CSR_VPSEL1_gm ((uint32_t)0x00000008)
#define OPAMP_CSR_VPSEL1_gp 3
#define OPAMP_CSR_VMSEL_gm ((uint32_t)0x00000060)
#define OPAMP_CSR_VMSEL_gp 5
#define OPAMP_CSR_VMSEL0_gm ((uint32_t)0x00000020)
#define OPAMP_CSR_VMSEL0_gp 5
#define OPAMP_CSR_VMSEL1_gm ((uint32_t)0x00000040)
#define OPAMP_CSR_VMSEL1_gp 6
#define OPAMP_CSR_TCMEN_gm ((uint32_t)0x00000080)
#define OPAMP_CSR_TCMEN_gp 7
#define OPAMP_CSR_VMSSEL_gm ((uint32_t)0x00000100)
#define OPAMP_CSR_VMSSEL_gp 8
#define OPAMP_CSR_VPSSEL_gm ((uint32_t)0x00000600)
#define OPAMP_CSR_VPSSEL_gp 9
#define OPAMP_CSR_VPSSEL0_gm ((uint32_t)0x00000200)
#define OPAMP_CSR_VPSSEL0_gp 9
#define OPAMP_CSR_VPSSEL1_gm ((uint32_t)0x00000400)
#define OPAMP_CSR_VPSSEL1_gp 10
#define OPAMP_CSR_CALON_gm ((uint32_t)0x00000800)
#define OPAMP_CSR_CALON_gp 11
#define OPAMP_CSR_CALSEL_gm ((uint32_t)0x00003000)
#define OPAMP_CSR_CALSEL_gp 12
#define OPAMP_CSR_CALSEL0_gm ((uint32_t)0x00001000)
#define OPAMP_CSR_CALSEL0_gp 12
#define OPAMP_CSR_CALSEL1_gm ((uint32_t)0x00002000)
#define OPAMP_CSR_CALSEL1_gp 13
#define OPAMP_CSR_PGGAIN_gm ((uint32_t)0x0003C000)
#define OPAMP_CSR_PGGAIN_gp 14
#define OPAMP_CSR_PGGAIN0_gm ((uint32_t)0x00004000)
#define OPAMP_CSR_PGGAIN0_gp 14
#define OPAMP_CSR_PGGAIN1_gm ((uint32_t)0x00008000)
#define OPAMP_CSR_PGGAIN1_gp 15
#define OPAMP_CSR_PGGAIN2_gm ((uint32_t)0x00010000)
#define OPAMP_CSR_PGGAIN2_gp 16
#define OPAMP_CSR_PGGAIN3_gm ((uint32_t)0x00020000)
#define OPAMP_CSR_PGGAIN3_gp 17
#define OPAMP_CSR_USERTRIM_gm ((uint32_t)0x00040000)
#define OPAMP_CSR_USERTRIM_gp 18
#define OPAMP_CSR_TRIMOFFSETP_gm ((uint32_t)0x00F80000)
#define OPAMP_CSR_TRIMOFFSETP_gp 19
#define OPAMP_CSR_TRIMOFFSETN_gm ((uint32_t)0x1F000000)
#define OPAMP_CSR_TRIMOFFSETN_gp 24
#define OPAMP_CSR_TSTREF_gm ((uint32_t)0x20000000)
#define OPAMP_CSR_TSTREF_gp 29
#define OPAMP_CSR_OUTCAL_gm ((uint32_t)0x40000000)
#define OPAMP_CSR_OUTCAL_gp 30
#define OPAMP_CSR_LOCK_gm ((uint32_t)0x80000000)
#define OPAMP_CSR_LOCK_gp 31


/********** PERIPHERAL: CAN **********/

/*** REGISTER: CAN_MCR ***/
#define CAN_MCR_INRQ_gm ((uint16_t)0x0001)
#define CAN_MCR_INRQ_gp 0
#define CAN_MCR_SLEEP_gm ((uint16_t)0x0002)
#define CAN_MCR_SLEEP_gp 1
#define CAN_MCR_TXFP_gm ((uint16_t)0x0004)
#define CAN_MCR_TXFP_gp 2
#define CAN_MCR_RFLM_gm ((uint16_t)0x0008)
#define CAN_MCR_RFLM_gp 3
#define CAN_MCR_NART_gm ((uint16_t)0x0010)
#define CAN_MCR_NART_gp 4
#define CAN_MCR_AWUM_gm ((uint16_t)0x0020)
#define CAN_MCR_AWUM_gp 5
#define CAN_MCR_ABOM_gm ((uint16_t)0x0040)
#define CAN_MCR_ABOM_gp 6
#define CAN_MCR_TTCM_gm ((uint16_t)0x0080)
#define CAN_MCR_TTCM_gp 7
#define CAN_MCR_RESET_gm ((uint16_t)0x8000)
#define CAN_MCR_RESET_gp 15

/*** REGISTER: CAN_MSR ***/
#define CAN_MSR_INAK_gm ((uint16_t)0x0001)
#define CAN_MSR_INAK_gp 0
#define CAN_MSR_SLAK_gm ((uint16_t)0x0002)
#define CAN_MSR_SLAK_gp 1
#define CAN_MSR_ERRI_gm ((uint16_t)0x0004)
#define CAN_MSR_ERRI_gp 2
#define CAN_MSR_WKUI_gm ((uint16_t)0x0008)
#define CAN_MSR_WKUI_gp 3
#define CAN_MSR_SLAKI_gm ((uint16_t)0x0010)
#define CAN_MSR_SLAKI_gp 4
#define CAN_MSR_TXM_gm ((uint16_t)0x0100)
#define CAN_MSR_TXM_gp 8
#define CAN_MSR_RXM_gm ((uint16_t)0x0200)
#define CAN_MSR_RXM_gp 9
#define CAN_MSR_SAMP_gm ((uint16_t)0x0400)
#define CAN_MSR_SAMP_gp 10
#define CAN_MSR_RX_gm ((uint16_t)0x0800)
#define CAN_MSR_RX_gp 11

/*** REGISTER: CAN_TSR ***/
#define CAN_TSR_RQCP0_gm ((uint32_t)0x00000001)
#define CAN_TSR_RQCP0_gp 0
#define CAN_TSR_TXOK0_gm ((uint32_t)0x00000002)
#define CAN_TSR_TXOK0_gp 1
#define CAN_TSR_ALST0_gm ((uint32_t)0x00000004)
#define CAN_TSR_ALST0_gp 2
#define CAN_TSR_TERR0_gm ((uint32_t)0x00000008)
#define CAN_TSR_TERR0_gp 3
#define CAN_TSR_ABRQ0_gm ((uint32_t)0x00000080)
#define CAN_TSR_ABRQ0_gp 7
#define CAN_TSR_RQCP1_gm ((uint32_t)0x00000100)
#define CAN_TSR_RQCP1_gp 8
#define CAN_TSR_TXOK1_gm ((uint32_t)0x00000200)
#define CAN_TSR_TXOK1_gp 9
#define CAN_TSR_ALST1_gm ((uint32_t)0x00000400)
#define CAN_TSR_ALST1_gp 10
#define CAN_TSR_TERR1_gm ((uint32_t)0x00000800)
#define CAN_TSR_TERR1_gp 11
#define CAN_TSR_ABRQ1_gm ((uint32_t)0x00008000)
#define CAN_TSR_ABRQ1_gp 15
#define CAN_TSR_RQCP2_gm ((uint32_t)0x00010000)
#define CAN_TSR_RQCP2_gp 16
#define CAN_TSR_TXOK2_gm ((uint32_t)0x00020000)
#define CAN_TSR_TXOK2_gp 17
#define CAN_TSR_ALST2_gm ((uint32_t)0x00040000)
#define CAN_TSR_ALST2_gp 18
#define CAN_TSR_TERR2_gm ((uint32_t)0x00080000)
#define CAN_TSR_TERR2_gp 19
#define CAN_TSR_ABRQ2_gm ((uint32_t)0x00800000)
#define CAN_TSR_ABRQ2_gp 23
#define CAN_TSR_CODE_gm ((uint32_t)0x03000000)
#define CAN_TSR_CODE_gp 24
#define CAN_TSR_TME_gm ((uint32_t)0x1C000000)
#define CAN_TSR_TME_gp 26
#define CAN_TSR_TME0_gm ((uint32_t)0x04000000)
#define CAN_TSR_TME0_gp 26
#define CAN_TSR_TME1_gm ((uint32_t)0x08000000)
#define CAN_TSR_TME1_gp 27
#define CAN_TSR_TME2_gm ((uint32_t)0x10000000)
#define CAN_TSR_TME2_gp 28
#define CAN_TSR_LOW_gm ((uint32_t)0xE0000000)
#define CAN_TSR_LOW_gp 29
#define CAN_TSR_LOW0_gm ((uint32_t)0x20000000)
#define CAN_TSR_LOW0_gp 29
#define CAN_TSR_LOW1_gm ((uint32_t)0x40000000)
#define CAN_TSR_LOW1_gp 30
#define CAN_TSR_LOW2_gm ((uint32_t)0x80000000)
#define CAN_TSR_LOW2_gp 31

/*** REGISTER: CAN_RF0R ***/
#define CAN_RF0R_FMP0_gm ((uint8_t)0x03)
#define CAN_RF0R_FMP0_gp 0
#define CAN_RF0R_FULL0_gm ((uint8_t)0x08)
#define CAN_RF0R_FULL0_gp 3
#define CAN_RF0R_FOVR0_gm ((uint8_t)0x10)
#define CAN_RF0R_FOVR0_gp 4
#define CAN_RF0R_RFOM0_gm ((uint8_t)0x20)
#define CAN_RF0R_RFOM0_gp 5

/*** REGISTER: CAN_RF1R ***/
#define CAN_RF1R_FMP1_gm ((uint8_t)0x03)
#define CAN_RF1R_FMP1_gp 0
#define CAN_RF1R_FULL1_gm ((uint8_t)0x08)
#define CAN_RF1R_FULL1_gp 3
#define CAN_RF1R_FOVR1_gm ((uint8_t)0x10)
#define CAN_RF1R_FOVR1_gp 4
#define CAN_RF1R_RFOM1_gm ((uint8_t)0x20)
#define CAN_RF1R_RFOM1_gp 5

/*** REGISTER: CAN_IER ***/
#define CAN_IER_TMEIE_gm ((uint32_t)0x00000001)
#define CAN_IER_TMEIE_gp 0
#define CAN_IER_FMPIE0_gm ((uint32_t)0x00000002)
#define CAN_IER_FMPIE0_gp 1
#define CAN_IER_FFIE0_gm ((uint32_t)0x00000004)
#define CAN_IER_FFIE0_gp 2
#define CAN_IER_FOVIE0_gm ((uint32_t)0x00000008)
#define CAN_IER_FOVIE0_gp 3
#define CAN_IER_FMPIE1_gm ((uint32_t)0x00000010)
#define CAN_IER_FMPIE1_gp 4
#define CAN_IER_FFIE1_gm ((uint32_t)0x00000020)
#define CAN_IER_FFIE1_gp 5
#define CAN_IER_FOVIE1_gm ((uint32_t)0x00000040)
#define CAN_IER_FOVIE1_gp 6
#define CAN_IER_EWGIE_gm ((uint32_t)0x00000100)
#define CAN_IER_EWGIE_gp 8
#define CAN_IER_EPVIE_gm ((uint32_t)0x00000200)
#define CAN_IER_EPVIE_gp 9
#define CAN_IER_BOFIE_gm ((uint32_t)0x00000400)
#define CAN_IER_BOFIE_gp 10
#define CAN_IER_LECIE_gm ((uint32_t)0x00000800)
#define CAN_IER_LECIE_gp 11
#define CAN_IER_ERRIE_gm ((uint32_t)0x00008000)
#define CAN_IER_ERRIE_gp 15
#define CAN_IER_WKUIE_gm ((uint32_t)0x00010000)
#define CAN_IER_WKUIE_gp 16
#define CAN_IER_SLKIE_gm ((uint32_t)0x00020000)
#define CAN_IER_SLKIE_gp 17

