a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: CAN_ESR ***/
#define CAN_ESR_EWGF_gm ((uint32_t)0x00000001)
#define CAN_ESR_EWGF_gp 0
#define CAN_ESR_EPVF_gm ((uint32_t)0x00000002)
#define CAN_ESR_EPVF_gp 1
#define CAN_ESR_BOFF_gm ((uint32_t)0x00000004)
#define CAN_ESR_BOFF_gp 2
#define CAN_ESR_LEC_gm ((uint32_t)0x00000070)
#define CAN_ESR_LEC_gp 4
#define CAN_ESR_LEC0_gm ((uint32_t)0x00000010)
#define CAN_ESR_LEC0_gp 4
#define CAN_ESR_LEC1_gm ((uint32_t)0x00000020)
#define CAN_ESR_LEC1_gp 5
#define CAN_ESR_LEC2_gm ((uint32_t)0x00000040)
#define CAN_ESR_LEC2_gp 6
#define CAN_ESR_TEC_gm ((uint32_t)0x00FF0000)
#define CAN_ESR_TEC_gp 16
#define CAN_ESR_REC_gm ((uint32_t)0xFF000000)
#define CAN_ESR_REC_gp 24

/*** REGISTER: CAN_BTR ***/
#define CAN_BTR_BRP_gm ((uint32_t)0x000003FF)
#define CAN_BTR_BRP_gp 0
#define CAN_BTR_TS1_gm ((uint32_t)0x000F0000)
#define CAN_BTR_TS1_gp 16
#define CAN_BTR_TS2_gm ((uint32_t)0x00700000)
#define CAN_BTR_TS2_gp 20
#define CAN_BTR_SJW_gm ((uint32_t)0x03000000)
#define CAN_BTR_SJW_gp 24
#define CAN_BTR_LBKM_gm ((uint32_t)0x40000000)
#define CAN_BTR_LBKM_gp 30
#define CAN_BTR_SILM_gm ((uint32_t)0x80000000)
#define CAN_BTR_SILM_gp 31

/*** REGISTER: CAN_TI0R ***/
#define CAN_TI0R_TXRQ_gm ((uint32_t)0x00000001)
#define CAN_TI0R_TXRQ_gp 0
#define CAN_TI0R_RTR_gm ((uint32_t)0x00000002)
#define CAN_TI0R_RTR_gp 1
#define CAN_TI0R_IDE_gm ((uint32_t)0x00000004)
#define CAN_TI0R_IDE_gp 2
#define CAN_TI0R_EXID_gm ((uint32_t)0x001FFFF8)
#define CAN_TI0R_EXID_gp 3
#define CAN_TI0R_STID_gm ((uint32_t)0xFFE00000)
#define CAN_TI0R_STID_gp 21

/*** REGISTER: CAN_TDT0R ***/
#define CAN_TDT0R_DLC_gm ((uint32_t)0x0000000F)
#define CAN_TDT0R_DLC_gp 0
#define CAN_TDT0R_TGT_gm ((uint32_t)0x00000100)
#define CAN_TDT0R_TGT_gp 8
#define CAN_TDT0R_TIME_gm ((uint32_t)0xFFFF0000)
#define CAN_TDT0R_TIME_gp 16

/*** REGISTER: CAN_TDL0R ***/
#define CAN_TDL0R_DATA0_gm ((uint32_t)0x000000FF)
#define CAN_TDL0R_DATA0_gp 0
#define CAN_TDL0R_DATA1_gm ((uint32_t)0x0000FF00)
#define CAN_TDL0R_DATA1_gp 8
#define CAN_TDL0R_DATA2_gm ((uint32_t)0x00FF0000)
#define CAN_TDL0R_DATA2_gp 16
#define CAN_TDL0R_DATA3_gm ((uint32_t)0xFF000000)
#define CAN_TDL0R_DATA3_gp 24

/*** REGISTER: CAN_TDH0R ***/
#define CAN_TDH0R_DATA4_gm ((uint32_t)0x000000FF)
#define CAN_TDH0R_DATA4_gp 0
#define CAN_TDH0R_DATA5_gm ((uint32_t)0x0000FF00)
#define CAN_TDH0R_DATA5_gp 8
#define CAN_TDH0R_DATA6_gm ((uint32_t)0x00FF0000)
#define CAN_TDH0R_DATA6_gp 16
#define CAN_TDH0R_DATA7_gm ((uint32_t)0xFF000000)
#define CAN_TDH0R_DATA7_gp 24

/*** REGISTER: CAN_TI1R ***/
#define CAN_TI1R_TXRQ_gm ((uint32_t)0x00000001)
#define CAN_TI1R_TXRQ_gp 0
#define CAN_TI1R_RTR_gm ((uint32_t)0x00000002)
#define CAN_TI1R_RTR_gp 1
#define CAN_TI1R_IDE_gm ((uint32_t)0x00000004)
#define CAN_TI1R_IDE_gp 2
#define CAN_TI1R_EXID_gm ((uint32_t)0x001FFFF8)
#define CAN_TI1R_EXID_gp 3
#define CAN_TI1R_STID_gm ((uint32_t)0xFFE00000)
#define CAN_TI1R_STID_gp 21

/*** REGISTER: CAN_TDT1R ***/
#define CAN_TDT1R_DLC_gm ((uint32_t)0x0000000F)
#define CAN_TDT1R_DLC_gp 0
#define CAN_TDT1R_TGT_gm ((uint32_t)0x00000100)
#define CAN_TDT1R_TGT_gp 8
#define CAN_TDT1R_TIME_gm ((uint32_t)0xFFFF0000)
#define CAN_TDT1R_TIME_gp 16

/*** REGISTER: CAN_TDL1R ***/
#define CAN_TDL1R_DATA0_gm ((uint32_t)0x000000FF)
#define CAN_TDL1R_DATA0_gp 0
#define CAN_TDL1R_DATA1_gm ((uint32_t)0x0000FF00)
#define CAN_TDL1R_DATA1_gp 8
#define CAN_TDL1R_DATA2_gm ((uint32_t)0x00FF0000)
#define CAN_TDL1R_DATA2_gp 16
#define CAN_TDL1R_DATA3_gm ((uint32_t)0xFF000000)
#define CAN_TDL1R_DATA3_gp 24

/*** REGISTER: CAN_TDH1R ***/
#define CAN_TDH1R_DATA4_gm ((uint32_t)0x000000FF)
#define CAN_TDH1R_DATA4_gp 0
#define CAN_TDH1R_DATA5_gm ((uint32_t)0x0000FF00)
#define CAN_TDH1R_DATA5_gp 8
#define CAN_TDH1R_DATA6_gm ((uint32_t)0x00FF0000)
#define CAN_TDH1R_DATA6_gp 16
#define CAN_TDH1R_DATA7_gm ((uint32_t)0xFF000000)
#define CAN_TDH1R_DATA7_gp 24

/*** REGISTER: CAN_TI2R ***/
#define CAN_TI2R_TXRQ_gm ((uint32_t)0x00000001)
#define CAN_TI2R_TXRQ_gp 0
#define CAN_TI2R_RTR_gm ((uint32_t)0x00000002)
#define CAN_TI2R_RTR_gp 1
#define CAN_TI2R_IDE_gm ((uint32_t)0x00000004)
#define CAN_TI2R_IDE_gp 2
#define CAN_TI2R_EXID_gm ((uint32_t)0x001FFFF8)
#define CAN_TI2R_EXID_gp 3
#define CAN_TI2R_STID_gm ((uint32_t)0xFFE00000)
#define CAN_TI2R_STID_gp 21

/*** REGISTER: CAN_TDT2R ***/
#define CAN_TDT2R_DLC_gm ((uint32_t)0x0000000F)
#define CAN_TDT2R_DLC_gp 0
#define CAN_TDT2R_TGT_gm ((uint32_t)0x00000100)
#define CAN_TDT2R_TGT_gp 8
#define CAN_TDT2R_TIME_gm ((uint32_t)0xFFFF0000)
#define CAN_TDT2R_TIME_gp 16

/*** REGISTER: CAN_TDL2R ***/
#define CAN_TDL2R_DATA0_gm ((uint32_t)0x000000FF)
#define CAN_TDL2R_DATA0_gp 0
#define CAN_TDL2R_DATA1_gm ((uint32_t)0x0000FF00)
#define CAN_TDL2R_DATA1_gp 8
#define CAN_TDL2R_DATA2_gm ((uint32_t)0x00FF0000)
#define CAN_TDL2R_DATA2_gp 16
#define CAN_TDL2R_DATA3_gm ((uint32_t)0xFF000000)
#define CAN_TDL2R_DATA3_gp 24

/*** REGISTER: CAN_TDH2R ***/
#define CAN_TDH2R_DATA4_gm ((uint32_t)0x000000FF)
#define CAN_TDH2R_DATA4_gp 0
#define CAN_TDH2R_DATA5_gm ((uint32_t)0x0000FF00)
#define CAN_TDH2R_DATA5_gp 8
#define CAN_TDH2R_DATA6_gm ((uint32_t)0x00FF0000)
#define CAN_TDH2R_DATA6_gp 16
#define CAN_TDH2R_DATA7_gm ((uint32_t)0xFF000000)
#define CAN_TDH2R_DATA7_gp 24

/*** REGISTER: CAN_RI0R ***/
#define CAN_RI0R_RTR_gm ((uint32_t)0x00000002)
#define CAN_RI0R_RTR_gp 1
#define CAN_RI0R_IDE_gm ((uint32_t)0x00000004)
#define CAN_RI0R_IDE_gp 2
#define CAN_RI0R_EXID_gm ((uint32_t)0x001FFFF8)
#define CAN_RI0R_EXID_gp 3
#define CAN_RI0R_STID_gm ((uint32_t)0xFFE00000)
#define CAN_RI0R_STID_gp 21

/*** REGISTER: CAN_RDT0R ***/
#define CAN_RDT0R_DLC_gm ((uint32_t)0x0000000F)
#define CAN_RDT0R_DLC_gp 0
#define CAN_RDT0R_FMI_gm ((uint32_t)0x0000FF00)
#define CAN_RDT0R_FMI_gp 8
#define CAN_RDT0R_TIME_gm ((uint32_t)0xFFFF0000)
#define CAN_RDT0R_TIME_gp 16

/*** REGISTER: CAN_RDL0R ***/
#define CAN_RDL0R_DATA0_gm ((uint32_t)0x000000FF)
#define CAN_RDL0R_DATA0_gp 0
#define CAN_RDL0R_DATA1_gm ((uint32_t)0x0000FF00)
#define CAN_RDL0R_DATA1_gp 8
#define CAN_RDL0R_DATA2_gm ((uint32_t)0x00FF0000)
#define CAN_RDL0R_DATA2_gp 16
#define CAN_RDL0R_DATA3_gm ((uint32_t)0xFF000000)
#define CAN_RDL0R_DATA3_gp 24

/*** REGISTER: CAN_RDH0R ***/
#define CAN_RDH0R_DATA4_gm ((uint32_t)0x000000FF)
#define CAN_RDH0R_DATA4_gp 0
#define CAN_RDH0R_DATA5_gm ((uint32_t)0x0000FF00)
#define CAN_RDH0R_DATA5_gp 8
#define CAN_RDH0R_DATA6_gm ((uint32_t)0x00FF0000)
#define CAN_RDH0R_DATA6_gp 16
#define CAN_RDH0R_DATA7_gm ((uint32_t)0xFF000000)
#define CAN_RDH0R_DATA7_gp 24

/*** REGISTER: CAN_RI1R ***/
#define CAN_RI1R_RTR_gm ((uint32_t)0x00000002)
#define CAN_RI1R_RTR_gp 1
#define CAN_RI1R_IDE_gm ((uint32_t)0x00000004)
#define CAN_RI1R_IDE_gp 2
#define CAN_RI1R_EXID_gm ((uint32_t)0x001FFFF8)
#define CAN_RI1R_EXID_gp 3
#define CAN_RI1R_STID_gm ((uint32_t)0xFFE00000)
#define CAN_RI1R_STID_gp 21

/*** REGISTER: CAN_RDT1R ***/
#define CAN_RDT1R_DLC_gm ((uint32_t)0x0000000F)
#define CAN_RDT1R_DLC_gp 0
#define CAN_RDT1R_FMI_gm ((uint32_t)0x0000FF00)
#define CAN_RDT1R_FMI_gp 8
#define CAN_RDT1R_TIME_gm ((uint32_t)0xFFFF0000)
#define CAN_RDT1R_TIME_gp 16

