a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: CAN_RDL1R ***/
#define CAN_RDL1R_DATA0_gm ((uint32_t)0x000000FF)
#define CAN_RDL1R_DATA0_gp 0
#define CAN_RDL1R_DATA1_gm ((uint32_t)0x0000FF00)
#define CAN_RDL1R_DATA1_gp 8
#define CAN_RDL1R_DATA2_gm ((uint32_t)0x00FF0000)
#define CAN_RDL1R_DATA2_gp 16
#define CAN_RDL1R_DATA3_gm ((uint32_t)0xFF000000)
#define CAN_RDL1R_DATA3_gp 24

/*** REGISTER: CAN_RDH1R ***/
#define CAN_RDH1R_DATA4_gm ((uint32_t)0x000000FF)
#define CAN_RDH1R_DATA4_gp 0
#define CAN_RDH1R_DATA5_gm ((uint32_t)0x0000FF00)
#define CAN_RDH1R_DATA5_gp 8
#define CAN_RDH1R_DATA6_gm ((uint32_t)0x00FF0000)
#define CAN_RDH1R_DATA6_gp 16
#define CAN_RDH1R_DATA7_gm ((uint32_t)0xFF000000)
#define CAN_RDH1R_DATA7_gp 24

/*** REGISTER: CAN_FMR ***/
#define CAN_FMR_FINIT_gm ((uint8_t)0x01)
#define CAN_FMR_FINIT_gp 0

/*** REGISTER: CAN_FM1R ***/
#define CAN_FM1R_FBM_gm ((uint16_t)0x3FFF)
#define CAN_FM1R_FBM_gp 0
#define CAN_FM1R_FBM0_gm ((uint16_t)0x0001)
#define CAN_FM1R_FBM0_gp 0
#define CAN_FM1R_FBM1_gm ((uint16_t)0x0002)
#define CAN_FM1R_FBM1_gp 1
#define CAN_FM1R_FBM2_gm ((uint16_t)0x0004)
#define CAN_FM1R_FBM2_gp 2
#define CAN_FM1R_FBM3_gm ((uint16_t)0x0008)
#define CAN_FM1R_FBM3_gp 3
#define CAN_FM1R_FBM4_gm ((uint16_t)0x0010)
#define CAN_FM1R_FBM4_gp 4
#define CAN_FM1R_FBM5_gm ((uint16_t)0x0020)
#define CAN_FM1R_FBM5_gp 5
#define CAN_FM1R_FBM6_gm ((uint16_t)0x0040)
#define CAN_FM1R_FBM6_gp 6
#define CAN_FM1R_FBM7_gm ((uint16_t)0x0080)
#define CAN_FM1R_FBM7_gp 7
#define CAN_FM1R_FBM8_gm ((uint16_t)0x0100)
#define CAN_FM1R_FBM8_gp 8
#define CAN_FM1R_FBM9_gm ((uint16_t)0x0200)
#define CAN_FM1R_FBM9_gp 9
#define CAN_FM1R_FBM10_gm ((uint16_t)0x0400)
#define CAN_FM1R_FBM10_gp 10
#define CAN_FM1R_FBM11_gm ((uint16_t)0x0800)
#define CAN_FM1R_FBM11_gp 11
#define CAN_FM1R_FBM12_gm ((uint16_t)0x1000)
#define CAN_FM1R_FBM12_gp 12
#define CAN_FM1R_FBM13_gm ((uint16_t)0x2000)
#define CAN_FM1R_FBM13_gp 13

/*** REGISTER: CAN_FS1R ***/
#define CAN_FS1R_FSC_gm ((uint16_t)0x3FFF)
#define CAN_FS1R_FSC_gp 0
#define CAN_FS1R_FSC0_gm ((uint16_t)0x0001)
#define CAN_FS1R_FSC0_gp 0
#define CAN_FS1R_FSC1_gm ((uint16_t)0x0002)
#define CAN_FS1R_FSC1_gp 1
#define CAN_FS1R_FSC2_gm ((uint16_t)0x0004)
#define CAN_FS1R_FSC2_gp 2
#define CAN_FS1R_FSC3_gm ((uint16_t)0x0008)
#define CAN_FS1R_FSC3_gp 3
#define CAN_FS1R_FSC4_gm ((uint16_t)0x0010)
#define CAN_FS1R_FSC4_gp 4
#define CAN_FS1R_FSC5_gm ((uint16_t)0x0020)
#define CAN_FS1R_FSC5_gp 5
#define CAN_FS1R_FSC6_gm ((uint16_t)0x0040)
#define CAN_FS1R_FSC6_gp 6
#define CAN_FS1R_FSC7_gm ((uint16_t)0x0080)
#define CAN_FS1R_FSC7_gp 7
#define CAN_FS1R_FSC8_gm ((uint16_t)0x0100)
#define CAN_FS1R_FSC8_gp 8
#define CAN_FS1R_FSC9_gm ((uint16_t)0x0200)
#define CAN_FS1R_FSC9_gp 9
#define CAN_FS1R_FSC10_gm ((uint16_t)0x0400)
#define CAN_FS1R_FSC10_gp 10
#define CAN_FS1R_FSC11_gm ((uint16_t)0x0800)
#define CAN_FS1R_FSC11_gp 11
#define CAN_FS1R_FSC12_gm ((uint16_t)0x1000)
#define CAN_FS1R_FSC12_gp 12
#define CAN_FS1R_FSC13_gm ((uint16_t)0x2000)
#define CAN_FS1R_FSC13_gp 13

/*** REGISTER: CAN_FFA1R ***/
#define CAN_FFA1R_FFA_gm ((uint16_t)0x3FFF)
#define CAN_FFA1R_FFA_gp 0
#define CAN_FFA1R_FFA0_gm ((uint16_t)0x0001)
#define CAN_FFA1R_FFA0_gp 0
#define CAN_FFA1R_FFA1_gm ((uint16_t)0x0002)
#define CAN_FFA1R_FFA1_gp 1
#define CAN_FFA1R_FFA2_gm ((uint16_t)0x0004)
#define CAN_FFA1R_FFA2_gp 2
#define CAN_FFA1R_FFA3_gm ((uint16_t)0x0008)
#define CAN_FFA1R_FFA3_gp 3
#define CAN_FFA1R_FFA4_gm ((uint16_t)0x0010)
#define CAN_FFA1R_FFA4_gp 4
#define CAN_FFA1R_FFA5_gm ((uint16_t)0x0020)
#define CAN_FFA1R_FFA5_gp 5
#define CAN_FFA1R_FFA6_gm ((uint16_t)0x0040)
#define CAN_FFA1R_FFA6_gp 6
#define CAN_FFA1R_FFA7_gm ((uint16_t)0x0080)
#define CAN_FFA1R_FFA7_gp 7
#define CAN_FFA1R_FFA8_gm ((uint16_t)0x0100)
#define CAN_FFA1R_FFA8_gp 8
#define CAN_FFA1R_FFA9_gm ((uint16_t)0x0200)
#define CAN_FFA1R_FFA9_gp 9
#define CAN_FFA1R_FFA10_gm ((uint16_t)0x0400)
#define CAN_FFA1R_FFA10_gp 10
#define CAN_FFA1R_FFA11_gm ((uint16_t)0x0800)
#define CAN_FFA1R_FFA11_gp 11
#define CAN_FFA1R_FFA12_gm ((uint16_t)0x1000)
#define CAN_FFA1R_FFA12_gp 12
#define CAN_FFA1R_FFA13_gm ((uint16_t)0x2000)
#define CAN_FFA1R_FFA13_gp 13

/*** REGISTER: CAN_FA1R ***/
#define CAN_FA1R_FACT_gm ((uint16_t)0x3FFF)
#define CAN_FA1R_FACT_gp 0
#define CAN_FA1R_FACT0_gm ((uint16_t)0x0001)
#define CAN_FA1R_FACT0_gp 0
#define CAN_FA1R_FACT1_gm ((uint16_t)0x0002)
#define CAN_FA1R_FACT1_gp 1
#define CAN_FA1R_FACT2_gm ((uint16_t)0x0004)
#define CAN_FA1R_FACT2_gp 2
#define CAN_FA1R_FACT3_gm ((uint16_t)0x0008)
#define CAN_FA1R_FACT3_gp 3
#define CAN_FA1R_FACT4_gm ((uint16_t)0x0010)
#define CAN_FA1R_FACT4_gp 4
#define CAN_FA1R_FACT5_gm ((uint16_t)0x0020)
#define CAN_FA1R_FACT5_gp 5
#define CAN_FA1R_FACT6_gm ((uint16_t)0x0040)
#define CAN_FA1R_FACT6_gp 6
#define CAN_FA1R_FACT7_gm ((uint16_t)0x0080)
#define CAN_FA1R_FACT7_gp 7
#define CAN_FA1R_FACT8_gm ((uint16_t)0x0100)
#define CAN_FA1R_FACT8_gp 8
#define CAN_FA1R_FACT9_gm ((uint16_t)0x0200)
#define CAN_FA1R_FACT9_gp 9
#define CAN_FA1R_FACT10_gm ((uint16_t)0x0400)
#define CAN_FA1R_FACT10_gp 10
#define CAN_FA1R_FACT11_gm ((uint16_t)0x0800)
#define CAN_FA1R_FACT11_gp 11
#define CAN_FA1R_FACT12_gm ((uint16_t)0x1000)
#define CAN_FA1R_FACT12_gp 12
#define CAN_FA1R_FACT13_gm ((uint16_t)0x2000)
#define CAN_FA1R_FACT13_gp 13

/*** REGISTER: CAN_F0R1 ***/
#define CAN_F0R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F0R1_FB0_gp 0
#define CAN_F0R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F0R1_FB1_gp 1
#define CAN_F0R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F0R1_FB2_gp 2
#define CAN_F0R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F0R1_FB3_gp 3
#define CAN_F0R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F0R1_FB4_gp 4
#define CAN_F0R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F0R1_FB5_gp 5
#define CAN_F0R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F0R1_FB6_gp 6
#define CAN_F0R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F0R1_FB7_gp 7
#define CAN_F0R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F0R1_FB8_gp 8
#define CAN_F0R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F0R1_FB9_gp 9
#define CAN_F0R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F0R1_FB10_gp 10
#define CAN_F0R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F0R1_FB11_gp 11
#define CAN_F0R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F0R1_FB12_gp 12
#define CAN_F0R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F0R1_FB13_gp 13
#define CAN_F0R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F0R1_FB14_gp 14
#define CAN_F0R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F0R1_FB15_gp 15
#define CAN_F0R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F0R1_FB16_gp 16
#define CAN_F0R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F0R1_FB17_gp 17
#define CAN_F0R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F0R1_FB18_gp 18
#define CAN_F0R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F0R1_FB19_gp 19
#define CAN_F0R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F0R1_FB20_gp 20
#define CAN_F0R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F0R1_FB21_gp 21
#define CAN_F0R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F0R1_FB22_gp 22
#define CAN_F0R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F0R1_FB23_gp 23
#define CAN_F0R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F0R1_FB24_gp 24
#define CAN_F0R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F0R1_FB25_gp 25
#define CAN_F0R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F0R1_FB26_gp 26
#define CAN_F0R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F0R1_FB27_gp 27
#define CAN_F0R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F0R1_FB28_gp 28
#define CAN_F0R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F0R1_FB29_gp 29
#define CAN_F0R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F0R1_FB30_gp 30
#define CAN_F0R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F0R1_FB31_gp 31

/*** REGISTER: CAN_F1R1 ***/
#define CAN_F1R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F1R1_FB0_gp 0
#define CAN_F1R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F1R1_FB1_gp 1
#define CAN_F1R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F1R1_FB2_gp 2
#define CAN_F1R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F1R1_FB3_gp 3
#define CAN_F1R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F1R1_FB4_gp 4
#define CAN_F1R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F1R1_FB5_gp 5
#define CAN_F1R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F1R1_FB6_gp 6
#define CAN_F1R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F1R1_FB7_gp 7
#define CAN_F1R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F1R1_FB8_gp 8
#define CAN_F1R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F1R1_FB9_gp 9
#define CAN_F1R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F1R1_FB10_gp 10
#define CAN_F1R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F1R1_FB11_gp 11
#define CAN_F1R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F1R1_FB12_gp 12
#define CAN_F1R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F1R1_FB13_gp 13
#define CAN_F1R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F1R1_FB14_gp 14
#define CAN_F1R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F1R1_FB15_gp 15
#define CAN_F1R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F1R1_FB16_gp 16
#define CAN_F1R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F1R1_FB17_gp 17
#define CAN_F1R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F1R1_FB18_gp 18
#define CAN_F1R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F1R1_FB19_gp 19
#define CAN_F1R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F1R1_FB20_gp 20
#define CAN_F1R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F1R1_FB21_gp 21
#define CAN_F1R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F1R1_FB22_gp 22
#define CAN_F1R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F1R1_FB23_gp 23
#define CAN_F1R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F1R1_FB24_gp 24
#define CAN_F1R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F1R1_FB25_gp 25
#define CAN_F1R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F1R1_FB26_gp 26
#define CAN_F1R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F1R1_FB27_gp 27
#define CAN_F1R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F1R1_FB28_gp 28
#define CAN_F1R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F1R1_FB29_gp 29
#define CAN_F1R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F1R1_FB30_gp 30
#define CAN_F1R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F1R1_FB31_gp 31

/*** REGISTER: CAN_F2R1 ***/
#define CAN_F2R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F2R1_FB0_gp 0
#define CAN_F2R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F2R1_FB1_gp 1
#define CAN_F2R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F2R1_FB2_gp 2
#define CAN_F2R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F2R1_FB3_gp 3
#define CAN_F2R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F2R1_FB4_gp 4
#define CAN_F2R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F2R1_FB5_gp 5
#define CAN_F2R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F2R1_FB6_gp 6
#define CAN_F2R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F2R1_FB7_gp 7
#define CAN_F2R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F2R1_FB8_gp 8
#define CAN_F2R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F2R1_FB9_gp 9
#define CAN_F2R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F2R1_FB10_gp 10
#define CAN_F2R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F2R1_FB11_gp 11
#define CAN_F2R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F2R1_FB12_gp 12
#define CAN_F2R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F2R1_FB13_gp 13
#define CAN_F2R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F2R1_FB14_gp 14
#define CAN_F2R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F2R1_FB15_gp 15
#define CAN_F2R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F2R1_FB16_gp 16
#define CAN_F2R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F2R1_FB17_gp 17
#define CAN_F2R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F2R1_FB18_gp 18
#define CAN_F2R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F2R1_FB19_gp 19
#define CAN_F2R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F2R1_FB20_gp 20
#define CAN_F2R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F2R1_FB21_gp 21
#define CAN_F2R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F2R1_FB22_gp 22
#define CAN_F2R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F2R1_FB23_gp 23
#define CAN_F2R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F2R1_FB24_gp 24
#define CAN_F2R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F2R1_FB25_gp 25
#define CAN_F2R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F2R1_FB26_gp 26
#define CAN_F2R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F2R1_FB27_gp 27
#define CAN_F2R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F2R1_FB28_gp 28
#define CAN_F2R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F2R1_FB29_gp 29
#define CAN_F2R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F2R1_FB30_gp 30
#define CAN_F2R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F2R1_FB31_gp 31

