a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: CAN_F3R1 ***/
#define CAN_F3R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F3R1_FB0_gp 0
#define CAN_F3R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F3R1_FB1_gp 1
#define CAN_F3R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F3R1_FB2_gp 2
#define CAN_F3R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F3R1_FB3_gp 3
#define CAN_F3R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F3R1_FB4_gp 4
#define CAN_F3R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F3R1_FB5_gp 5
#define CAN_F3R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F3R1_FB6_gp 6
#define CAN_F3R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F3R1_FB7_gp 7
#define CAN_F3R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F3R1_FB8_gp 8
#define CAN_F3R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F3R1_FB9_gp 9
#define CAN_F3R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F3R1_FB10_gp 10
#define CAN_F3R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F3R1_FB11_gp 11
#define CAN_F3R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F3R1_FB12_gp 12
#define CAN_F3R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F3R1_FB13_gp 13
#define CAN_F3R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F3R1_FB14_gp 14
#define CAN_F3R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F3R1_FB15_gp 15
#define CAN_F3R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F3R1_FB16_gp 16
#define CAN_F3R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F3R1_FB17_gp 17
#define CAN_F3R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F3R1_FB18_gp 18
#define CAN_F3R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F3R1_FB19_gp 19
#define CAN_F3R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F3R1_FB20_gp 20
#define CAN_F3R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F3R1_FB21_gp 21
#define CAN_F3R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F3R1_FB22_gp 22
#define CAN_F3R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F3R1_FB23_gp 23
#define CAN_F3R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F3R1_FB24_gp 24
#define CAN_F3R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F3R1_FB25_gp 25
#define CAN_F3R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F3R1_FB26_gp 26
#define CAN_F3R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F3R1_FB27_gp 27
#define CAN_F3R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F3R1_FB28_gp 28
#define CAN_F3R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F3R1_FB29_gp 29
#define CAN_F3R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F3R1_FB30_gp 30
#define CAN_F3R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F3R1_FB31_gp 31

/*** REGISTER: CAN_F4R1 ***/
#define CAN_F4R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F4R1_FB0_gp 0
#define CAN_F4R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F4R1_FB1_gp 1
#define CAN_F4R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F4R1_FB2_gp 2
#define CAN_F4R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F4R1_FB3_gp 3
#define CAN_F4R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F4R1_FB4_gp 4
#define CAN_F4R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F4R1_FB5_gp 5
#define CAN_F4R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F4R1_FB6_gp 6
#define CAN_F4R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F4R1_FB7_gp 7
#define CAN_F4R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F4R1_FB8_gp 8
#define CAN_F4R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F4R1_FB9_gp 9
#define CAN_F4R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F4R1_FB10_gp 10
#define CAN_F4R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F4R1_FB11_gp 11
#define CAN_F4R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F4R1_FB12_gp 12
#define CAN_F4R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F4R1_FB13_gp 13
#define CAN_F4R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F4R1_FB14_gp 14
#define CAN_F4R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F4R1_FB15_gp 15
#define CAN_F4R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F4R1_FB16_gp 16
#define CAN_F4R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F4R1_FB17_gp 17
#define CAN_F4R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F4R1_FB18_gp 18
#define CAN_F4R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F4R1_FB19_gp 19
#define CAN_F4R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F4R1_FB20_gp 20
#define CAN_F4R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F4R1_FB21_gp 21
#define CAN_F4R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F4R1_FB22_gp 22
#define CAN_F4R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F4R1_FB23_gp 23
#define CAN_F4R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F4R1_FB24_gp 24
#define CAN_F4R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F4R1_FB25_gp 25
#define CAN_F4R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F4R1_FB26_gp 26
#define CAN_F4R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F4R1_FB27_gp 27
#define CAN_F4R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F4R1_FB28_gp 28
#define CAN_F4R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F4R1_FB29_gp 29
#define CAN_F4R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F4R1_FB30_gp 30
#define CAN_F4R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F4R1_FB31_gp 31

/*** REGISTER: CAN_F5R1 ***/
#define CAN_F5R1_FB0_gm ((uint32_t)0x00000001)
#define CAN_F5R1_FB0_gp 0
#define CAN_F5R1_FB1_gm ((uint32_t)0x00000002)
#define CAN_F5R1_FB1_gp 1
#define CAN_F5R1_FB2_gm ((uint32_t)0x00000004)
#define CAN_F5R1_FB2_gp 2
#define CAN_F5R1_FB3_gm ((uint32_t)0x00000008)
#define CAN_F5R1_FB3_gp 3
#define CAN_F5R1_FB4_gm ((uint32_t)0x00000010)
#define CAN_F5R1_FB4_gp 4
#define CAN_F5R1_FB5_gm ((uint32_t)0x00000020)
#define CAN_F5R1_FB5_gp 5
#define CAN_F5R1_FB6_gm ((uint32_t)0x00000040)
#define CAN_F5R1_FB6_gp 6
#define CAN_F5R1_FB7_gm ((uint32_t)0x00000080)
#define CAN_F5R1_FB7_gp 7
#define CAN_F5R1_FB8_gm ((uint32_t)0x00000100)
#define CAN_F5R1_FB8_gp 8
#define CAN_F5R1_FB9_gm ((uint32_t)0x00000200)
#define CAN_F5R1_FB9_gp 9
#define CAN_F5R1_FB10_gm ((uint32_t)0x00000400)
#define CAN_F5R1_FB10_gp 10
#define CAN_F5R1_FB11_gm ((uint32_t)0x00000800)
#define CAN_F5R1_FB11_gp 11
#define CAN_F5R1_FB12_gm ((uint32_t)0x00001000)
#define CAN_F5R1_FB12_gp 12
#define CAN_F5R1_FB13_gm ((uint32_t)0x00002000)
#define CAN_F5R1_FB13_gp 13
#define CAN_F5R1_FB14_gm ((uint32_t)0x00004000)
#define CAN_F5R1_FB14_gp 14
#define CAN_F5R1_FB15_gm ((uint32_t)0x00008000)
#define CAN_F5R1_FB15_gp 15
#define CAN_F5R1_FB16_gm ((uint32_t)0x00010000)
#define CAN_F5R1_FB16_gp 16
#define CAN_F5R1_FB17_gm ((uint32_t)0x00020000)
#define CAN_F5R1_FB17_gp 17
#define CAN_F5R1_FB18_gm ((uint32_t)0x00040000)
#define CAN_F5R1_FB18_gp 18
#define CAN_F5R1_FB19_gm ((uint32_t)0x00080000)
#define CAN_F5R1_FB19_gp 19
#define CAN_F5R1_FB20_gm ((uint32_t)0x00100000)
#define CAN_F5R1_FB20_gp 20
#define CAN_F5R1_FB21_gm ((uint32_t)0x00200000)
#define CAN_F5R1_FB21_gp 21
#define CAN_F5R1_FB22_gm ((uint32_t)0x00400000)
#define CAN_F5R1_FB22_gp 22
#define CAN_F5R1_FB23_gm ((uint32_t)0x00800000)
#define CAN_F5R1_FB23_gp 23
#define CAN_F5R1_FB24_gm ((uint32_t)0x01000000)
#define CAN_F5R1_FB24_gp 24
#define CAN_F5R1_FB25_gm ((uint32_t)0x02000000)
#define CAN_F5R1_FB25_gp 25
#define CAN_F5R1_FB26_gm ((uint32_t)0x04000000)
#define CAN_F5R1_FB26_gp 26
#define CAN_F5R1_FB27_gm ((uint32_t)0x08000000)
#define CAN_F5R1_FB27_gp 27
#define CAN_F5R1_FB28_gm ((uint32_t)0x10000000)
#define CAN_F5R1_FB28_gp 28
#define CAN_F5R1_FB29_gm ((uint32_t)0x20000000)
#define CAN_F5R1_FB29_gp 29
#define CAN_F5R1_FB30_gm ((uint32_t)0x40000000)
#define CAN_F5R1_FB30_gp 30
#define CAN_F5R1_FB31_gm ((uint32_t)0x80000000)
#define CAN_F5R1_FB31_gp 31

