a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: CAN_F12R2 ***/
#define CAN_F12R2_FB0_gm ((uint32_t)0x00000001)
#define CAN_F12R2_FB0_gp 0
#define CAN_F12R2_FB1_gm ((uint32_t)0x00000002)
#define CAN_F12R2_FB1_gp 1
#define CAN_F12R2_FB2_gm ((uint32_t)0x00000004)
#define CAN_F12R2_FB2_gp 2
#define CAN_F12R2_FB3_gm ((uint32_t)0x00000008)
#define CAN_F12R2_FB3_gp 3
#define CAN_F12R2_FB4_gm ((uint32_t)0x00000010)
#define CAN_F12R2_FB4_gp 4
#define CAN_F12R2_FB5_gm ((uint32_t)0x00000020)
#define CAN_F12R2_FB5_gp 5
#define CAN_F12R2_FB6_gm ((uint32_t)0x00000040)
#define CAN_F12R2_FB6_gp 6
#define CAN_F12R2_FB7_gm ((uint32_t)0x00000080)
#define CAN_F12R2_FB7_gp 7
#define CAN_F12R2_FB8_gm ((uint32_t)0x00000100)
#define CAN_F12R2_FB8_gp 8
#define CAN_F12R2_FB9_gm ((uint32_t)0x00000200)
#define CAN_F12R2_FB9_gp 9
#define CAN_F12R2_FB10_gm ((uint32_t)0x00000400)
#define CAN_F12R2_FB10_gp 10
#define CAN_F12R2_FB11_gm ((uint32_t)0x00000800)
#define CAN_F12R2_FB11_gp 11
#define CAN_F12R2_FB12_gm ((uint32_t)0x00001000)
#define CAN_F12R2_FB12_gp 12
#define CAN_F12R2_FB13_gm ((uint32_t)0x00002000)
#define CAN_F12R2_FB13_gp 13
#define CAN_F12R2_FB14_gm ((uint32_t)0x00004000)
#define CAN_F12R2_FB14_gp 14
#define CAN_F12R2_FB15_gm ((uint32_t)0x00008000)
#define CAN_F12R2_FB15_gp 15
#define CAN_F12R2_FB16_gm ((uint32_t)0x00010000)
#define CAN_F12R2_FB16_gp 16
#define CAN_F12R2_FB17_gm ((uint32_t)0x00020000)
#define CAN_F12R2_FB17_gp 17
#define CAN_F12R2_FB18_gm ((uint32_t)0x00040000)
#define CAN_F12R2_FB18_gp 18
#define CAN_F12R2_FB19_gm ((uint32_t)0x00080000)
#define CAN_F12R2_FB19_gp 19
#define CAN_F12R2_FB20_gm ((uint32_t)0x00100000)
#define CAN_F12R2_FB20_gp 20
#define CAN_F12R2_FB21_gm ((uint32_t)0x00200000)
#define CAN_F12R2_FB21_gp 21
#define CAN_F12R2_FB22_gm ((uint32_t)0x00400000)
#define CAN_F12R2_FB22_gp 22
#define CAN_F12R2_FB23_gm ((uint32_t)0x00800000)
#define CAN_F12R2_FB23_gp 23
#define CAN_F12R2_FB24_gm ((uint32_t)0x01000000)
#define CAN_F12R2_FB24_gp 24
#define CAN_F12R2_FB25_gm ((uint32_t)0x02000000)
#define CAN_F12R2_FB25_gp 25
#define CAN_F12R2_FB26_gm ((uint32_t)0x04000000)
#define CAN_F12R2_FB26_gp 26
#define CAN_F12R2_FB27_gm ((uint32_t)0x08000000)
#define CAN_F12R2_FB27_gp 27
#define CAN_F12R2_FB28_gm ((uint32_t)0x10000000)
#define CAN_F12R2_FB28_gp 28
#define CAN_F12R2_FB29_gm ((uint32_t)0x20000000)
#define CAN_F12R2_FB29_gp 29
#define CAN_F12R2_FB30_gm ((uint32_t)0x40000000)
#define CAN_F12R2_FB30_gp 30
#define CAN_F12R2_FB31_gm ((uint32_t)0x80000000)
#define CAN_F12R2_FB31_gp 31

/*** REGISTER: CAN_F13R2 ***/
#define CAN_F13R2_FB0_gm ((uint32_t)0x00000001)
#define CAN_F13R2_FB0_gp 0
#define CAN_F13R2_FB1_gm ((uint32_t)0x00000002)
#define CAN_F13R2_FB1_gp 1
#define CAN_F13R2_FB2_gm ((uint32_t)0x00000004)
#define CAN_F13R2_FB2_gp 2
#define CAN_F13R2_FB3_gm ((uint32_t)0x00000008)
#define CAN_F13R2_FB3_gp 3
#define CAN_F13R2_FB4_gm ((uint32_t)0x00000010)
#define CAN_F13R2_FB4_gp 4
#define CAN_F13R2_FB5_gm ((uint32_t)0x00000020)
#define CAN_F13R2_FB5_gp 5
#define CAN_F13R2_FB6_gm ((uint32_t)0x00000040)
#define CAN_F13R2_FB6_gp 6
#define CAN_F13R2_FB7_gm ((uint32_t)0x00000080)
#define CAN_F13R2_FB7_gp 7
#define CAN_F13R2_FB8_gm ((uint32_t)0x00000100)
#define CAN_F13R2_FB8_gp 8
#define CAN_F13R2_FB9_gm ((uint32_t)0x00000200)
#define CAN_F13R2_FB9_gp 9
#define CAN_F13R2_FB10_gm ((uint32_t)0x00000400)
#define CAN_F13R2_FB10_gp 10
#define CAN_F13R2_FB11_gm ((uint32_t)0x00000800)
#define CAN_F13R2_FB11_gp 11
#define CAN_F13R2_FB12_gm ((uint32_t)0x00001000)
#define CAN_F13R2_FB12_gp 12
#define CAN_F13R2_FB13_gm ((uint32_t)0x00002000)
#define CAN_F13R2_FB13_gp 13
#define CAN_F13R2_FB14_gm ((uint32_t)0x00004000)
#define CAN_F13R2_FB14_gp 14
#define CAN_F13R2_FB15_gm ((uint32_t)0x00008000)
#define CAN_F13R2_FB15_gp 15
#define CAN_F13R2_FB16_gm ((uint32_t)0x00010000)
#define CAN_F13R2_FB16_gp 16
#define CAN_F13R2_FB17_gm ((uint32_t)0x00020000)
#define CAN_F13R2_FB17_gp 17
#define CAN_F13R2_FB18_gm ((uint32_t)0x00040000)
#define CAN_F13R2_FB18_gp 18
#define CAN_F13R2_FB19_gm ((uint32_t)0x00080000)
#define CAN_F13R2_FB19_gp 19
#define CAN_F13R2_FB20_gm ((uint32_t)0x00100000)
#define CAN_F13R2_FB20_gp 20
#define CAN_F13R2_FB21_gm ((uint32_t)0x00200000)
#define CAN_F13R2_FB21_gp 21
#define CAN_F13R2_FB22_gm ((uint32_t)0x00400000)
#define CAN_F13R2_FB22_gp 22
#define CAN_F13R2_FB23_gm ((uint32_t)0x00800000)
#define CAN_F13R2_FB23_gp 23
#define CAN_F13R2_FB24_gm ((uint32_t)0x01000000)
#define CAN_F13R2_FB24_gp 24
#define CAN_F13R2_FB25_gm ((uint32_t)0x02000000)
#define CAN_F13R2_FB25_gp 25
#define CAN_F13R2_FB26_gm ((uint32_t)0x04000000)
#define CAN_F13R2_FB26_gp 26
#define CAN_F13R2_FB27_gm ((uint32_t)0x08000000)
#define CAN_F13R2_FB27_gp 27
#define CAN_F13R2_FB28_gm ((uint32_t)0x10000000)
#define CAN_F13R2_FB28_gp 28
#define CAN_F13R2_FB29_gm ((uint32_t)0x20000000)
#define CAN_F13R2_FB29_gp 29
#define CAN_F13R2_FB30_gm ((uint32_t)0x40000000)
#define CAN_F13R2_FB30_gp 30
#define CAN_F13R2_FB31_gm ((uint32_t)0x80000000)
#define CAN_F13R2_FB31_gp 31


/********** PERIPHERAL: CRC **********/

/*** REGISTER: CRC_DR ***/
#define CRC_DR_DR_gm ((uint32_t)0xFFFFFFFF)
#define CRC_DR_DR_gp 0

/*** REGISTER: CRC_IDR ***/
#define CRC_IDR_IDR_gm ((uint8_t)0xFF)
#define CRC_IDR_IDR_gp 0

/*** REGISTER: CRC_CR ***/
#define CRC_CR_RESET_gm ((uint32_t)0x00000001)
#define CRC_CR_RESET_gp 0
#define CRC_CR_POLSIZE_gm ((uint32_t)0x00000018)
#define CRC_CR_POLSIZE_gp 3
#define CRC_CR_POLSIZE0_gm ((uint32_t)0x00000008)
#define CRC_CR_POLSIZE0_gp 3
#define CRC_CR_POLSIZE1_gm ((uint32_t)0x00000010)
#define CRC_CR_POLSIZE1_gp 4
#define CRC_CR_REV_IN_gm ((uint32_t)0x00000060)
#define CRC_CR_REV_IN_gp 5
#define CRC_CR_REV_IN_0_gm ((uint32_t)0x00000020)
#define CRC_CR_REV_IN_0_gp 5
#define CRC_CR_REV_IN_1_gm ((uint32_t)0x00000040)
#define CRC_CR_REV_IN_1_gp 6
#define CRC_CR_REV_OUT_gm ((uint32_t)0x00000080)
#define CRC_CR_REV_OUT_gp 7

/*** REGISTER: CRC_INIT ***/
#define CRC_INIT_INIT_gm ((uint32_t)0xFFFFFFFF)
#define CRC_INIT_INIT_gp 0

/*** REGISTER: CRC_POL ***/
#define CRC_POL_POL_gm ((uint32_t)0xFFFFFFFF)
#define CRC_POL_POL_gp 0


/********** PERIPHERAL: DAC **********/

