a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: DAC_CR ***/
#define DAC_CR_EN1_gm ((uint32_t)0x00000001)
#define DAC_CR_EN1_gp 0
#define DAC_CR_BOFF1_gm ((uint32_t)0x00000002)
#define DAC_CR_BOFF1_gp 1
#define DAC_CR_TEN1_gm ((uint32_t)0x00000004)
#define DAC_CR_TEN1_gp 2
#define DAC_CR_TSEL1_gm ((uint32_t)0x00000038)
#define DAC_CR_TSEL1_gp 3
#define DAC_CR_WAVE1_gm ((uint32_t)0x000000C0)
#define DAC_CR_WAVE1_gp 6
#define DAC_CR_MAMP1_gm ((uint32_t)0x00000F00)
#define DAC_CR_MAMP1_gp 8
#define DAC_CR_DMAEN1_gm ((uint32_t)0x00001000)
#define DAC_CR_DMAEN1_gp 12
#define DAC_CR_EN2_gm ((uint32_t)0x00010000)
#define DAC_CR_EN2_gp 16
#define DAC_CR_BOFF2_gm ((uint32_t)0x00020000)
#define DAC_CR_BOFF2_gp 17
#define DAC_CR_TEN2_gm ((uint32_t)0x00040000)
#define DAC_CR_TEN2_gp 18
#define DAC_CR_TSEL2_gm ((uint32_t)0x00380000)
#define DAC_CR_TSEL2_gp 19
#define DAC_CR_WAVE2_gm ((uint32_t)0x00C00000)
#define DAC_CR_WAVE2_gp 22
#define DAC_CR_MAMP2_gm ((uint32_t)0x0F000000)
#define DAC_CR_MAMP2_gp 24
#define DAC_CR_DMAEN2_gm ((uint32_t)0x10000000)
#define DAC_CR_DMAEN2_gp 28

/*** REGISTER: DAC_SWTRIGR ***/
#define DAC_SWTRIGR_SWTRIG1_gm ((uint8_t)0x01)
#define DAC_SWTRIGR_SWTRIG1_gp 0
#define DAC_SWTRIGR_SWTRIG2_gm ((uint8_t)0x02)
#define DAC_SWTRIGR_SWTRIG2_gp 1

/*** REGISTER: DAC_DHR12R1 ***/
#define DAC_DHR12R1_DACC1DHR_gm ((uint16_t)0x0FFF)
#define DAC_DHR12R1_DACC1DHR_gp 0

/*** REGISTER: DAC_DHR12L1 ***/
#define DAC_DHR12L1_DACC1DHR_gm ((uint16_t)0xFFF0)
#define DAC_DHR12L1_DACC1DHR_gp 4

/*** REGISTER: DAC_DHR8R1 ***/
#define DAC_DHR8R1_DACC1DHR_gm ((uint8_t)0xFF)
#define DAC_DHR8R1_DACC1DHR_gp 0

/*** REGISTER: DAC_DHR12R2 ***/
#define DAC_DHR12R2_DACC2DHR_gm ((uint16_t)0x0FFF)
#define DAC_DHR12R2_DACC2DHR_gp 0

/*** REGISTER: DAC_DHR12L2 ***/
#define DAC_DHR12L2_DACC2DHR_gm ((uint16_t)0xFFF0)
#define DAC_DHR12L2_DACC2DHR_gp 4

/*** REGISTER: DAC_DHR8R2 ***/
#define DAC_DHR8R2_DACC2DHR_gm ((uint8_t)0xFF)
#define DAC_DHR8R2_DACC2DHR_gp 0

/*** REGISTER: DAC_DHR12RD ***/
#define DAC_DHR12RD_DACC1DHR_gm ((uint32_t)0x00000FFF)
#define DAC_DHR12RD_DACC1DHR_gp 0
#define DAC_DHR12RD_DACC2DHR_gm ((uint32_t)0x0FFF0000)
#define DAC_DHR12RD_DACC2DHR_gp 16

/*** REGISTER: DAC_DHR12LD ***/
#define DAC_DHR12LD_DACC1DHR_gm ((uint32_t)0x0000FFF0)
#define DAC_DHR12LD_DACC1DHR_gp 4
#define DAC_DHR12LD_DACC2DHR_gm ((uint32_t)0xFFF00000)
#define DAC_DHR12LD_DACC2DHR_gp 20

/*** REGISTER: DAC_DHR8RD ***/
#define DAC_DHR8RD_DACC1DHR_gm ((uint16_t)0x00FF)
#define DAC_DHR8RD_DACC1DHR_gp 0
#define DAC_DHR8RD_DACC2DHR_gm ((uint16_t)0xFF00)
#define DAC_DHR8RD_DACC2DHR_gp 8

/*** REGISTER: DAC_DOR1 ***/
#define DAC_DOR1_DACC1DOR_gm ((uint16_t)0x0FFF)
#define DAC_DOR1_DACC1DOR_gp 0

/*** REGISTER: DAC_DOR2 ***/
#define DAC_DOR2_DACC2DOR_gm ((uint16_t)0x0FFF)
#define DAC_DOR2_DACC2DOR_gp 0

/*** REGISTER: DAC_SR ***/
#define DAC_SR_DMAUDR1_gm ((uint32_t)0x00002000)
#define DAC_SR_DMAUDR1_gp 13
#define DAC_SR_DMAUDR2_gm ((uint32_t)0x20000000)
#define DAC_SR_DMAUDR2_gp 29


/********** PERIPHERAL: DBGMCU **********/

/*** REGISTER: DBGMCU_IDCODE ***/
#define DBGMCU_IDCODE_DEV_ID_gm ((uint32_t)0x00000FFF)
#define DBGMCU_IDCODE_DEV_ID_gp 0
#define DBGMCU_IDCODE_REV_ID_gm ((uint32_t)0xFFFF0000)
#define DBGMCU_IDCODE_REV_ID_gp 16

/*** REGISTER: DBGMCU_CR ***/
#define DBGMCU_CR_DBG_SLEEP_gm ((uint32_t)0x00000001)
#define DBGMCU_CR_DBG_SLEEP_gp 0
#define DBGMCU_CR_DBG_STOP_gm ((uint32_t)0x00000002)
#define DBGMCU_CR_DBG_STOP_gp 1
#define DBGMCU_CR_DBG_STANDBY_gm ((uint32_t)0x00000004)
#define DBGMCU_CR_DBG_STANDBY_gp 2
#define DBGMCU_CR_TRACE_IOEN_gm ((uint32_t)0x00000020)
#define DBGMCU_CR_TRACE_IOEN_gp 5
#define DBGMCU_CR_TRACE_MODE_gm ((uint32_t)0x000000C0)
#define DBGMCU_CR_TRACE_MODE_gp 6
#define DBGMCU_CR_TRACE_MODE_0_gm ((uint32_t)0x00000040)
#define DBGMCU_CR_TRACE_MODE_0_gp 6
#define DBGMCU_CR_TRACE_MODE_1_gm ((uint32_t)0x00000080)
#define DBGMCU_CR_TRACE_MODE_1_gp 7

/*** REGISTER: DBGMCU_APB1 ***/
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP_gm ((uint32_t)0x00000001)
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP_gp 0
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP_gm ((uint32_t)0x00000002)
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP_gp 1
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP_gm ((uint32_t)0x00000004)
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP_gp 2
#define DBGMCU_APB1_FZ_DBG_TIM6_STOP_gm ((uint32_t)0x00000010)
#define DBGMCU_APB1_FZ_DBG_TIM6_STOP_gp 4
#define DBGMCU_APB1_FZ_DBG_TIM7_STOP_gm ((uint32_t)0x00000020)
#define DBGMCU_APB1_FZ_DBG_TIM7_STOP_gp 5
#define DBGMCU_APB1_FZ_DBG_RTC_STOP_gm ((uint32_t)0x00000400)
#define DBGMCU_APB1_FZ_DBG_RTC_STOP_gp 10
#define DBGMCU_APB1_FZ_DBG_WWDG_STOP_gm ((uint32_t)0x00000800)
#define DBGMCU_APB1_FZ_DBG_WWDG_STOP_gp 11
#define DBGMCU_APB1_FZ_DBG_IWDG_STOP_gm ((uint32_t)0x00001000)
#define DBGMCU_APB1_FZ_DBG_IWDG_STOP_gp 12
#define DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_gm ((uint32_t)0x00200000)
#define DBGMCU_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_gp 21
#define DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_gm ((uint32_t)0x00400000)
#define DBGMCU_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_gp 22
#define DBGMCU_APB1_FZ_DBG_CAN1_STOP_gm ((uint32_t)0x02000000)
#define DBGMCU_APB1_FZ_DBG_CAN1_STOP_gp 25

/*** REGISTER: DBGMCU_APB2 ***/
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP_gm ((uint32_t)0x00000001)
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP_gp 0
#define DBGMCU_APB2_FZ_DBG_TIM8_STOP_gm ((uint32_t)0x00000002)
#define DBGMCU_APB2_FZ_DBG_TIM8_STOP_gp 1
#define DBGMCU_APB2_FZ_DBG_TIM15_STOP_gm ((uint32_t)0x00000004)
#define DBGMCU_APB2_FZ_DBG_TIM15_STOP_gp 2
#define DBGMCU_APB2_FZ_DBG_TIM16_STOP_gm ((uint32_t)0x00000008)
#define DBGMCU_APB2_FZ_DBG_TIM16_STOP_gp 3
#define DBGMCU_APB2_FZ_DBG_TIM17_STOP_gm ((uint32_t)0x00000010)
#define DBGMCU_APB2_FZ_DBG_TIM17_STOP_gp 4


/********** PERIPHERAL: DMA **********/

/*** REGISTER: DMA_ISR ***/
#define DMA_ISR_GIF1_gm ((uint32_t)0x00000001)
#define DMA_ISR_GIF1_gp 0
#define DMA_ISR_TCIF1_gm ((uint32_t)0x00000002)
#define DMA_ISR_TCIF1_gp 1
#define DMA_ISR_HTIF1_gm ((uint32_t)0x00000004)
#define DMA_ISR_HTIF1_gp 2
#define DMA_ISR_TEIF1_gm ((uint32_t)0x00000008)
#define DMA_ISR_TEIF1_gp 3
#define DMA_ISR_GIF2_gm ((uint32_t)0x00000010)
#define DMA_ISR_GIF2_gp 4
#define DMA_ISR_TCIF2_gm ((uint32_t)0x00000020)
#define DMA_ISR_TCIF2_gp 5
#define DMA_ISR_HTIF2_gm ((uint32_t)0x00000040)
#define DMA_ISR_HTIF2_gp 6
#define DMA_ISR_TEIF2_gm ((uint32_t)0x00000080)
#define DMA_ISR_TEIF2_gp 7
#define DMA_ISR_GIF3_gm ((uint32_t)0x00000100)
#define DMA_ISR_GIF3_gp 8
#define DMA_ISR_TCIF3_gm ((uint32_t)0x00000200)
#define DMA_ISR_TCIF3_gp 9
#define DMA_ISR_HTIF3_gm ((uint32_t)0x00000400)
#define DMA_ISR_HTIF3_gp 10
#define DMA_ISR_TEIF3_gm ((uint32_t)0x00000800)
#define DMA_ISR_TEIF3_gp 11
#define DMA_ISR_GIF4_gm ((uint32_t)0x00001000)
#define DMA_ISR_GIF4_gp 12
#define DMA_ISR_TCIF4_gm ((uint32_t)0x00002000)
#define DMA_ISR_TCIF4_gp 13
#define DMA_ISR_HTIF4_gm ((uint32_t)0x00004000)
#define DMA_ISR_HTIF4_gp 14
#define DMA_ISR_TEIF4_gm ((uint32_t)0x00008000)
#define DMA_ISR_TEIF4_gp 15
#define DMA_ISR_GIF5_gm ((uint32_t)0x00010000)
#define DMA_ISR_GIF5_gp 16
#define DMA_ISR_TCIF5_gm ((uint32_t)0x00020000)
#define DMA_ISR_TCIF5_gp 17
#define DMA_ISR_HTIF5_gm ((uint32_t)0x00040000)
#define DMA_ISR_HTIF5_gp 18
#define DMA_ISR_TEIF5_gm ((uint32_t)0x00080000)
#define DMA_ISR_TEIF5_gp 19
#define DMA_ISR_GIF6_gm ((uint32_t)0x00100000)
#define DMA_ISR_GIF6_gp 20
#define DMA_ISR_TCIF6_gm ((uint32_t)0x00200000)
#define DMA_ISR_TCIF6_gp 21
#define DMA_ISR_HTIF6_gm ((uint32_t)0x00400000)
#define DMA_ISR_HTIF6_gp 22
#define DMA_ISR_TEIF6_gm ((uint32_t)0x00800000)
#define DMA_ISR_TEIF6_gp 23
#define DMA_ISR_GIF7_gm ((uint32_t)0x01000000)
#define DMA_ISR_GIF7_gp 24
#define DMA_ISR_TCIF7_gm ((uint32_t)0x02000000)
#define DMA_ISR_TCIF7_gp 25
#define DMA_ISR_HTIF7_gm ((uint32_t)0x04000000)
#define DMA_ISR_HTIF7_gp 26
#define DMA_ISR_TEIF7_gm ((uint32_t)0x08000000)
#define DMA_ISR_TEIF7_gp 27

