a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: DMA_IFCR ***/
#define DMA_IFCR_CGIF1_gm ((uint32_t)0x00000001)
#define DMA_IFCR_CGIF1_gp 0
#define DMA_IFCR_CTCIF1_gm ((uint32_t)0x00000002)
#define DMA_IFCR_CTCIF1_gp 1
#define DMA_IFCR_CHTIF1_gm ((uint32_t)0x00000004)
#define DMA_IFCR_CHTIF1_gp 2
#define DMA_IFCR_CTEIF1_gm ((uint32_t)0x00000008)
#define DMA_IFCR_CTEIF1_gp 3
#define DMA_IFCR_CGIF2_gm ((uint32_t)0x00000010)
#define DMA_IFCR_CGIF2_gp 4
#define DMA_IFCR_CTCIF2_gm ((uint32_t)0x00000020)
#define DMA_IFCR_CTCIF2_gp 5
#define DMA_IFCR_CHTIF2_gm ((uint32_t)0x00000040)
#define DMA_IFCR_CHTIF2_gp 6
#define DMA_IFCR_CTEIF2_gm ((uint32_t)0x00000080)
#define DMA_IFCR_CTEIF2_gp 7
#define DMA_IFCR_CGIF3_gm ((uint32_t)0x00000100)
#define DMA_IFCR_CGIF3_gp 8
#define DMA_IFCR_CTCIF3_gm ((uint32_t)0x00000200)
#define DMA_IFCR_CTCIF3_gp 9
#define DMA_IFCR_CHTIF3_gm ((uint32_t)0x00000400)
#define DMA_IFCR_CHTIF3_gp 10
#define DMA_IFCR_CTEIF3_gm ((uint32_t)0x00000800)
#define DMA_IFCR_CTEIF3_gp 11
#define DMA_IFCR_CGIF4_gm ((uint32_t)0x00001000)
#define DMA_IFCR_CGIF4_gp 12
#define DMA_IFCR_CTCIF4_gm ((uint32_t)0x00002000)
#define DMA_IFCR_CTCIF4_gp 13
#define DMA_IFCR_CHTIF4_gm ((uint32_t)0x00004000)
#define DMA_IFCR_CHTIF4_gp 14
#define DMA_IFCR_CTEIF4_gm ((uint32_t)0x00008000)
#define DMA_IFCR_CTEIF4_gp 15
#define DMA_IFCR_CGIF5_gm ((uint32_t)0x00010000)
#define DMA_IFCR_CGIF5_gp 16
#define DMA_IFCR_CTCIF5_gm ((uint32_t)0x00020000)
#define DMA_IFCR_CTCIF5_gp 17
#define DMA_IFCR_CHTIF5_gm ((uint32_t)0x00040000)
#define DMA_IFCR_CHTIF5_gp 18
#define DMA_IFCR_CTEIF5_gm ((uint32_t)0x00080000)
#define DMA_IFCR_CTEIF5_gp 19
#define DMA_IFCR_CGIF6_gm ((uint32_t)0x00100000)
#define DMA_IFCR_CGIF6_gp 20
#define DMA_IFCR_CTCIF6_gm ((uint32_t)0x00200000)
#define DMA_IFCR_CTCIF6_gp 21
#define DMA_IFCR_CHTIF6_gm ((uint32_t)0x00400000)
#define DMA_IFCR_CHTIF6_gp 22
#define DMA_IFCR_CTEIF6_gm ((uint32_t)0x00800000)
#define DMA_IFCR_CTEIF6_gp 23
#define DMA_IFCR_CGIF7_gm ((uint32_t)0x01000000)
#define DMA_IFCR_CGIF7_gp 24
#define DMA_IFCR_CTCIF7_gm ((uint32_t)0x02000000)
#define DMA_IFCR_CTCIF7_gp 25
#define DMA_IFCR_CHTIF7_gm ((uint32_t)0x04000000)
#define DMA_IFCR_CHTIF7_gp 26
#define DMA_IFCR_CTEIF7_gm ((uint32_t)0x08000000)
#define DMA_IFCR_CTEIF7_gp 27

/*** REGISTER: DMA_CCR ***/
#define DMA_CCR_EN_gm ((uint32_t)0x00000001)
#define DMA_CCR_EN_gp 0
#define DMA_CCR_TCIE_gm ((uint32_t)0x00000002)
#define DMA_CCR_TCIE_gp 1
#define DMA_CCR_HTIE_gm ((uint32_t)0x00000004)
#define DMA_CCR_HTIE_gp 2
#define DMA_CCR_TEIE_gm ((uint32_t)0x00000008)
#define DMA_CCR_TEIE_gp 3
#define DMA_CCR_DIR_gm ((uint32_t)0x00000010)
#define DMA_CCR_DIR_gp 4
#define DMA_CCR_CIRC_gm ((uint32_t)0x00000020)
#define DMA_CCR_CIRC_gp 5
#define DMA_CCR_PINC_gm ((uint32_t)0x00000040)
#define DMA_CCR_PINC_gp 6
#define DMA_CCR_MINC_gm ((uint32_t)0x00000080)
#define DMA_CCR_MINC_gp 7
#define DMA_CCR_PSIZE_gm ((uint32_t)0x00000300)
#define DMA_CCR_PSIZE_gp 8
#define DMA_CCR_PSIZE0_gm ((uint32_t)0x00000100)
#define DMA_CCR_PSIZE0_gp 8
#define DMA_CCR_PSIZE1_gm ((uint32_t)0x00000200)
#define DMA_CCR_PSIZE1_gp 9
#define DMA_CCR_MSIZE_gm ((uint32_t)0x00000C00)
#define DMA_CCR_MSIZE_gp 10
#define DMA_CCR_MSIZE0_gm ((uint32_t)0x00000400)
#define DMA_CCR_MSIZE0_gp 10
#define DMA_CCR_MSIZE1_gm ((uint32_t)0x00000800)
#define DMA_CCR_MSIZE1_gp 11
#define DMA_CCR_PL_gm ((uint32_t)0x00003000)
#define DMA_CCR_PL_gp 12
#define DMA_CCR_PL0_gm ((uint32_t)0x00001000)
#define DMA_CCR_PL0_gp 12
#define DMA_CCR_PL1_gm ((uint32_t)0x00002000)
#define DMA_CCR_PL1_gp 13
#define DMA_CCR_MEM2MEM_gm ((uint32_t)0x00004000)
#define DMA_CCR_MEM2MEM_gp 14

/*** REGISTER: DMA_CNDTR ***/
#define DMA_CNDTR_NDT_gm ((uint32_t)0x0000FFFF)
#define DMA_CNDTR_NDT_gp 0

/*** REGISTER: DMA_CPAR ***/
#define DMA_CPAR_PA_gm ((uint32_t)0xFFFFFFFF)
#define DMA_CPAR_PA_gp 0

/*** REGISTER: DMA_CMAR ***/
#define DMA_CMAR_MA_gm ((uint32_t)0xFFFFFFFF)
#define DMA_CMAR_MA_gp 0


/********** PERIPHERAL: EXTI **********/

/*** REGISTER: EXTI_IMR ***/
#define EXTI_IMR_MR0_gm ((uint32_t)0x00000001)
#define EXTI_IMR_MR0_gp 0
#define EXTI_IMR_MR1_gm ((uint32_t)0x00000002)
#define EXTI_IMR_MR1_gp 1
#define EXTI_IMR_MR2_gm ((uint32_t)0x00000004)
#define EXTI_IMR_MR2_gp 2
#define EXTI_IMR_MR3_gm ((uint32_t)0x00000008)
#define EXTI_IMR_MR3_gp 3
#define EXTI_IMR_MR4_gm ((uint32_t)0x00000010)
#define EXTI_IMR_MR4_gp 4
#define EXTI_IMR_MR5_gm ((uint32_t)0x00000020)
#define EXTI_IMR_MR5_gp 5
#define EXTI_IMR_MR6_gm ((uint32_t)0x00000040)
#define EXTI_IMR_MR6_gp 6
#define EXTI_IMR_MR7_gm ((uint32_t)0x00000080)
#define EXTI_IMR_MR7_gp 7
#define EXTI_IMR_MR8_gm ((uint32_t)0x00000100)
#define EXTI_IMR_MR8_gp 8
#define EXTI_IMR_MR9_gm ((uint32_t)0x00000200)
#define EXTI_IMR_MR9_gp 9
#define EXTI_IMR_MR10_gm ((uint32_t)0x00000400)
#define EXTI_IMR_MR10_gp 10
#define EXTI_IMR_MR11_gm ((uint32_t)0x00000800)
#define EXTI_IMR_MR11_gp 11
#define EXTI_IMR_MR12_gm ((uint32_t)0x00001000)
#define EXTI_IMR_MR12_gp 12
#define EXTI_IMR_MR13_gm ((uint32_t)0x00002000)
#define EXTI_IMR_MR13_gp 13
#define EXTI_IMR_MR14_gm ((uint32_t)0x00004000)
#define EXTI_IMR_MR14_gp 14
#define EXTI_IMR_MR15_gm ((uint32_t)0x00008000)
#define EXTI_IMR_MR15_gp 15
#define EXTI_IMR_MR16_gm ((uint32_t)0x00010000)
#define EXTI_IMR_MR16_gp 16
#define EXTI_IMR_MR17_gm ((uint32_t)0x00020000)
#define EXTI_IMR_MR17_gp 17
#define EXTI_IMR_MR18_gm ((uint32_t)0x00040000)
#define EXTI_IMR_MR18_gp 18
#define EXTI_IMR_MR19_gm ((uint32_t)0x00080000)
#define EXTI_IMR_MR19_gp 19
#define EXTI_IMR_MR20_gm ((uint32_t)0x00100000)
#define EXTI_IMR_MR20_gp 20
#define EXTI_IMR_MR21_gm ((uint32_t)0x00200000)
#define EXTI_IMR_MR21_gp 21
#define EXTI_IMR_MR22_gm ((uint32_t)0x00400000)
#define EXTI_IMR_MR22_gp 22
#define EXTI_IMR_MR23_gm ((uint32_t)0x00800000)
#define EXTI_IMR_MR23_gp 23
#define EXTI_IMR_MR24_gm ((uint32_t)0x01000000)
#define EXTI_IMR_MR24_gp 24
#define EXTI_IMR_MR25_gm ((uint32_t)0x02000000)
#define EXTI_IMR_MR25_gp 25
#define EXTI_IMR_MR26_gm ((uint32_t)0x04000000)
#define EXTI_IMR_MR26_gp 26
#define EXTI_IMR_MR27_gm ((uint32_t)0x08000000)
#define EXTI_IMR_MR27_gp 27
#define EXTI_IMR_MR28_gm ((uint32_t)0x10000000)
#define EXTI_IMR_MR28_gp 28

/*** REGISTER: EXTI_EMR ***/
#define EXTI_EMR_MR0_gm ((uint32_t)0x00000001)
#define EXTI_EMR_MR0_gp 0
#define EXTI_EMR_MR1_gm ((uint32_t)0x00000002)
#define EXTI_EMR_MR1_gp 1
#define EXTI_EMR_MR2_gm ((uint32_t)0x00000004)
#define EXTI_EMR_MR2_gp 2
#define EXTI_EMR_MR3_gm ((uint32_t)0x00000008)
#define EXTI_EMR_MR3_gp 3
#define EXTI_EMR_MR4_gm ((uint32_t)0x00000010)
#define EXTI_EMR_MR4_gp 4
#define EXTI_EMR_MR5_gm ((uint32_t)0x00000020)
#define EXTI_EMR_MR5_gp 5
#define EXTI_EMR_MR6_gm ((uint32_t)0x00000040)
#define EXTI_EMR_MR6_gp 6
#define EXTI_EMR_MR7_gm ((uint32_t)0x00000080)
#define EXTI_EMR_MR7_gp 7
#define EXTI_EMR_MR8_gm ((uint32_t)0x00000100)
#define EXTI_EMR_MR8_gp 8
#define EXTI_EMR_MR9_gm ((uint32_t)0x00000200)
#define EXTI_EMR_MR9_gp 9
#define EXTI_EMR_MR10_gm ((uint32_t)0x00000400)
#define EXTI_EMR_MR10_gp 10
#define EXTI_EMR_MR11_gm ((uint32_t)0x00000800)
#define EXTI_EMR_MR11_gp 11
#define EXTI_EMR_MR12_gm ((uint32_t)0x00001000)
#define EXTI_EMR_MR12_gp 12
#define EXTI_EMR_MR13_gm ((uint32_t)0x00002000)
#define EXTI_EMR_MR13_gp 13
#define EXTI_EMR_MR14_gm ((uint32_t)0x00004000)
#define EXTI_EMR_MR14_gp 14
#define EXTI_EMR_MR15_gm ((uint32_t)0x00008000)
#define EXTI_EMR_MR15_gp 15
#define EXTI_EMR_MR16_gm ((uint32_t)0x00010000)
#define EXTI_EMR_MR16_gp 16
#define EXTI_EMR_MR17_gm ((uint32_t)0x00020000)
#define EXTI_EMR_MR17_gp 17
#define EXTI_EMR_MR18_gm ((uint32_t)0x00040000)
#define EXTI_EMR_MR18_gp 18
#define EXTI_EMR_MR19_gm ((uint32_t)0x00080000)
#define EXTI_EMR_MR19_gp 19
#define EXTI_EMR_MR20_gm ((uint32_t)0x00100000)
#define EXTI_EMR_MR20_gp 20
#define EXTI_EMR_MR21_gm ((uint32_t)0x00200000)
#define EXTI_EMR_MR21_gp 21
#define EXTI_EMR_MR22_gm ((uint32_t)0x00400000)
#define EXTI_EMR_MR22_gp 22
#define EXTI_EMR_MR23_gm ((uint32_t)0x00800000)
#define EXTI_EMR_MR23_gp 23
#define EXTI_EMR_MR24_gm ((uint32_t)0x01000000)
#define EXTI_EMR_MR24_gp 24
#define EXTI_EMR_MR25_gm ((uint32_t)0x02000000)
#define EXTI_EMR_MR25_gp 25
#define EXTI_EMR_MR26_gm ((uint32_t)0x04000000)
#define EXTI_EMR_MR26_gp 26
#define EXTI_EMR_MR27_gm ((uint32_t)0x08000000)
#define EXTI_EMR_MR27_gp 27
#define EXTI_EMR_MR28_gm ((uint32_t)0x10000000)
#define EXTI_EMR_MR28_gp 28

