a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: EXTI_RTSR ***/
#define EXTI_RTSR_TR0_gm ((uint32_t)0x00000001)
#define EXTI_RTSR_TR0_gp 0
#define EXTI_RTSR_TR1_gm ((uint32_t)0x00000002)
#define EXTI_RTSR_TR1_gp 1
#define EXTI_RTSR_TR2_gm ((uint32_t)0x00000004)
#define EXTI_RTSR_TR2_gp 2
#define EXTI_RTSR_TR3_gm ((uint32_t)0x00000008)
#define EXTI_RTSR_TR3_gp 3
#define EXTI_RTSR_TR4_gm ((uint32_t)0x00000010)
#define EXTI_RTSR_TR4_gp 4
#define EXTI_RTSR_TR5_gm ((uint32_t)0x00000020)
#define EXTI_RTSR_TR5_gp 5
#define EXTI_RTSR_TR6_gm ((uint32_t)0x00000040)
#define EXTI_RTSR_TR6_gp 6
#define EXTI_RTSR_TR7_gm ((uint32_t)0x00000080)
#define EXTI_RTSR_TR7_gp 7
#define EXTI_RTSR_TR8_gm ((uint32_t)0x00000100)
#define EXTI_RTSR_TR8_gp 8
#define EXTI_RTSR_TR9_gm ((uint32_t)0x00000200)
#define EXTI_RTSR_TR9_gp 9
#define EXTI_RTSR_TR10_gm ((uint32_t)0x00000400)
#define EXTI_RTSR_TR10_gp 10
#define EXTI_RTSR_TR11_gm ((uint32_t)0x00000800)
#define EXTI_RTSR_TR11_gp 11
#define EXTI_RTSR_TR12_gm ((uint32_t)0x00001000)
#define EXTI_RTSR_TR12_gp 12
#define EXTI_RTSR_TR13_gm ((uint32_t)0x00002000)
#define EXTI_RTSR_TR13_gp 13
#define EXTI_RTSR_TR14_gm ((uint32_t)0x00004000)
#define EXTI_RTSR_TR14_gp 14
#define EXTI_RTSR_TR15_gm ((uint32_t)0x00008000)
#define EXTI_RTSR_TR15_gp 15
#define EXTI_RTSR_TR16_gm ((uint32_t)0x00010000)
#define EXTI_RTSR_TR16_gp 16
#define EXTI_RTSR_TR17_gm ((uint32_t)0x00020000)
#define EXTI_RTSR_TR17_gp 17
#define EXTI_RTSR_TR18_gm ((uint32_t)0x00040000)
#define EXTI_RTSR_TR18_gp 18
#define EXTI_RTSR_TR19_gm ((uint32_t)0x00080000)
#define EXTI_RTSR_TR19_gp 19
#define EXTI_RTSR_TR20_gm ((uint32_t)0x00100000)
#define EXTI_RTSR_TR20_gp 20
#define EXTI_RTSR_TR21_gm ((uint32_t)0x00200000)
#define EXTI_RTSR_TR21_gp 21
#define EXTI_RTSR_TR22_gm ((uint32_t)0x00400000)
#define EXTI_RTSR_TR22_gp 22
#define EXTI_RTSR_TR23_gm ((uint32_t)0x00800000)
#define EXTI_RTSR_TR23_gp 23
#define EXTI_RTSR_TR24_gm ((uint32_t)0x01000000)
#define EXTI_RTSR_TR24_gp 24
#define EXTI_RTSR_TR25_gm ((uint32_t)0x02000000)
#define EXTI_RTSR_TR25_gp 25
#define EXTI_RTSR_TR26_gm ((uint32_t)0x04000000)
#define EXTI_RTSR_TR26_gp 26
#define EXTI_RTSR_TR27_gm ((uint32_t)0x08000000)
#define EXTI_RTSR_TR27_gp 27
#define EXTI_RTSR_TR28_gm ((uint32_t)0x10000000)
#define EXTI_RTSR_TR28_gp 28

/*** REGISTER: EXTI_FTSR ***/
#define EXTI_FTSR_TR0_gm ((uint32_t)0x00000001)
#define EXTI_FTSR_TR0_gp 0
#define EXTI_FTSR_TR1_gm ((uint32_t)0x00000002)
#define EXTI_FTSR_TR1_gp 1
#define EXTI_FTSR_TR2_gm ((uint32_t)0x00000004)
#define EXTI_FTSR_TR2_gp 2
#define EXTI_FTSR_TR3_gm ((uint32_t)0x00000008)
#define EXTI_FTSR_TR3_gp 3
#define EXTI_FTSR_TR4_gm ((uint32_t)0x00000010)
#define EXTI_FTSR_TR4_gp 4
#define EXTI_FTSR_TR5_gm ((uint32_t)0x00000020)
#define EXTI_FTSR_TR5_gp 5
#define EXTI_FTSR_TR6_gm ((uint32_t)0x00000040)
#define EXTI_FTSR_TR6_gp 6
#define EXTI_FTSR_TR7_gm ((uint32_t)0x00000080)
#define EXTI_FTSR_TR7_gp 7
#define EXTI_FTSR_TR8_gm ((uint32_t)0x00000100)
#define EXTI_FTSR_TR8_gp 8
#define EXTI_FTSR_TR9_gm ((uint32_t)0x00000200)
#define EXTI_FTSR_TR9_gp 9
#define EXTI_FTSR_TR10_gm ((uint32_t)0x00000400)
#define EXTI_FTSR_TR10_gp 10
#define EXTI_FTSR_TR11_gm ((uint32_t)0x00000800)
#define EXTI_FTSR_TR11_gp 11
#define EXTI_FTSR_TR12_gm ((uint32_t)0x00001000)
#define EXTI_FTSR_TR12_gp 12
#define EXTI_FTSR_TR13_gm ((uint32_t)0x00002000)
#define EXTI_FTSR_TR13_gp 13
#define EXTI_FTSR_TR14_gm ((uint32_t)0x00004000)
#define EXTI_FTSR_TR14_gp 14
#define EXTI_FTSR_TR15_gm ((uint32_t)0x00008000)
#define EXTI_FTSR_TR15_gp 15
#define EXTI_FTSR_TR16_gm ((uint32_t)0x00010000)
#define EXTI_FTSR_TR16_gp 16
#define EXTI_FTSR_TR17_gm ((uint32_t)0x00020000)
#define EXTI_FTSR_TR17_gp 17
#define EXTI_FTSR_TR18_gm ((uint32_t)0x00040000)
#define EXTI_FTSR_TR18_gp 18
#define EXTI_FTSR_TR19_gm ((uint32_t)0x00080000)
#define EXTI_FTSR_TR19_gp 19
#define EXTI_FTSR_TR20_gm ((uint32_t)0x00100000)
#define EXTI_FTSR_TR20_gp 20
#define EXTI_FTSR_TR21_gm ((uint32_t)0x00200000)
#define EXTI_FTSR_TR21_gp 21
#define EXTI_FTSR_TR22_gm ((uint32_t)0x00400000)
#define EXTI_FTSR_TR22_gp 22
#define EXTI_FTSR_TR23_gm ((uint32_t)0x00800000)
#define EXTI_FTSR_TR23_gp 23
#define EXTI_FTSR_TR24_gm ((uint32_t)0x01000000)
#define EXTI_FTSR_TR24_gp 24
#define EXTI_FTSR_TR25_gm ((uint32_t)0x02000000)
#define EXTI_FTSR_TR25_gp 25
#define EXTI_FTSR_TR26_gm ((uint32_t)0x04000000)
#define EXTI_FTSR_TR26_gp 26
#define EXTI_FTSR_TR27_gm ((uint32_t)0x08000000)
#define EXTI_FTSR_TR27_gp 27
#define EXTI_FTSR_TR28_gm ((uint32_t)0x10000000)
#define EXTI_FTSR_TR28_gp 28

/*** REGISTER: EXTI_SWIER ***/
#define EXTI_SWIER_SWIER0_gm ((uint32_t)0x00000001)
#define EXTI_SWIER_SWIER0_gp 0
#define EXTI_SWIER_SWIER1_gm ((uint32_t)0x00000002)
#define EXTI_SWIER_SWIER1_gp 1
#define EXTI_SWIER_SWIER2_gm ((uint32_t)0x00000004)
#define EXTI_SWIER_SWIER2_gp 2
#define EXTI_SWIER_SWIER3_gm ((uint32_t)0x00000008)
#define EXTI_SWIER_SWIER3_gp 3
#define EXTI_SWIER_SWIER4_gm ((uint32_t)0x00000010)
#define EXTI_SWIER_SWIER4_gp 4
#define EXTI_SWIER_SWIER5_gm ((uint32_t)0x00000020)
#define EXTI_SWIER_SWIER5_gp 5
#define EXTI_SWIER_SWIER6_gm ((uint32_t)0x00000040)
#define EXTI_SWIER_SWIER6_gp 6
#define EXTI_SWIER_SWIER7_gm ((uint32_t)0x00000080)
#define EXTI_SWIER_SWIER7_gp 7
#define EXTI_SWIER_SWIER8_gm ((uint32_t)0x00000100)
#define EXTI_SWIER_SWIER8_gp 8
#define EXTI_SWIER_SWIER9_gm ((uint32_t)0x00000200)
#define EXTI_SWIER_SWIER9_gp 9
#define EXTI_SWIER_SWIER10_gm ((uint32_t)0x00000400)
#define EXTI_SWIER_SWIER10_gp 10
#define EXTI_SWIER_SWIER11_gm ((uint32_t)0x00000800)
#define EXTI_SWIER_SWIER11_gp 11
#define EXTI_SWIER_SWIER12_gm ((uint32_t)0x00001000)
#define EXTI_SWIER_SWIER12_gp 12
#define EXTI_SWIER_SWIER13_gm ((uint32_t)0x00002000)
#define EXTI_SWIER_SWIER13_gp 13
#define EXTI_SWIER_SWIER14_gm ((uint32_t)0x00004000)
#define EXTI_SWIER_SWIER14_gp 14
#define EXTI_SWIER_SWIER15_gm ((uint32_t)0x00008000)
#define EXTI_SWIER_SWIER15_gp 15
#define EXTI_SWIER_SWIER16_gm ((uint32_t)0x00010000)
#define EXTI_SWIER_SWIER16_gp 16
#define EXTI_SWIER_SWIER17_gm ((uint32_t)0x00020000)
#define EXTI_SWIER_SWIER17_gp 17
#define EXTI_SWIER_SWIER18_gm ((uint32_t)0x00040000)
#define EXTI_SWIER_SWIER18_gp 18
#define EXTI_SWIER_SWIER19_gm ((uint32_t)0x00080000)
#define EXTI_SWIER_SWIER19_gp 19
#define EXTI_SWIER_SWIER20_gm ((uint32_t)0x00100000)
#define EXTI_SWIER_SWIER20_gp 20
#define EXTI_SWIER_SWIER21_gm ((uint32_t)0x00200000)
#define EXTI_SWIER_SWIER21_gp 21
#define EXTI_SWIER_SWIER22_gm ((uint32_t)0x00400000)
#define EXTI_SWIER_SWIER22_gp 22
#define EXTI_SWIER_SWIER23_gm ((uint32_t)0x00800000)
#define EXTI_SWIER_SWIER23_gp 23
#define EXTI_SWIER_SWIER24_gm ((uint32_t)0x01000000)
#define EXTI_SWIER_SWIER24_gp 24
#define EXTI_SWIER_SWIER25_gm ((uint32_t)0x02000000)
#define EXTI_SWIER_SWIER25_gp 25
#define EXTI_SWIER_SWIER26_gm ((uint32_t)0x04000000)
#define EXTI_SWIER_SWIER26_gp 26
#define EXTI_SWIER_SWIER27_gm ((uint32_t)0x08000000)
#define EXTI_SWIER_SWIER27_gp 27
#define EXTI_SWIER_SWIER28_gm ((uint32_t)0x10000000)
#define EXTI_SWIER_SWIER28_gp 28

/*** REGISTER: EXTI_PR ***/
#define EXTI_PR_PR0_gm ((uint32_t)0x00000001)
#define EXTI_PR_PR0_gp 0
#define EXTI_PR_PR1_gm ((uint32_t)0x00000002)
#define EXTI_PR_PR1_gp 1
#define EXTI_PR_PR2_gm ((uint32_t)0x00000004)
#define EXTI_PR_PR2_gp 2
#define EXTI_PR_PR3_gm ((uint32_t)0x00000008)
#define EXTI_PR_PR3_gp 3
#define EXTI_PR_PR4_gm ((uint32_t)0x00000010)
#define EXTI_PR_PR4_gp 4
#define EXTI_PR_PR5_gm ((uint32_t)0x00000020)
#define EXTI_PR_PR5_gp 5
#define EXTI_PR_PR6_gm ((uint32_t)0x00000040)
#define EXTI_PR_PR6_gp 6
#define EXTI_PR_PR7_gm ((uint32_t)0x00000080)
#define EXTI_PR_PR7_gp 7
#define EXTI_PR_PR8_gm ((uint32_t)0x00000100)
#define EXTI_PR_PR8_gp 8
#define EXTI_PR_PR9_gm ((uint32_t)0x00000200)
#define EXTI_PR_PR9_gp 9
#define EXTI_PR_PR10_gm ((uint32_t)0x00000400)
#define EXTI_PR_PR10_gp 10
#define EXTI_PR_PR11_gm ((uint32_t)0x00000800)
#define EXTI_PR_PR11_gp 11
#define EXTI_PR_PR12_gm ((uint32_t)0x00001000)
#define EXTI_PR_PR12_gp 12
#define EXTI_PR_PR13_gm ((uint32_t)0x00002000)
#define EXTI_PR_PR13_gp 13
#define EXTI_PR_PR14_gm ((uint32_t)0x00004000)
#define EXTI_PR_PR14_gp 14
#define EXTI_PR_PR15_gm ((uint32_t)0x00008000)
#define EXTI_PR_PR15_gp 15
#define EXTI_PR_PR16_gm ((uint32_t)0x00010000)
#define EXTI_PR_PR16_gp 16
#define EXTI_PR_PR17_gm ((uint32_t)0x00020000)
#define EXTI_PR_PR17_gp 17
#define EXTI_PR_PR18_gm ((uint32_t)0x00040000)
#define EXTI_PR_PR18_gp 18
#define EXTI_PR_PR19_gm ((uint32_t)0x00080000)
#define EXTI_PR_PR19_gp 19
#define EXTI_PR_PR20_gm ((uint32_t)0x00100000)
#define EXTI_PR_PR20_gp 20
#define EXTI_PR_PR21_gm ((uint32_t)0x00200000)
#define EXTI_PR_PR21_gp 21
#define EXTI_PR_PR22_gm ((uint32_t)0x00400000)
#define EXTI_PR_PR22_gp 22
#define EXTI_PR_PR23_gm ((uint32_t)0x00800000)
#define EXTI_PR_PR23_gp 23
#define EXTI_PR_PR24_gm ((uint32_t)0x01000000)
#define EXTI_PR_PR24_gp 24
#define EXTI_PR_PR25_gm ((uint32_t)0x02000000)
#define EXTI_PR_PR25_gp 25
#define EXTI_PR_PR26_gm ((uint32_t)0x04000000)
#define EXTI_PR_PR26_gp 26
#define EXTI_PR_PR27_gm ((uint32_t)0x08000000)
#define EXTI_PR_PR27_gp 27
#define EXTI_PR_PR28_gm ((uint32_t)0x10000000)
#define EXTI_PR_PR28_gp 28


/********** PERIPHERAL: FLASH **********/

/*** REGISTER: FLASH_ACR ***/
#define FLASH_ACR_LATENCY_gm ((uint8_t)0x03)
#define FLASH_ACR_LATENCY_gp 0
#define FLASH_ACR_LATENCY0_gm ((uint8_t)0x01)
#define FLASH_ACR_LATENCY0_gp 0
#define FLASH_ACR_LATENCY1_gm ((uint8_t)0x02)
#define FLASH_ACR_LATENCY1_gp 1
#define FLASH_ACR_HLFCYA_gm ((uint8_t)0x08)
#define FLASH_ACR_HLFCYA_gp 3
#define FLASH_ACR_PRFTBE_gm ((uint8_t)0x10)
#define FLASH_ACR_PRFTBE_gp 4
#define FLASH_ACR_PRFTBS_gm ((uint8_t)0x20)
#define FLASH_ACR_PRFTBS_gp 5

