a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: FLASH_KEYR ***/
#define FLASH_KEYR_FKEYR_gm ((uint32_t)0xFFFFFFFF)
#define FLASH_KEYR_FKEYR_gp 0

/*** REGISTER: FLASH_OPTKEYR ***/
#define FLASH_OPTKEYR_OPTKEYR_gm ((uint32_t)0xFFFFFFFF)
#define FLASH_OPTKEYR_OPTKEYR_gp 0

/*** REGISTER: FLASH_SR ***/
#define FLASH_SR_BSY_gm ((uint32_t)0x00000001)
#define FLASH_SR_BSY_gp 0
#define FLASH_SR_PGERR_gm ((uint32_t)0x00000004)
#define FLASH_SR_PGERR_gp 2
#define FLASH_SR_WRPERR_gm ((uint32_t)0x00000010)
#define FLASH_SR_WRPERR_gp 4
#define FLASH_SR_EOP_gm ((uint32_t)0x00000020)
#define FLASH_SR_EOP_gp 5

/*** REGISTER: FLASH_CR ***/
#define FLASH_CR_PG_gm ((uint32_t)0x00000001)
#define FLASH_CR_PG_gp 0
#define FLASH_CR_PER_gm ((uint32_t)0x00000002)
#define FLASH_CR_PER_gp 1
#define FLASH_CR_MER_gm ((uint32_t)0x00000004)
#define FLASH_CR_MER_gp 2
#define FLASH_CR_OPTPG_gm ((uint32_t)0x00000010)
#define FLASH_CR_OPTPG_gp 4
#define FLASH_CR_OPTER_gm ((uint32_t)0x00000020)
#define FLASH_CR_OPTER_gp 5
#define FLASH_CR_STRT_gm ((uint32_t)0x00000040)
#define FLASH_CR_STRT_gp 6
#define FLASH_CR_LOCK_gm ((uint32_t)0x00000080)
#define FLASH_CR_LOCK_gp 7
#define FLASH_CR_OPTWRE_gm ((uint32_t)0x00000200)
#define FLASH_CR_OPTWRE_gp 9
#define FLASH_CR_ERRIE_gm ((uint32_t)0x00000400)
#define FLASH_CR_ERRIE_gp 10
#define FLASH_CR_EOPIE_gm ((uint32_t)0x00001000)
#define FLASH_CR_EOPIE_gp 12
#define FLASH_CR_OBL_LAUNCH_gm ((uint32_t)0x00002000)
#define FLASH_CR_OBL_LAUNCH_gp 13

/*** REGISTER: FLASH_AR ***/
#define FLASH_AR_FAR_gm ((uint32_t)0xFFFFFFFF)
#define FLASH_AR_FAR_gp 0

/*** REGISTER: FLASH_OBR ***/
#define FLASH_OBR_OPTERR_gm ((uint32_t)0x00000001)
#define FLASH_OBR_OPTERR_gp 0
#define FLASH_OBR_RDPRT1_gm ((uint32_t)0x00000002)
#define FLASH_OBR_RDPRT1_gp 1
#define FLASH_OBR_RDPRT2_gm ((uint32_t)0x00000004)
#define FLASH_OBR_RDPRT2_gp 2
#define FLASH_OBR_USER_gm ((uint32_t)0x00003700)
#define FLASH_OBR_USER_gp 8
#define FLASH_OBR_IWDG_SW_gm ((uint32_t)0x00000100)
#define FLASH_OBR_IWDG_SW_gp 8

/*** REGISTER: FLASH_WRPR ***/
#define FLASH_WRPR_WRP_gm ((uint32_t)0xFFFFFFFF)
#define FLASH_WRPR_WRP_gp 0


/********** PERIPHERAL: OB **********/

/*** REGISTER: OB_RDP ***/
#define OB_RDP_RDP_gm ((uint32_t)0x000000FF)
#define OB_RDP_RDP_gp 0

/*** REGISTER: OB_USER ***/
#define OB_USER_USER_gm ((uint32_t)0x00FF0000)
#define OB_USER_USER_gp 16

/*** REGISTER: OB_WRP0 ***/
#define OB_WRP0_WRP0_gm ((uint32_t)0x000000FF)
#define OB_WRP0_WRP0_gp 0

/*** REGISTER: OB_WRP1 ***/
#define OB_WRP1_WRP1_gm ((uint32_t)0x00FF0000)
#define OB_WRP1_WRP1_gp 16

/*** REGISTER: OB_WRP2 ***/
#define OB_WRP2_WRP2_gm ((uint32_t)0x000000FF)
#define OB_WRP2_WRP2_gp 0

/*** REGISTER: OB_WRP3 ***/
#define OB_WRP3_WRP3_gm ((uint32_t)0x00FF0000)
#define OB_WRP3_WRP3_gp 16


/********** PERIPHERAL: GPIO **********/

/*** REGISTER: GPIO_MODER ***/
#define GPIO_MODER_MODER0_gm ((uint32_t)0x00000003)
#define GPIO_MODER_MODER0_gp 0
#define GPIO_MODER_MODER1_gm ((uint32_t)0x0000000C)
#define GPIO_MODER_MODER1_gp 2
#define GPIO_MODER_MODER2_gm ((uint32_t)0x00000030)
#define GPIO_MODER_MODER2_gp 4
#define GPIO_MODER_MODER3_gm ((uint32_t)0x000000C0)
#define GPIO_MODER_MODER3_gp 6
#define GPIO_MODER_MODER4_gm ((uint32_t)0x00000300)
#define GPIO_MODER_MODER4_gp 8
#define GPIO_MODER_MODER5_gm ((uint32_t)0x00000C00)
#define GPIO_MODER_MODER5_gp 10
#define GPIO_MODER_MODER6_gm ((uint32_t)0x00003000)
#define GPIO_MODER_MODER6_gp 12
#define GPIO_MODER_MODER7_gm ((uint32_t)0x0000C000)
#define GPIO_MODER_MODER7_gp 14
#define GPIO_MODER_MODER8_gm ((uint32_t)0x00030000)
#define GPIO_MODER_MODER8_gp 16
#define GPIO_MODER_MODER9_gm ((uint32_t)0x000C0000)
#define GPIO_MODER_MODER9_gp 18
#define GPIO_MODER_MODER10_gm ((uint32_t)0x00300000)
#define GPIO_MODER_MODER10_gp 20
#define GPIO_MODER_MODER11_gm ((uint32_t)0x00C00000)
#define GPIO_MODER_MODER11_gp 22
#define GPIO_MODER_MODER12_gm ((uint32_t)0x03000000)
#define GPIO_MODER_MODER12_gp 24
#define GPIO_MODER_MODER13_gm ((uint32_t)0x0C000000)
#define GPIO_MODER_MODER13_gp 26
#define GPIO_MODER_MODER14_gm ((uint32_t)0x30000000)
#define GPIO_MODER_MODER14_gp 28
#define GPIO_MODER_MODER15_gm ((uint32_t)0xC0000000)
#define GPIO_MODER_MODER15_gp 30

/*** REGISTER: GPIO_OTYPER ***/
#define GPIO_OTYPER_OT0_gm ((uint32_t)0x00000001)
#define GPIO_OTYPER_OT0_gp 0
#define GPIO_OTYPER_OT1_gm ((uint32_t)0x00000002)
#define GPIO_OTYPER_OT1_gp 1
#define GPIO_OTYPER_OT2_gm ((uint32_t)0x00000004)
#define GPIO_OTYPER_OT2_gp 2
#define GPIO_OTYPER_OT3_gm ((uint32_t)0x00000008)
#define GPIO_OTYPER_OT3_gp 3
#define GPIO_OTYPER_OT4_gm ((uint32_t)0x00000010)
#define GPIO_OTYPER_OT4_gp 4
#define GPIO_OTYPER_OT5_gm ((uint32_t)0x00000020)
#define GPIO_OTYPER_OT5_gp 5
#define GPIO_OTYPER_OT6_gm ((uint32_t)0x00000040)
#define GPIO_OTYPER_OT6_gp 6
#define GPIO_OTYPER_OT7_gm ((uint32_t)0x00000080)
#define GPIO_OTYPER_OT7_gp 7
#define GPIO_OTYPER_OT8_gm ((uint32_t)0x00000100)
#define GPIO_OTYPER_OT8_gp 8
#define GPIO_OTYPER_OT9_gm ((uint32_t)0x00000200)
#define GPIO_OTYPER_OT9_gp 9
#define GPIO_OTYPER_OT10_gm ((uint32_t)0x00000400)
#define GPIO_OTYPER_OT10_gp 10
#define GPIO_OTYPER_OT11_gm ((uint32_t)0x00000800)
#define GPIO_OTYPER_OT11_gp 11
#define GPIO_OTYPER_OT12_gm ((uint32_t)0x00001000)
#define GPIO_OTYPER_OT12_gp 12
#define GPIO_OTYPER_OT13_gm ((uint32_t)0x00002000)
#define GPIO_OTYPER_OT13_gp 13
#define GPIO_OTYPER_OT14_gm ((uint32_t)0x00004000)
#define GPIO_OTYPER_OT14_gp 14
#define GPIO_OTYPER_OT15_gm ((uint32_t)0x00008000)
#define GPIO_OTYPER_OT15_gp 15

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR0_gm ((uint32_t)0x00000003)
#define GPIO_OSPEEDR_OSPEEDR0_gp 0

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR1_gm ((uint32_t)0x0000000C)
#define GPIO_OSPEEDR_OSPEEDR1_gp 2

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR2_gm ((uint32_t)0x00000030)
#define GPIO_OSPEEDR_OSPEEDR2_gp 4

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR3_gm ((uint32_t)0x000000C0)
#define GPIO_OSPEEDR_OSPEEDR3_gp 6

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR4_gm ((uint32_t)0x00000300)
#define GPIO_OSPEEDR_OSPEEDR4_gp 8

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR5_gm ((uint32_t)0x00000C00)
#define GPIO_OSPEEDR_OSPEEDR5_gp 10

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR6_gm ((uint32_t)0x00003000)
#define GPIO_OSPEEDR_OSPEEDR6_gp 12

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR7_gm ((uint32_t)0x0000C000)
#define GPIO_OSPEEDR_OSPEEDR7_gp 14

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR8_gm ((uint32_t)0x00030000)
#define GPIO_OSPEEDR_OSPEEDR8_gp 16

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR9_gm ((uint32_t)0x000C0000)
#define GPIO_OSPEEDR_OSPEEDR9_gp 18

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR10_gm ((uint32_t)0x00300000)
#define GPIO_OSPEEDR_OSPEEDR10_gp 20

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR11_gm ((uint32_t)0x00C00000)
#define GPIO_OSPEEDR_OSPEEDR11_gp 22

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR12_gm ((uint32_t)0x03000000)
#define GPIO_OSPEEDR_OSPEEDR12_gp 24

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR13_gm ((uint32_t)0x0C000000)
#define GPIO_OSPEEDR_OSPEEDR13_gp 26

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR14_gm ((uint32_t)0x30000000)
#define GPIO_OSPEEDR_OSPEEDR14_gp 28

/*** REGISTER: GPIO_OSPEEDR ***/
#define GPIO_OSPEEDR_OSPEEDR15_gm ((uint32_t)0xC0000000)
#define GPIO_OSPEEDR_OSPEEDR15_gp 30

/*** REGISTER: GPIO_PUPDR ***/
#define GPIO_PUPDR_PUPDR0_gm ((uint32_t)0x00000003)
#define GPIO_PUPDR_PUPDR0_gp 0
#define GPIO_PUPDR_PUPDR1_gm ((uint32_t)0x0000000C)
#define GPIO_PUPDR_PUPDR1_gp 2
#define GPIO_PUPDR_PUPDR2_gm ((uint32_t)0x00000030)
#define GPIO_PUPDR_PUPDR2_gp 4
#define GPIO_PUPDR_PUPDR3_gm ((uint32_t)0x000000C0)
#define GPIO_PUPDR_PUPDR3_gp 6
#define GPIO_PUPDR_PUPDR4_gm ((uint32_t)0x00000300)
#define GPIO_PUPDR_PUPDR4_gp 8
#define GPIO_PUPDR_PUPDR5_gm ((uint32_t)0x00000C00)
#define GPIO_PUPDR_PUPDR5_gp 10
#define GPIO_PUPDR_PUPDR6_gm ((uint32_t)0x00003000)
#define GPIO_PUPDR_PUPDR6_gp 12
#define GPIO_PUPDR_PUPDR7_gm ((uint32_t)0x0000C000)
#define GPIO_PUPDR_PUPDR7_gp 14
#define GPIO_PUPDR_PUPDR8_gm ((uint32_t)0x00030000)
#define GPIO_PUPDR_PUPDR8_gp 16
#define GPIO_PUPDR_PUPDR9_gm ((uint32_t)0x000C0000)
#define GPIO_PUPDR_PUPDR9_gp 18
#define GPIO_PUPDR_PUPDR10_gm ((uint32_t)0x00300000)
#define GPIO_PUPDR_PUPDR10_gp 20
#define GPIO_PUPDR_PUPDR11_gm ((uint32_t)0x00C00000)
#define GPIO_PUPDR_PUPDR11_gp 22
#define GPIO_PUPDR_PUPDR12_gm ((uint32_t)0x03000000)
#define GPIO_PUPDR_PUPDR12_gp 24
#define GPIO_PUPDR_PUPDR13_gm ((uint32_t)0x0C000000)
#define GPIO_PUPDR_PUPDR13_gp 26
#define GPIO_PUPDR_PUPDR14_gm ((uint32_t)0x30000000)
#define GPIO_PUPDR_PUPDR14_gp 28
#define GPIO_PUPDR_PUPDR15_gm ((uint32_t)0xC0000000)
#define GPIO_PUPDR_PUPDR15_gp 30

