a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: GPIO_IDR ***/
#define GPIO_IDR_0_gm ((uint32_t)0x00000001)
#define GPIO_IDR_0_gp 0
#define GPIO_IDR_1_gm ((uint32_t)0x00000002)
#define GPIO_IDR_1_gp 1
#define GPIO_IDR_2_gm ((uint32_t)0x00000004)
#define GPIO_IDR_2_gp 2
#define GPIO_IDR_3_gm ((uint32_t)0x00000008)
#define GPIO_IDR_3_gp 3
#define GPIO_IDR_4_gm ((uint32_t)0x00000010)
#define GPIO_IDR_4_gp 4
#define GPIO_IDR_5_gm ((uint32_t)0x00000020)
#define GPIO_IDR_5_gp 5
#define GPIO_IDR_6_gm ((uint32_t)0x00000040)
#define GPIO_IDR_6_gp 6
#define GPIO_IDR_7_gm ((uint32_t)0x00000080)
#define GPIO_IDR_7_gp 7
#define GPIO_IDR_8_gm ((uint32_t)0x00000100)
#define GPIO_IDR_8_gp 8
#define GPIO_IDR_9_gm ((uint32_t)0x00000200)
#define GPIO_IDR_9_gp 9
#define GPIO_IDR_10_gm ((uint32_t)0x00000400)
#define GPIO_IDR_10_gp 10
#define GPIO_IDR_11_gm ((uint32_t)0x00000800)
#define GPIO_IDR_11_gp 11
#define GPIO_IDR_12_gm ((uint32_t)0x00001000)
#define GPIO_IDR_12_gp 12
#define GPIO_IDR_13_gm ((uint32_t)0x00002000)
#define GPIO_IDR_13_gp 13
#define GPIO_IDR_14_gm ((uint32_t)0x00004000)
#define GPIO_IDR_14_gp 14
#define GPIO_IDR_15_gm ((uint32_t)0x00008000)
#define GPIO_IDR_15_gp 15

/*** REGISTER: GPIO_ODR ***/
#define GPIO_ODR_0_gm ((uint32_t)0x00000001)
#define GPIO_ODR_0_gp 0
#define GPIO_ODR_1_gm ((uint32_t)0x00000002)
#define GPIO_ODR_1_gp 1
#define GPIO_ODR_2_gm ((uint32_t)0x00000004)
#define GPIO_ODR_2_gp 2
#define GPIO_ODR_3_gm ((uint32_t)0x00000008)
#define GPIO_ODR_3_gp 3
#define GPIO_ODR_4_gm ((uint32_t)0x00000010)
#define GPIO_ODR_4_gp 4
#define GPIO_ODR_5_gm ((uint32_t)0x00000020)
#define GPIO_ODR_5_gp 5
#define GPIO_ODR_6_gm ((uint32_t)0x00000040)
#define GPIO_ODR_6_gp 6
#define GPIO_ODR_7_gm ((uint32_t)0x00000080)
#define GPIO_ODR_7_gp 7
#define GPIO_ODR_8_gm ((uint32_t)0x00000100)
#define GPIO_ODR_8_gp 8
#define GPIO_ODR_9_gm ((uint32_t)0x00000200)
#define GPIO_ODR_9_gp 9
#define GPIO_ODR_10_gm ((uint32_t)0x00000400)
#define GPIO_ODR_10_gp 10
#define GPIO_ODR_11_gm ((uint32_t)0x00000800)
#define GPIO_ODR_11_gp 11
#define GPIO_ODR_12_gm ((uint32_t)0x00001000)
#define GPIO_ODR_12_gp 12
#define GPIO_ODR_13_gm ((uint32_t)0x00002000)
#define GPIO_ODR_13_gp 13
#define GPIO_ODR_14_gm ((uint32_t)0x00004000)
#define GPIO_ODR_14_gp 14
#define GPIO_ODR_15_gm ((uint32_t)0x00008000)
#define GPIO_ODR_15_gp 15

/*** REGISTER: GPIO_BSRR ***/
#define GPIO_BSRR_BS0_gm ((uint32_t)0x00000001)
#define GPIO_BSRR_BS0_gp 0
#define GPIO_BSRR_BS1_gm ((uint32_t)0x00000002)
#define GPIO_BSRR_BS1_gp 1
#define GPIO_BSRR_BS2_gm ((uint32_t)0x00000004)
#define GPIO_BSRR_BS2_gp 2
#define GPIO_BSRR_BS3_gm ((uint32_t)0x00000008)
#define GPIO_BSRR_BS3_gp 3
#define GPIO_BSRR_BS4_gm ((uint32_t)0x00000010)
#define GPIO_BSRR_BS4_gp 4
#define GPIO_BSRR_BS5_gm ((uint32_t)0x00000020)
#define GPIO_BSRR_BS5_gp 5
#define GPIO_BSRR_BS6_gm ((uint32_t)0x00000040)
#define GPIO_BSRR_BS6_gp 6
#define GPIO_BSRR_BS7_gm ((uint32_t)0x00000080)
#define GPIO_BSRR_BS7_gp 7
#define GPIO_BSRR_BS8_gm ((uint32_t)0x00000100)
#define GPIO_BSRR_BS8_gp 8
#define GPIO_BSRR_BS9_gm ((uint32_t)0x00000200)
#define GPIO_BSRR_BS9_gp 9
#define GPIO_BSRR_BS10_gm ((uint32_t)0x00000400)
#define GPIO_BSRR_BS10_gp 10
#define GPIO_BSRR_BS11_gm ((uint32_t)0x00000800)
#define GPIO_BSRR_BS11_gp 11
#define GPIO_BSRR_BS12_gm ((uint32_t)0x00001000)
#define GPIO_BSRR_BS12_gp 12
#define GPIO_BSRR_BS13_gm ((uint32_t)0x00002000)
#define GPIO_BSRR_BS13_gp 13
#define GPIO_BSRR_BS14_gm ((uint32_t)0x00004000)
#define GPIO_BSRR_BS14_gp 14
#define GPIO_BSRR_BS15_gm ((uint32_t)0x00008000)
#define GPIO_BSRR_BS15_gp 15
#define GPIO_BSRR_BR0_gm ((uint32_t)0x00010000)
#define GPIO_BSRR_BR0_gp 16
#define GPIO_BSRR_BR1_gm ((uint32_t)0x00020000)
#define GPIO_BSRR_BR1_gp 17
#define GPIO_BSRR_BR2_gm ((uint32_t)0x00040000)
#define GPIO_BSRR_BR2_gp 18
#define GPIO_BSRR_BR3_gm ((uint32_t)0x00080000)
#define GPIO_BSRR_BR3_gp 19
#define GPIO_BSRR_BR4_gm ((uint32_t)0x00100000)
#define GPIO_BSRR_BR4_gp 20
#define GPIO_BSRR_BR5_gm ((uint32_t)0x00200000)
#define GPIO_BSRR_BR5_gp 21
#define GPIO_BSRR_BR6_gm ((uint32_t)0x00400000)
#define GPIO_BSRR_BR6_gp 22
#define GPIO_BSRR_BR7_gm ((uint32_t)0x00800000)
#define GPIO_BSRR_BR7_gp 23
#define GPIO_BSRR_BR8_gm ((uint32_t)0x01000000)
#define GPIO_BSRR_BR8_gp 24
#define GPIO_BSRR_BR9_gm ((uint32_t)0x02000000)
#define GPIO_BSRR_BR9_gp 25
#define GPIO_BSRR_BR10_gm ((uint32_t)0x04000000)
#define GPIO_BSRR_BR10_gp 26
#define GPIO_BSRR_BR11_gm ((uint32_t)0x08000000)
#define GPIO_BSRR_BR11_gp 27
#define GPIO_BSRR_BR12_gm ((uint32_t)0x10000000)
#define GPIO_BSRR_BR12_gp 28
#define GPIO_BSRR_BR13_gm ((uint32_t)0x20000000)
#define GPIO_BSRR_BR13_gp 29
#define GPIO_BSRR_BR14_gm ((uint32_t)0x40000000)
#define GPIO_BSRR_BR14_gp 30
#define GPIO_BSRR_BR15_gm ((uint32_t)0x80000000)
#define GPIO_BSRR_BR15_gp 31

/*** REGISTER: GPIO_LCKR ***/
#define GPIO_LCKR_LCK0_gm ((uint32_t)0x00000001)
#define GPIO_LCKR_LCK0_gp 0
#define GPIO_LCKR_LCK1_gm ((uint32_t)0x00000002)
#define GPIO_LCKR_LCK1_gp 1
#define GPIO_LCKR_LCK2_gm ((uint32_t)0x00000004)
#define GPIO_LCKR_LCK2_gp 2
#define GPIO_LCKR_LCK3_gm ((uint32_t)0x00000008)
#define GPIO_LCKR_LCK3_gp 3
#define GPIO_LCKR_LCK4_gm ((uint32_t)0x00000010)
#define GPIO_LCKR_LCK4_gp 4
#define GPIO_LCKR_LCK5_gm ((uint32_t)0x00000020)
#define GPIO_LCKR_LCK5_gp 5
#define GPIO_LCKR_LCK6_gm ((uint32_t)0x00000040)
#define GPIO_LCKR_LCK6_gp 6
#define GPIO_LCKR_LCK7_gm ((uint32_t)0x00000080)
#define GPIO_LCKR_LCK7_gp 7
#define GPIO_LCKR_LCK8_gm ((uint32_t)0x00000100)
#define GPIO_LCKR_LCK8_gp 8
#define GPIO_LCKR_LCK9_gm ((uint32_t)0x00000200)
#define GPIO_LCKR_LCK9_gp 9
#define GPIO_LCKR_LCK10_gm ((uint32_t)0x00000400)
#define GPIO_LCKR_LCK10_gp 10
#define GPIO_LCKR_LCK11_gm ((uint32_t)0x00000800)
#define GPIO_LCKR_LCK11_gp 11
#define GPIO_LCKR_LCK12_gm ((uint32_t)0x00001000)
#define GPIO_LCKR_LCK12_gp 12
#define GPIO_LCKR_LCK13_gm ((uint32_t)0x00002000)
#define GPIO_LCKR_LCK13_gp 13
#define GPIO_LCKR_LCK14_gm ((uint32_t)0x00004000)
#define GPIO_LCKR_LCK14_gp 14
#define GPIO_LCKR_LCK15_gm ((uint32_t)0x00008000)
#define GPIO_LCKR_LCK15_gp 15
#define GPIO_LCKR_LCKK_gm ((uint32_t)0x00010000)
#define GPIO_LCKR_LCKK_gp 16

