a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: GPIO_AFRL ***/
#define GPIO_AFRL_AFRL0_gm ((uint32_t)0x0000000F)
#define GPIO_AFRL_AFRL0_gp 0
#define GPIO_AFRL_AFRL1_gm ((uint32_t)0x000000F0)
#define GPIO_AFRL_AFRL1_gp 4
#define GPIO_AFRL_AFRL2_gm ((uint32_t)0x00000F00)
#define GPIO_AFRL_AFRL2_gp 8
#define GPIO_AFRL_AFRL3_gm ((uint32_t)0x0000F000)
#define GPIO_AFRL_AFRL3_gp 12
#define GPIO_AFRL_AFRL4_gm ((uint32_t)0x000F0000)
#define GPIO_AFRL_AFRL4_gp 16
#define GPIO_AFRL_AFRL5_gm ((uint32_t)0x00F00000)
#define GPIO_AFRL_AFRL5_gp 20
#define GPIO_AFRL_AFRL6_gm ((uint32_t)0x0F000000)
#define GPIO_AFRL_AFRL6_gp 24
#define GPIO_AFRL_AFRL7_gm ((uint32_t)0xF0000000)
#define GPIO_AFRL_AFRL7_gp 28

/*** REGISTER: GPIO_AFRH ***/
#define GPIO_AFRH_AFRH8_gm ((uint32_t)0x0000000F)
#define GPIO_AFRH_AFRH8_gp 0
#define GPIO_AFRH_AFRH9_gm ((uint32_t)0x000000F0)
#define GPIO_AFRH_AFRH9_gp 4
#define GPIO_AFRH_AFRH10_gm ((uint32_t)0x00000F00)
#define GPIO_AFRH_AFRH10_gp 8
#define GPIO_AFRH_AFRH11_gm ((uint32_t)0x0000F000)
#define GPIO_AFRH_AFRH11_gp 12
#define GPIO_AFRH_AFRH12_gm ((uint32_t)0x000F0000)
#define GPIO_AFRH_AFRH12_gp 16
#define GPIO_AFRH_AFRH13_gm ((uint32_t)0x00F00000)
#define GPIO_AFRH_AFRH13_gp 20
#define GPIO_AFRH_AFRH14_gm ((uint32_t)0x0F000000)
#define GPIO_AFRH_AFRH14_gp 24
#define GPIO_AFRH_AFRH15_gm ((uint32_t)0xF0000000)
#define GPIO_AFRH_AFRH15_gp 28

/*** REGISTER: GPIO_BRR ***/
#define GPIO_BRR_BR0_gm ((uint32_t)0x00000001)
#define GPIO_BRR_BR0_gp 0
#define GPIO_BRR_BR1_gm ((uint32_t)0x00000002)
#define GPIO_BRR_BR1_gp 1
#define GPIO_BRR_BR2_gm ((uint32_t)0x00000004)
#define GPIO_BRR_BR2_gp 2
#define GPIO_BRR_BR3_gm ((uint32_t)0x00000008)
#define GPIO_BRR_BR3_gp 3
#define GPIO_BRR_BR4_gm ((uint32_t)0x00000010)
#define GPIO_BRR_BR4_gp 4
#define GPIO_BRR_BR5_gm ((uint32_t)0x00000020)
#define GPIO_BRR_BR5_gp 5
#define GPIO_BRR_BR6_gm ((uint32_t)0x00000040)
#define GPIO_BRR_BR6_gp 6
#define GPIO_BRR_BR7_gm ((uint32_t)0x00000080)
#define GPIO_BRR_BR7_gp 7
#define GPIO_BRR_BR8_gm ((uint32_t)0x00000100)
#define GPIO_BRR_BR8_gp 8
#define GPIO_BRR_BR9_gm ((uint32_t)0x00000200)
#define GPIO_BRR_BR9_gp 9
#define GPIO_BRR_BR10_gm ((uint32_t)0x00000400)
#define GPIO_BRR_BR10_gp 10
#define GPIO_BRR_BR11_gm ((uint32_t)0x00000800)
#define GPIO_BRR_BR11_gp 11
#define GPIO_BRR_BR12_gm ((uint32_t)0x00001000)
#define GPIO_BRR_BR12_gp 12
#define GPIO_BRR_BR13_gm ((uint32_t)0x00002000)
#define GPIO_BRR_BR13_gp 13
#define GPIO_BRR_BR14_gm ((uint32_t)0x00004000)
#define GPIO_BRR_BR14_gp 14
#define GPIO_BRR_BR15_gm ((uint32_t)0x00008000)
#define GPIO_BRR_BR15_gp 15


/********** PERIPHERAL: I2C **********/

/*** REGISTER: I2C_CR1 ***/
#define I2C_CR1_PE_gm ((uint32_t)0x00000001)
#define I2C_CR1_PE_gp 0
#define I2C_CR1_TXIE_gm ((uint32_t)0x00000002)
#define I2C_CR1_TXIE_gp 1
#define I2C_CR1_RXIE_gm ((uint32_t)0x00000004)
#define I2C_CR1_RXIE_gp 2
#define I2C_CR1_ADDRIE_gm ((uint32_t)0x00000008)
#define I2C_CR1_ADDRIE_gp 3
#define I2C_CR1_NACKIE_gm ((uint32_t)0x00000010)
#define I2C_CR1_NACKIE_gp 4
#define I2C_CR1_STOPIE_gm ((uint32_t)0x00000020)
#define I2C_CR1_STOPIE_gp 5
#define I2C_CR1_TCIE_gm ((uint32_t)0x00000040)
#define I2C_CR1_TCIE_gp 6
#define I2C_CR1_ERRIE_gm ((uint32_t)0x00000080)
#define I2C_CR1_ERRIE_gp 7
#define I2C_CR1_DFN_gm ((uint32_t)0x00000F00)
#define I2C_CR1_DFN_gp 8
#define I2C_CR1_ANFOFF_gm ((uint32_t)0x00001000)
#define I2C_CR1_ANFOFF_gp 12
#define I2C_CR1_SWRST_gm ((uint32_t)0x00002000)
#define I2C_CR1_SWRST_gp 13
#define I2C_CR1_TXDMAEN_gm ((uint32_t)0x00004000)
#define I2C_CR1_TXDMAEN_gp 14
#define I2C_CR1_RXDMAEN_gm ((uint32_t)0x00008000)
#define I2C_CR1_RXDMAEN_gp 15
#define I2C_CR1_SBC_gm ((uint32_t)0x00010000)
#define I2C_CR1_SBC_gp 16
#define I2C_CR1_NOSTRETCH_gm ((uint32_t)0x00020000)
#define I2C_CR1_NOSTRETCH_gp 17
#define I2C_CR1_WUPEN_gm ((uint32_t)0x00040000)
#define I2C_CR1_WUPEN_gp 18
#define I2C_CR1_GCEN_gm ((uint32_t)0x00080000)
#define I2C_CR1_GCEN_gp 19
#define I2C_CR1_SMBHEN_gm ((uint32_t)0x00100000)
#define I2C_CR1_SMBHEN_gp 20
#define I2C_CR1_SMBDEN_gm ((uint32_t)0x00200000)
#define I2C_CR1_SMBDEN_gp 21
#define I2C_CR1_ALERTEN_gm ((uint32_t)0x00400000)
#define I2C_CR1_ALERTEN_gp 22
#define I2C_CR1_PECEN_gm ((uint32_t)0x00800000)
#define I2C_CR1_PECEN_gp 23

/*** REGISTER: I2C_CR2 ***/
#define I2C_CR2_SADD_gm ((uint32_t)0x000003FF)
#define I2C_CR2_SADD_gp 0
#define I2C_CR2_RD_WRN_gm ((uint32_t)0x00000400)
#define I2C_CR2_RD_WRN_gp 10
#define I2C_CR2_ADD10_gm ((uint32_t)0x00000800)
#define I2C_CR2_ADD10_gp 11
#define I2C_CR2_HEAD10R_gm ((uint32_t)0x00001000)
#define I2C_CR2_HEAD10R_gp 12
#define I2C_CR2_START_gm ((uint32_t)0x00002000)
#define I2C_CR2_START_gp 13
#define I2C_CR2_STOP_gm ((uint32_t)0x00004000)
#define I2C_CR2_STOP_gp 14
#define I2C_CR2_NACK_gm ((uint32_t)0x00008000)
#define I2C_CR2_NACK_gp 15
#define I2C_CR2_NBYTES_gm ((uint32_t)0x00FF0000)
#define I2C_CR2_NBYTES_gp 16
#define I2C_CR2_RELOAD_gm ((uint32_t)0x01000000)
#define I2C_CR2_RELOAD_gp 24
#define I2C_CR2_AUTOEND_gm ((uint32_t)0x02000000)
#define I2C_CR2_AUTOEND_gp 25
#define I2C_CR2_PECBYTE_gm ((uint32_t)0x04000000)
#define I2C_CR2_PECBYTE_gp 26

/*** REGISTER: I2C_OAR1 ***/
#define I2C_OAR1_OA1_gm ((uint32_t)0x000003FF)
#define I2C_OAR1_OA1_gp 0
#define I2C_OAR1_OA1MODE_gm ((uint32_t)0x00000400)
#define I2C_OAR1_OA1MODE_gp 10
#define I2C_OAR1_OA1EN_gm ((uint32_t)0x00008000)
#define I2C_OAR1_OA1EN_gp 15

/*** REGISTER: I2C_OAR2 ***/
#define I2C_OAR2_OA2_gm ((uint32_t)0x000000FE)
#define I2C_OAR2_OA2_gp 1
#define I2C_OAR2_OA2MSK_gm ((uint32_t)0x00000700)
#define I2C_OAR2_OA2MSK_gp 8
#define I2C_OAR2_OA2EN_gm ((uint32_t)0x00008000)
#define I2C_OAR2_OA2EN_gp 15

/*** REGISTER: I2C_TIMINGR ***/
#define I2C_TIMINGR_SCLL_gm ((uint32_t)0x000000FF)
#define I2C_TIMINGR_SCLL_gp 0
#define I2C_TIMINGR_SCLH_gm ((uint32_t)0x0000FF00)
#define I2C_TIMINGR_SCLH_gp 8
#define I2C_TIMINGR_SDADEL_gm ((uint32_t)0x000F0000)
#define I2C_TIMINGR_SDADEL_gp 16
#define I2C_TIMINGR_SCLDEL_gm ((uint32_t)0x00F00000)
#define I2C_TIMINGR_SCLDEL_gp 20
#define I2C_TIMINGR_PRESC_gm ((uint32_t)0xF0000000)
#define I2C_TIMINGR_PRESC_gp 28

/*** REGISTER: I2C_TIMEOUTR ***/
#define I2C_TIMEOUTR_TIMEOUTA_gm ((uint32_t)0x00000FFF)
#define I2C_TIMEOUTR_TIMEOUTA_gp 0
#define I2C_TIMEOUTR_TIDLE_gm ((uint32_t)0x00001000)
#define I2C_TIMEOUTR_TIDLE_gp 12
#define I2C_TIMEOUTR_TIMOUTEN_gm ((uint32_t)0x00008000)
#define I2C_TIMEOUTR_TIMOUTEN_gp 15
#define I2C_TIMEOUTR_TIMEOUTB_gm ((uint32_t)0x0FFF0000)
#define I2C_TIMEOUTR_TIMEOUTB_gp 16
#define I2C_TIMEOUTR_TEXTEN_gm ((uint32_t)0x80000000)
#define I2C_TIMEOUTR_TEXTEN_gp 31

