a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: I2C_ISR ***/
#define I2C_ISR_TXE_gm ((uint32_t)0x00000001)
#define I2C_ISR_TXE_gp 0
#define I2C_ISR_TXIS_gm ((uint32_t)0x00000002)
#define I2C_ISR_TXIS_gp 1
#define I2C_ISR_RXNE_gm ((uint32_t)0x00000004)
#define I2C_ISR_RXNE_gp 2
#define I2C_ISR_ADDR_gm ((uint32_t)0x00000008)
#define I2C_ISR_ADDR_gp 3
#define I2C_ISR_NACKF_gm ((uint32_t)0x00000010)
#define I2C_ISR_NACKF_gp 4
#define I2C_ISR_STOPF_gm ((uint32_t)0x00000020)
#define I2C_ISR_STOPF_gp 5
#define I2C_ISR_TC_gm ((uint32_t)0x00000040)
#define I2C_ISR_TC_gp 6
#define I2C_ISR_TCR_gm ((uint32_t)0x00000080)
#define I2C_ISR_TCR_gp 7
#define I2C_ISR_BERR_gm ((uint32_t)0x00000100)
#define I2C_ISR_BERR_gp 8
#define I2C_ISR_ARLO_gm ((uint32_t)0x00000200)
#define I2C_ISR_ARLO_gp 9
#define I2C_ISR_OVR_gm ((uint32_t)0x00000400)
#define I2C_ISR_OVR_gp 10
#define I2C_ISR_PECERR_gm ((uint32_t)0x00000800)
#define I2C_ISR_PECERR_gp 11
#define I2C_ISR_TIMEOUT_gm ((uint32_t)0x00001000)
#define I2C_ISR_TIMEOUT_gp 12
#define I2C_ISR_ALERT_gm ((uint32_t)0x00002000)
#define I2C_ISR_ALERT_gp 13
#define I2C_ISR_BUSY_gm ((uint32_t)0x00008000)
#define I2C_ISR_BUSY_gp 15
#define I2C_ISR_DIR_gm ((uint32_t)0x00010000)
#define I2C_ISR_DIR_gp 16
#define I2C_ISR_ADDCODE_gm ((uint32_t)0x00FE0000)
#define I2C_ISR_ADDCODE_gp 17

/*** REGISTER: I2C_ICR ***/
#define I2C_ICR_ADDRCF_gm ((uint32_t)0x00000008)
#define I2C_ICR_ADDRCF_gp 3
#define I2C_ICR_NACKCF_gm ((uint32_t)0x00000010)
#define I2C_ICR_NACKCF_gp 4
#define I2C_ICR_STOPCF_gm ((uint32_t)0x00000020)
#define I2C_ICR_STOPCF_gp 5
#define I2C_ICR_BERRCF_gm ((uint32_t)0x00000100)
#define I2C_ICR_BERRCF_gp 8
#define I2C_ICR_ARLOCF_gm ((uint32_t)0x00000200)
#define I2C_ICR_ARLOCF_gp 9
#define I2C_ICR_OVRCF_gm ((uint32_t)0x00000400)
#define I2C_ICR_OVRCF_gp 10
#define I2C_ICR_PECCF_gm ((uint32_t)0x00000800)
#define I2C_ICR_PECCF_gp 11
#define I2C_ICR_TIMOUTCF_gm ((uint32_t)0x00001000)
#define I2C_ICR_TIMOUTCF_gp 12
#define I2C_ICR_ALERTCF_gm ((uint32_t)0x00002000)
#define I2C_ICR_ALERTCF_gp 13

/*** REGISTER: I2C_PECR ***/
#define I2C_PECR_PEC_gm ((uint32_t)0x000000FF)
#define I2C_PECR_PEC_gp 0

/*** REGISTER: I2C_RXDR ***/
#define I2C_RXDR_RXDATA_gm ((uint32_t)0x000000FF)
#define I2C_RXDR_RXDATA_gp 0

/*** REGISTER: I2C_TXDR ***/
#define I2C_TXDR_TXDATA_gm ((uint32_t)0x000000FF)
#define I2C_TXDR_TXDATA_gp 0


/********** PERIPHERAL: IWDG **********/

/*** REGISTER: IWDG_KR ***/
#define IWDG_KR_KEY_gm ((uint16_t)0xFFFF)
#define IWDG_KR_KEY_gp 0

/*** REGISTER: IWDG_PR ***/
#define IWDG_PR_PR_gm ((uint8_t)0x07)
#define IWDG_PR_PR_gp 0
#define IWDG_PR_PR0_gm ((uint8_t)0x01)
#define IWDG_PR_PR0_gp 0
#define IWDG_PR_PR1_gm ((uint8_t)0x02)
#define IWDG_PR_PR1_gp 1
#define IWDG_PR_PR2_gm ((uint8_t)0x04)
#define IWDG_PR_PR2_gp 2

/*** REGISTER: IWDG_RLR ***/
#define IWDG_RLR_RL_gm ((uint16_t)0x0FFF)
#define IWDG_RLR_RL_gp 0

/*** REGISTER: IWDG_SR ***/
#define IWDG_SR_PVU_gm ((uint8_t)0x01)
#define IWDG_SR_PVU_gp 0
#define IWDG_SR_RVU_gm ((uint8_t)0x02)
#define IWDG_SR_RVU_gp 1
#define IWDG_SR_WVU_gm ((uint8_t)0x04)
#define IWDG_SR_WVU_gp 2

/*** REGISTER: IWDG_WINR ***/
#define IWDG_WINR_WIN_gm ((uint16_t)0x0FFF)
#define IWDG_WINR_WIN_gp 0


/********** PERIPHERAL: PWR **********/

/*** REGISTER: PWR_CR ***/
#define PWR_CR_LPSDSR_gm ((uint16_t)0x0001)
#define PWR_CR_LPSDSR_gp 0
#define PWR_CR_PDDS_gm ((uint16_t)0x0002)
#define PWR_CR_PDDS_gp 1
#define PWR_CR_CWUF_gm ((uint16_t)0x0004)
#define PWR_CR_CWUF_gp 2
#define PWR_CR_CSBF_gm ((uint16_t)0x0008)
#define PWR_CR_CSBF_gp 3
#define PWR_CR_PVDE_gm ((uint16_t)0x0010)
#define PWR_CR_PVDE_gp 4
#define PWR_CR_PLS_gm ((uint16_t)0x00E0)
#define PWR_CR_PLS_gp 5
#define PWR_CR_PLS0_gm ((uint16_t)0x0020)
#define PWR_CR_PLS0_gp 5
#define PWR_CR_PLS1_gm ((uint16_t)0x0040)
#define PWR_CR_PLS1_gp 6
#define PWR_CR_PLS2_gm ((uint16_t)0x0080)
#define PWR_CR_PLS2_gp 7
#define PWR_CR_PLS_LEV0_gc ((uint16_t)0x0000)
#define PWR_CR_PLS_LEV1_gc ((uint16_t)0x0020)
#define PWR_CR_PLS_LEV2_gc ((uint16_t)0x0040)
#define PWR_CR_PLS_LEV3_gc ((uint16_t)0x0060)
#define PWR_CR_PLS_LEV4_gc ((uint16_t)0x0080)
#define PWR_CR_PLS_LEV5_gc ((uint16_t)0x00A0)
#define PWR_CR_PLS_LEV6_gc ((uint16_t)0x00C0)
#define PWR_CR_PLS_LEV7_gc ((uint16_t)0x00E0)
#define PWR_CR_DBP_gm ((uint16_t)0x0100)
#define PWR_CR_DBP_gp 8

/*** REGISTER: PWR_CSR ***/
#define PWR_CSR_WUF_gm ((uint16_t)0x0001)
#define PWR_CSR_WUF_gp 0
#define PWR_CSR_SBF_gm ((uint16_t)0x0002)
#define PWR_CSR_SBF_gp 1
#define PWR_CSR_PVDO_gm ((uint16_t)0x0004)
#define PWR_CSR_PVDO_gp 2
#define PWR_CSR_VREFINTRDYF_gm ((uint16_t)0x0008)
#define PWR_CSR_VREFINTRDYF_gp 3
#define PWR_CSR_EWUP1_gm ((uint16_t)0x0100)
#define PWR_CSR_EWUP1_gp 8
#define PWR_CSR_EWUP2_gm ((uint16_t)0x0200)
#define PWR_CSR_EWUP2_gp 9
#define PWR_CSR_EWUP3_gm ((uint16_t)0x0400)
#define PWR_CSR_EWUP3_gp 10


/********** PERIPHERAL: RCC **********/

/*** REGISTER: RCC_CR ***/
#define RCC_CR_HSION_gm ((uint32_t)0x00000001)
#define RCC_CR_HSION_gp 0
#define RCC_CR_HSIRDY_gm ((uint32_t)0x00000002)
#define RCC_CR_HSIRDY_gp 1
#define RCC_CR_HSITRIM_gm ((uint32_t)0x000000F8)
#define RCC_CR_HSITRIM_gp 3
#define RCC_CR_HSITRIM0_gm ((uint32_t)0x00000008)
#define RCC_CR_HSITRIM0_gp 3
#define RCC_CR_HSITRIM1_gm ((uint32_t)0x00000010)
#define RCC_CR_HSITRIM1_gp 4
#define RCC_CR_HSITRIM2_gm ((uint32_t)0x00000020)
#define RCC_CR_HSITRIM2_gp 5
#define RCC_CR_HSITRIM3_gm ((uint32_t)0x00000040)
#define RCC_CR_HSITRIM3_gp 6
#define RCC_CR_HSITRIM4_gm ((uint32_t)0x00000080)
#define RCC_CR_HSITRIM4_gp 7
#define RCC_CR_HSICAL_gm ((uint32_t)0x0000FF00)
#define RCC_CR_HSICAL_gp 8
#define RCC_CR_HSICAL0_gm ((uint32_t)0x00000100)
#define RCC_CR_HSICAL0_gp 8
#define RCC_CR_HSICAL1_gm ((uint32_t)0x00000200)
#define RCC_CR_HSICAL1_gp 9
#define RCC_CR_HSICAL2_gm ((uint32_t)0x00000400)
#define RCC_CR_HSICAL2_gp 10
#define RCC_CR_HSICAL3_gm ((uint32_t)0x00000800)
#define RCC_CR_HSICAL3_gp 11
#define RCC_CR_HSICAL4_gm ((uint32_t)0x00001000)
#define RCC_CR_HSICAL4_gp 12
#define RCC_CR_HSICAL5_gm ((uint32_t)0x00002000)
#define RCC_CR_HSICAL5_gp 13
#define RCC_CR_HSICAL6_gm ((uint32_t)0x00004000)
#define RCC_CR_HSICAL6_gp 14
#define RCC_CR_HSICAL7_gm ((uint32_t)0x00008000)
#define RCC_CR_HSICAL7_gp 15
#define RCC_CR_HSEON_gm ((uint32_t)0x00010000)
#define RCC_CR_HSEON_gp 16
#define RCC_CR_HSERDY_gm ((uint32_t)0x00020000)
#define RCC_CR_HSERDY_gp 17
#define RCC_CR_HSEBYP_gm ((uint32_t)0x00040000)
#define RCC_CR_HSEBYP_gp 18
#define RCC_CR_CSSON_gm ((uint32_t)0x00080000)
#define RCC_CR_CSSON_gp 19
#define RCC_CR_PLLON_gm ((uint32_t)0x01000000)
#define RCC_CR_PLLON_gp 24
#define RCC_CR_PLLRDY_gm ((uint32_t)0x02000000)
#define RCC_CR_PLLRDY_gp 25

/*** REGISTER: RCC_CFGR ***/
#define RCC_CFGR_SW_gm ((uint32_t)0x00000003)
#define RCC_CFGR_SW_gp 0
#define RCC_CFGR_SW0_gm ((uint32_t)0x00000001)
#define RCC_CFGR_SW0_gp 0
#define RCC_CFGR_SW1_gm ((uint32_t)0x00000002)
#define RCC_CFGR_SW1_gp 1
#define RCC_CFGR_SW_HSI_gc ((uint32_t)0x00000000)
#define RCC_CFGR_SW_HSE_gc ((uint32_t)0x00000001)
#define RCC_CFGR_SW_PLL_gc ((uint32_t)0x00000002)
#define RCC_CFGR_SWS_gm ((uint32_t)0x0000000C)
#define RCC_CFGR_SWS_gp 2
#define RCC_CFGR_SWS0_gm ((uint32_t)0x00000004)
#define RCC_CFGR_SWS0_gp 2
#define RCC_CFGR_SWS1_gm ((uint32_t)0x00000008)
#define RCC_CFGR_SWS1_gp 3
#define RCC_CFGR_SWS_HSI_gc ((uint32_t)0x00000000)
#define RCC_CFGR_SWS_HSE_gc ((uint32_t)0x00000004)
#define RCC_CFGR_SWS_PLL_gc ((uint32_t)0x00000008)
#define RCC_CFGR_HPRE_gm ((uint32_t)0x000000F0)
#define RCC_CFGR_HPRE_gp 4
#define RCC_CFGR_HPRE0_gm ((uint32_t)0x00000010)
#define RCC_CFGR_HPRE0_gp 4
#define RCC_CFGR_HPRE1_gm ((uint32_t)0x00000020)
#define RCC_CFGR_HPRE1_gp 5
#define RCC_CFGR_HPRE2_gm ((uint32_t)0x00000040)
#define RCC_CFGR_HPRE2_gp 6
#define RCC_CFGR_HPRE3_gm ((uint32_t)0x00000080)
#define RCC_CFGR_HPRE3_gp 7
#define RCC_CFGR_HPRE_DIV1_gc ((uint32_t)0x00000000)
#define RCC_CFGR_HPRE_DIV2_gc ((uint32_t)0x00000080)
#define RCC_CFGR_HPRE_DIV4_gc ((uint32_t)0x00000090)
#define RCC_CFGR_HPRE_DIV8_gc ((uint32_t)0x000000A0)
#define RCC_CFGR_HPRE_DIV16_gc ((uint32_t)0x000000B0)
#define RCC_CFGR_HPRE_DIV64_gc ((uint32_t)0x000000C0)
#define RCC_CFGR_HPRE_DIV128_gc ((uint32_t)0x000000D0)
#define RCC_CFGR_HPRE_DIV256_gc ((uint32_t)0x000000E0)
#define RCC_CFGR_HPRE_DIV512_gc ((uint32_t)0x000000F0)
#define RCC_CFGR_PPRE1_gm ((uint32_t)0x00000700)
#define RCC_CFGR_PPRE1_gp 8
#define RCC_CFGR_PPRE1_DIV1_gc ((uint32_t)0x00000000)
#define RCC_CFGR_PPRE1_DIV2_gc ((uint32_t)0x00000400)
#define RCC_CFGR_PPRE1_DIV4_gc ((uint32_t)0x00000500)
#define RCC_CFGR_PPRE1_DIV8_gc ((uint32_t)0x00000600)
#define RCC_CFGR_PPRE1_DIV16_gc ((uint32_t)0x00000700)
#define RCC_CFGR_PPRE2_gm ((uint32_t)0x00003800)
#define RCC_CFGR_PPRE2_gp 11
#define RCC_CFGR_PPRE2_DIV1_gc ((uint32_t)0x00000000)
#define RCC_CFGR_PPRE2_DIV2_gc ((uint32_t)0x00002000)
#define RCC_CFGR_PPRE2_DIV4_gc ((uint32_t)0x00002800)
#define RCC_CFGR_PPRE2_DIV8_gc ((uint32_t)0x00003000)
#define RCC_CFGR_PPRE2_DIV16_gc ((uint32_t)0x00003800)
#define RCC_CFGR_PLLSRC_gm ((uint32_t)0x00010000)
#define RCC_CFGR_PLLSRC_gp 16
#define RCC_CFGR_PLLXTPRE_gm ((uint32_t)0x00020000)
#define RCC_CFGR_PLLXTPRE_gp 17
#define RCC_CFGR_PLLMULL_gm ((uint32_t)0x003C0000)
#define RCC_CFGR_PLLMULL_gp 18
#define RCC_CFGR_PLLSRC_HSI_Div2_gc ((uint32_t)0x00000000)
#define RCC_CFGR_PLLSRC_PREDIV1_gc ((uint32_t)0x00010000)
#define RCC_CFGR_PLLXTPRE_PREDIV1_gc ((uint32_t)0x00000000)
#define RCC_CFGR_PLLXTPRE_PREDIV1_Div2_gc ((uint32_t)0x00020000)
#define RCC_CFGR_PLLMULL2_gc ((uint32_t)0x00000000)
#define RCC_CFGR_PLLMULL3_gm ((uint32_t)0x00040000)
#define RCC_CFGR_PLLMULL3_gp 18
#define RCC_CFGR_PLLMULL4_gm ((uint32_t)0x00080000)
#define RCC_CFGR_PLLMULL4_gp 19
#define RCC_CFGR_PLLMULL5_gm ((uint32_t)0x000C0000)
#define RCC_CFGR_PLLMULL5_gp 18
#define RCC_CFGR_PLLMULL6_gm ((uint32_t)0x00100000)
#define RCC_CFGR_PLLMULL6_gp 20
#define RCC_CFGR_PLLMULL7_gm ((uint32_t)0x00140000)
#define RCC_CFGR_PLLMULL7_gp 18
#define RCC_CFGR_PLLMULL8_gm ((uint32_t)0x00180000)
#define RCC_CFGR_PLLMULL8_gp 19
#define RCC_CFGR_PLLMULL9_gm ((uint32_t)0x001C0000)
#define RCC_CFGR_PLLMULL9_gp 18
#define RCC_CFGR_PLLMULL10_gm ((uint32_t)0x00200000)
#define RCC_CFGR_PLLMULL10_gp 21
#define RCC_CFGR_PLLMULL11_gm ((uint32_t)0x00240000)
#define RCC_CFGR_PLLMULL11_gp 18
#define RCC_CFGR_PLLMULL12_gm ((uint32_t)0x00280000)
#define RCC_CFGR_PLLMULL12_gp 19
#define RCC_CFGR_PLLMULL13_gm ((uint32_t)0x002C0000)
#define RCC_CFGR_PLLMULL13_gp 18
#define RCC_CFGR_PLLMULL14_gm ((uint32_t)0x00300000)
#define RCC_CFGR_PLLMULL14_gp 20
#define RCC_CFGR_PLLMULL15_gm ((uint32_t)0x00340000)
#define RCC_CFGR_PLLMULL15_gp 18
#define RCC_CFGR_PLLMULL16_gm ((uint32_t)0x00380000)
#define RCC_CFGR_PLLMULL16_gp 19
#define RCC_CFGR_USBPRE_gm ((uint32_t)0x00400000)
#define RCC_CFGR_USBPRE_gp 22
#define RCC_CFGR_I2SSRC_gm ((uint32_t)0x00800000)
#define RCC_CFGR_I2SSRC_gp 23
#define RCC_CFGR_MCO_gm ((uint32_t)0x07000000)
#define RCC_CFGR_MCO_gp 24
#define RCC_CFGR_MCO0_gm ((uint32_t)0x01000000)
#define RCC_CFGR_MCO0_gp 24
#define RCC_CFGR_MCO1_gm ((uint32_t)0x02000000)
#define RCC_CFGR_MCO1_gp 25
#define RCC_CFGR_MCO2_gm ((uint32_t)0x04000000)
#define RCC_CFGR_MCO2_gp 26
#define RCC_CFGR_MCO_NOCLOCK_gc ((uint32_t)0x00000000)
#define RCC_CFGR_MCO_LSI_gc ((uint32_t)0x02000000)
#define RCC_CFGR_MCO_LSE_gc ((uint32_t)0x03000000)
#define RCC_CFGR_MCO_SYSCLK_gc ((uint32_t)0x04000000)
#define RCC_CFGR_MCO_HSI_gc ((uint32_t)0x05000000)
#define RCC_CFGR_MCO_HSE_gc ((uint32_t)0x06000000)
#define RCC_CFGR_MCO_PLL_gc ((uint32_t)0x07000000)
#define RCC_CFGR_MCOF_gm ((uint32_t)0x10000000)
#define RCC_CFGR_MCOF_gp 28

/*** REGISTER: RCC_CIR ***/
#define RCC_CIR_LSIRDYF_gm ((uint32_t)0x00000001)
#define RCC_CIR_LSIRDYF_gp 0
#define RCC_CIR_LSERDYF_gm ((uint32_t)0x00000002)
#define RCC_CIR_LSERDYF_gp 1
#define RCC_CIR_HSIRDYF_gm ((uint32_t)0x00000004)
#define RCC_CIR_HSIRDYF_gp 2
#define RCC_CIR_HSERDYF_gm ((uint32_t)0x00000008)
#define RCC_CIR_HSERDYF_gp 3
#define RCC_CIR_PLLRDYF_gm ((uint32_t)0x00000010)
#define RCC_CIR_PLLRDYF_gp 4
#define RCC_CIR_CSSF_gm ((uint32_t)0x00000080)
#define RCC_CIR_CSSF_gp 7
#define RCC_CIR_LSIRDYIE_gm ((uint32_t)0x00000100)
#define RCC_CIR_LSIRDYIE_gp 8
#define RCC_CIR_LSERDYIE_gm ((uint32_t)0x00000200)
#define RCC_CIR_LSERDYIE_gp 9
#define RCC_CIR_HSIRDYIE_gm ((uint32_t)0x00000400)
#define RCC_CIR_HSIRDYIE_gp 10
#define RCC_CIR_HSERDYIE_gm ((uint32_t)0x00000800)
#define RCC_CIR_HSERDYIE_gp 11
#define RCC_CIR_PLLRDYIE_gm ((uint32_t)0x00001000)
#define RCC_CIR_PLLRDYIE_gp 12
#define RCC_CIR_LSIRDYC_gm ((uint32_t)0x00010000)
#define RCC_CIR_LSIRDYC_gp 16
#define RCC_CIR_LSERDYC_gm ((uint32_t)0x00020000)
#define RCC_CIR_LSERDYC_gp 17
#define RCC_CIR_HSIRDYC_gm ((uint32_t)0x00040000)
#define RCC_CIR_HSIRDYC_gp 18
#define RCC_CIR_HSERDYC_gm ((uint32_t)0x00080000)
#define RCC_CIR_HSERDYC_gp 19
#define RCC_CIR_PLLRDYC_gm ((uint32_t)0x00100000)
#define RCC_CIR_PLLRDYC_gp 20
#define RCC_CIR_CSSC_gm ((uint32_t)0x00800000)
#define RCC_CIR_CSSC_gp 23

/*** REGISTER: RCC_APB2RSTR ***/
#define RCC_APB2RSTR_SYSCFGRST_gm ((uint32_t)0x00000001)
#define RCC_APB2RSTR_SYSCFGRST_gp 0
#define RCC_APB2RSTR_TIM1RST_gm ((uint32_t)0x00000200)
#define RCC_APB2RSTR_TIM1RST_gp 9
#define RCC_APB2RSTR_SPI1RST_gm ((uint32_t)0x00001000)
#define RCC_APB2RSTR_SPI1RST_gp 12
#define RCC_APB2RSTR_TIM8RST_gm ((uint32_t)0x00000200)
#define RCC_APB2RSTR_TIM8RST_gp 9
#define RCC_APB2RSTR_USART1RST_gm ((uint32_t)0x00004000)
#define RCC_APB2RSTR_USART1RST_gp 14
#define RCC_APB2RSTR_TIM15RST_gm ((uint32_t)0x00010000)
#define RCC_APB2RSTR_TIM15RST_gp 16
#define RCC_APB2RSTR_TIM16RST_gm ((uint32_t)0x00020000)
#define RCC_APB2RSTR_TIM16RST_gp 17
#define RCC_APB2RSTR_TIM17RST_gm ((uint32_t)0x00040000)
#define RCC_APB2RSTR_TIM17RST_gp 18

/*** REGISTER: RCC_APB1RSTR ***/
#define RCC_APB1RSTR_TIM2RST_gm ((uint32_t)0x00000001)
#define RCC_APB1RSTR_TIM2RST_gp 0
#define RCC_APB1RSTR_TIM3RST_gm ((uint32_t)0x00000002)
#define RCC_APB1RSTR_TIM3RST_gp 1
#define RCC_APB1RSTR_TIM4RST_gm ((uint32_t)0x00000004)
#define RCC_APB1RSTR_TIM4RST_gp 2
#define RCC_APB1RSTR_TIM6RST_gm ((uint32_t)0x00000010)
#define RCC_APB1RSTR_TIM6RST_gp 4
#define RCC_APB1RSTR_TIM7RST_gm ((uint32_t)0x00000020)
#define RCC_APB1RSTR_TIM7RST_gp 5
#define RCC_APB1RSTR_WWDGRST_gm ((uint32_t)0x00000800)
#define RCC_APB1RSTR_WWDGRST_gp 11
#define RCC_APB1RSTR_SPI2RST_gm ((uint32_t)0x00004000)
#define RCC_APB1RSTR_SPI2RST_gp 14
#define RCC_APB1RSTR_SPI3RST_gm ((uint32_t)0x00008000)
#define RCC_APB1RSTR_SPI3RST_gp 15
#define RCC_APB1RSTR_USART2RST_gm ((uint32_t)0x00020000)
#define RCC_APB1RSTR_USART2RST_gp 17
#define RCC_APB1RSTR_USART3RST_gm ((uint32_t)0x00040000)
#define RCC_APB1RSTR_USART3RST_gp 18
#define RCC_APB1RSTR_UART4RST_gm ((uint32_t)0x00080000)
#define RCC_APB1RSTR_UART4RST_gp 19
#define RCC_APB1RSTR_UART5RST_gm ((uint32_t)0x00100000)
#define RCC_APB1RSTR_UART5RST_gp 20
#define RCC_APB1RSTR_I2C1RST_gm ((uint32_t)0x00200000)
#define RCC_APB1RSTR_I2C1RST_gp 21
#define RCC_APB1RSTR_I2C2RST_gm ((uint32_t)0x00400000)
#define RCC_APB1RSTR_I2C2RST_gp 22
#define RCC_APB1RSTR_USBRST_gm ((uint32_t)0x00800000)
#define RCC_APB1RSTR_USBRST_gp 23
#define RCC_APB1RSTR_CAN1RST_gm ((uint32_t)0x02000000)
#define RCC_APB1RSTR_CAN1RST_gp 25
#define RCC_APB1RSTR_PWRRST_gm ((uint32_t)0x10000000)
#define RCC_APB1RSTR_PWRRST_gp 28
#define RCC_APB1RSTR_DACRST_gm ((uint32_t)0x20000000)
#define RCC_APB1RSTR_DACRST_gp 29

/*** REGISTER: RCC_AHBENR ***/
#define RCC_AHBENR_DMA1EN_gm ((uint32_t)0x00000001)
#define RCC_AHBENR_DMA1EN_gp 0
#define RCC_AHBENR_DMA2EN_gm ((uint32_t)0x00000002)
#define RCC_AHBENR_DMA2EN_gp 1
#define RCC_AHBENR_SRAMEN_gm ((uint32_t)0x00000004)
#define RCC_AHBENR_SRAMEN_gp 2
#define RCC_AHBENR_FLITFEN_gm ((uint32_t)0x00000010)
#define RCC_AHBENR_FLITFEN_gp 4
#define RCC_AHBENR_CRCEN_gm ((uint32_t)0x00000040)
#define RCC_AHBENR_CRCEN_gp 6
#define RCC_AHBENR_GPIOAEN_gm ((uint32_t)0x00020000)
#define RCC_AHBENR_GPIOAEN_gp 17
#define RCC_AHBENR_GPIOBEN_gm ((uint32_t)0x00040000)
#define RCC_AHBENR_GPIOBEN_gp 18
#define RCC_AHBENR_GPIOCEN_gm ((uint32_t)0x00080000)
#define RCC_AHBENR_GPIOCEN_gp 19
#define RCC_AHBENR_GPIODEN_gm ((uint32_t)0x00100000)
#define RCC_AHBENR_GPIODEN_gp 20
#define RCC_AHBENR_GPIOEEN_gm ((uint32_t)0x00200000)
#define RCC_AHBENR_GPIOEEN_gp 21
#define RCC_AHBENR_GPIOFEN_gm ((uint32_t)0x00400000)
#define RCC_AHBENR_GPIOFEN_gp 22
#define RCC_AHBENR_TSEN_gm ((uint32_t)0x01000000)
#define RCC_AHBENR_TSEN_gp 24
#define RCC_AHBENR_ADC12EN_gm ((uint32_t)0x10000000)
#define RCC_AHBENR_ADC12EN_gp 28
#define RCC_AHBENR_ADC34EN_gm ((uint32_t)0x20000000)
#define RCC_AHBENR_ADC34EN_gp 29

/*** REGISTER: RCC_APB2ENR ***/
#define RCC_APB2ENR_SYSCFGEN_gm ((uint32_t)0x00000001)
#define RCC_APB2ENR_SYSCFGEN_gp 0
#define RCC_APB2ENR_TIM1EN_gm ((uint32_t)0x00000800)
#define RCC_APB2ENR_TIM1EN_gp 11
#define RCC_APB2ENR_SPI1EN_gm ((uint32_t)0x00001000)
#define RCC_APB2ENR_SPI1EN_gp 12
#define RCC_APB2ENR_TIM8EN_gm ((uint32_t)0x00002000)
#define RCC_APB2ENR_TIM8EN_gp 13
#define RCC_APB2ENR_USART1EN_gm ((uint32_t)0x00004000)
#define RCC_APB2ENR_USART1EN_gp 14
#define RCC_APB2ENR_TIM15EN_gm ((uint32_t)0x00010000)
#define RCC_APB2ENR_TIM15EN_gp 16
#define RCC_APB2ENR_TIM16EN_gm ((uint32_t)0x00020000)
#define RCC_APB2ENR_TIM16EN_gp 17
#define RCC_APB2ENR_TIM17EN_gm ((uint32_t)0x00040000)
#define RCC_APB2ENR_TIM17EN_gp 18

/*** REGISTER: RCC_APB1ENR ***/
#define RCC_APB1ENR_TIM2EN_gm ((uint32_t)0x00000001)
#define RCC_APB1ENR_TIM2EN_gp 0
#define RCC_APB1ENR_TIM3EN_gm ((uint32_t)0x00000002)
#define RCC_APB1ENR_TIM3EN_gp 1
#define RCC_APB1ENR_TIM4EN_gm ((uint32_t)0x00000004)
#define RCC_APB1ENR_TIM4EN_gp 2
#define RCC_APB1ENR_TIM6EN_gm ((uint32_t)0x00000010)
#define RCC_APB1ENR_TIM6EN_gp 4
#define RCC_APB1ENR_TIM7EN_gm ((uint32_t)0x00000020)
#define RCC_APB1ENR_TIM7EN_gp 5
#define RCC_APB1ENR_WWDGEN_gm ((uint32_t)0x00000800)
#define RCC_APB1ENR_WWDGEN_gp 11
#define RCC_APB1ENR_SPI2EN_gm ((uint32_t)0x00004000)
#define RCC_APB1ENR_SPI2EN_gp 14
#define RCC_APB1ENR_SPI3EN_gm ((uint32_t)0x00008000)
#define RCC_APB1ENR_SPI3EN_gp 15
#define RCC_APB1ENR_USART2EN_gm ((uint32_t)0x00020000)
#define RCC_APB1ENR_USART2EN_gp 17
#define RCC_APB1ENR_USART3EN_gm ((uint32_t)0x00040000)
#define RCC_APB1ENR_USART3EN_gp 18
#define RCC_APB1ENR_UART3EN_gm ((uint32_t)0x00080000)
#define RCC_APB1ENR_UART3EN_gp 19
#define RCC_APB1ENR_UART4EN_gm ((uint32_t)0x00100000)
#define RCC_APB1ENR_UART4EN_gp 20
#define RCC_APB1ENR_I2C1EN_gm ((uint32_t)0x00200000)
#define RCC_APB1ENR_I2C1EN_gp 21
#define RCC_APB1ENR_I2C2EN_gm ((uint32_t)0x00400000)
#define RCC_APB1ENR_I2C2EN_gp 22
#define RCC_APB1ENR_USBEN_gm ((uint32_t)0x00800000)
#define RCC_APB1ENR_USBEN_gp 23
#define RCC_APB1ENR_CAN1EN_gm ((uint32_t)0x02000000)
#define RCC_APB1ENR_CAN1EN_gp 25
#define RCC_APB1ENR_PWREN_gm ((uint32_t)0x10000000)
#define RCC_APB1ENR_PWREN_gp 28
#define RCC_APB1ENR_DACEN_gm ((uint32_t)0x20000000)
#define RCC_APB1ENR_DACEN_gp 29

