a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: RCC_BDCR ***/
#define RCC_BDCR_LSEON_gm ((uint32_t)0x00000001)
#define RCC_BDCR_LSEON_gp 0
#define RCC_BDCR_LSERDY_gm ((uint32_t)0x00000002)
#define RCC_BDCR_LSERDY_gp 1
#define RCC_BDCR_LSEBYP_gm ((uint32_t)0x00000004)
#define RCC_BDCR_LSEBYP_gp 2
#define RCC_BDCR_LSEDRV_gm ((uint32_t)0x00000018)
#define RCC_BDCR_LSEDRV_gp 3
#define RCC_BDCR_LSEDRV0_gm ((uint32_t)0x00000008)
#define RCC_BDCR_LSEDRV0_gp 3
#define RCC_BDCR_LSEDRV1_gm ((uint32_t)0x00000010)
#define RCC_BDCR_LSEDRV1_gp 4
#define RCC_BDCR_RTCSEL_gm ((uint32_t)0x00000300)
#define RCC_BDCR_RTCSEL_gp 8
#define RCC_BDCR_RTCSEL0_gm ((uint32_t)0x00000100)
#define RCC_BDCR_RTCSEL0_gp 8
#define RCC_BDCR_RTCSEL1_gm ((uint32_t)0x00000200)
#define RCC_BDCR_RTCSEL1_gp 9
#define RCC_BDCR_RTCSEL_NOCLOCK_gc ((uint32_t)0x00000000)
#define RCC_BDCR_RTCSEL_LSE_gc ((uint32_t)0x00000100)
#define RCC_BDCR_RTCSEL_LSI_gc ((uint32_t)0x00000200)
#define RCC_BDCR_RTCSEL_HSE_gc ((uint32_t)0x00000300)
#define RCC_BDCR_RTCEN_gm ((uint32_t)0x00008000)
#define RCC_BDCR_RTCEN_gp 15
#define RCC_BDCR_BDRST_gm ((uint32_t)0x00010000)
#define RCC_BDCR_BDRST_gp 16

/*** REGISTER: RCC_CSR ***/
#define RCC_CSR_LSION_gm ((uint32_t)0x00000001)
#define RCC_CSR_LSION_gp 0
#define RCC_CSR_LSIRDY_gm ((uint32_t)0x00000002)
#define RCC_CSR_LSIRDY_gp 1
#define RCC_CSR_RMVF_gm ((uint32_t)0x01000000)
#define RCC_CSR_RMVF_gp 24
#define RCC_CSR_OBLRSTF_gm ((uint32_t)0x02000000)
#define RCC_CSR_OBLRSTF_gp 25
#define RCC_CSR_PINRSTF_gm ((uint32_t)0x04000000)
#define RCC_CSR_PINRSTF_gp 26
#define RCC_CSR_PORRSTF_gm ((uint32_t)0x08000000)
#define RCC_CSR_PORRSTF_gp 27
#define RCC_CSR_SFTRSTF_gm ((uint32_t)0x10000000)
#define RCC_CSR_SFTRSTF_gp 28
#define RCC_CSR_IWDGRSTF_gm ((uint32_t)0x20000000)
#define RCC_CSR_IWDGRSTF_gp 29
#define RCC_CSR_WWDGRSTF_gm ((uint32_t)0x40000000)
#define RCC_CSR_WWDGRSTF_gp 30
#define RCC_CSR_LPWRRSTF_gm ((uint32_t)0x80000000)
#define RCC_CSR_LPWRRSTF_gp 31

/*** REGISTER: RCC_AHBRSTR ***/
#define RCC_AHBRSTR_GPIOARST_gm ((uint32_t)0x00020000)
#define RCC_AHBRSTR_GPIOARST_gp 17
#define RCC_AHBRSTR_GPIOBRST_gm ((uint32_t)0x00040000)
#define RCC_AHBRSTR_GPIOBRST_gp 18
#define RCC_AHBRSTR_GPIOCRST_gm ((uint32_t)0x00080000)
#define RCC_AHBRSTR_GPIOCRST_gp 19
#define RCC_AHBRSTR_GPIODRST_gm ((uint32_t)0x00010000)
#define RCC_AHBRSTR_GPIODRST_gp 16
#define RCC_AHBRSTR_GPIOFRST_gm ((uint32_t)0x00040000)
#define RCC_AHBRSTR_GPIOFRST_gp 18
#define RCC_AHBRSTR_TSRST_gm ((uint32_t)0x00100000)
#define RCC_AHBRSTR_TSRST_gp 20
#define RCC_AHBRSTR_ADC12RST_gm ((uint32_t)0x01000000)
#define RCC_AHBRSTR_ADC12RST_gp 24
#define RCC_AHBRSTR_ADC34RST_gm ((uint32_t)0x02000000)
#define RCC_AHBRSTR_ADC34RST_gp 25

/*** REGISTER: RCC_CFGR2 ***/
#define RCC_CFGR2_PREDIV1_gm ((uint32_t)0x0000000F)
#define RCC_CFGR2_PREDIV1_gp 0
#define RCC_CFGR2_PREDIV1_DIV1_gc ((uint32_t)0x00000000)
#define RCC_CFGR2_PREDIV1_DIV2_gc ((uint32_t)0x00000001)
#define RCC_CFGR2_PREDIV1_DIV3_gc ((uint32_t)0x00000002)
#define RCC_CFGR2_PREDIV1_DIV4_gc ((uint32_t)0x00000003)
#define RCC_CFGR2_PREDIV1_DIV5_gc ((uint32_t)0x00000004)
#define RCC_CFGR2_PREDIV1_DIV6_gc ((uint32_t)0x00000005)
#define RCC_CFGR2_PREDIV1_DIV7_gc ((uint32_t)0x00000006)
#define RCC_CFGR2_PREDIV1_DIV8_gc ((uint32_t)0x00000007)
#define RCC_CFGR2_PREDIV1_DIV9_gc ((uint32_t)0x00000008)
#define RCC_CFGR2_PREDIV1_DIV10_gc ((uint32_t)0x00000009)
#define RCC_CFGR2_PREDIV1_DIV11_gc ((uint32_t)0x0000000A)
#define RCC_CFGR2_PREDIV1_DIV12_gc ((uint32_t)0x0000000B)
#define RCC_CFGR2_PREDIV1_DIV13_gc ((uint32_t)0x0000000C)
#define RCC_CFGR2_PREDIV1_DIV14_gc ((uint32_t)0x0000000D)
#define RCC_CFGR2_PREDIV1_DIV15_gc ((uint32_t)0x0000000E)
#define RCC_CFGR2_PREDIV1_DIV16_gc ((uint32_t)0x0000000F)
#define RCC_CFGR2_ADCPRE12_gm ((uint32_t)0x000001F0)
#define RCC_CFGR2_ADCPRE12_gp 4
#define RCC_CFGR2_ADCPRE12_NO_gc ((uint32_t)0x00000000)
#define RCC_CFGR2_ADCPRE12_DIV1_gc ((uint32_t)0x00000100)
#define RCC_CFGR2_ADCPRE12_DIV2_gc ((uint32_t)0x00000110)
#define RCC_CFGR2_ADCPRE12_DIV4_gc ((uint32_t)0x00000120)
#define RCC_CFGR2_ADCPRE12_DIV6_gc ((uint32_t)0x00000130)
#define RCC_CFGR2_ADCPRE12_DIV8_gc ((uint32_t)0x00000140)
#define RCC_CFGR2_ADCPRE12_DIV10_gc ((uint32_t)0x00000150)
#define RCC_CFGR2_ADCPRE12_DIV12_gc ((uint32_t)0x00000160)
#define RCC_CFGR2_ADCPRE12_DIV16_gc ((uint32_t)0x00000170)
#define RCC_CFGR2_ADCPRE12_DIV32_gc ((uint32_t)0x00000180)
#define RCC_CFGR2_ADCPRE12_DIV64_gc ((uint32_t)0x00000190)
#define RCC_CFGR2_ADCPRE12_DIV128_gc ((uint32_t)0x000001A0)
#define RCC_CFGR2_ADCPRE12_DIV256_gc ((uint32_t)0x000001B0)
#define RCC_CFGR2_ADCPRE34_gm ((uint32_t)0x00003E00)
#define RCC_CFGR2_ADCPRE34_gp 9
#define RCC_CFGR2_ADCPRE34_NO_gc ((uint32_t)0x00000000)
#define RCC_CFGR2_ADCPRE34_DIV1_gc ((uint32_t)0x00002000)
#define RCC_CFGR2_ADCPRE34_DIV2_gc ((uint32_t)0x00002200)
#define RCC_CFGR2_ADCPRE34_DIV4_gc ((uint32_t)0x00002400)
#define RCC_CFGR2_ADCPRE34_DIV6_gc ((uint32_t)0x00002600)
#define RCC_CFGR2_ADCPRE34_DIV8_gc ((uint32_t)0x00002800)
#define RCC_CFGR2_ADCPRE34_DIV10_gc ((uint32_t)0x00002A00)
#define RCC_CFGR2_ADCPRE34_DIV12_gc ((uint32_t)0x00002C00)
#define RCC_CFGR2_ADCPRE34_DIV16_gc ((uint32_t)0x00002E00)
#define RCC_CFGR2_ADCPRE34_DIV32_gc ((uint32_t)0x00003000)
#define RCC_CFGR2_ADCPRE34_DIV64_gc ((uint32_t)0x00003200)
#define RCC_CFGR2_ADCPRE34_DIV128_gc ((uint32_t)0x00003400)
#define RCC_CFGR2_ADCPRE34_DIV256_gc ((uint32_t)0x00003600)

/*** REGISTER: RCC_CFGR3 ***/
#define RCC_CFGR3_USART1SW_gm ((uint32_t)0x00000003)
#define RCC_CFGR3_USART1SW_gp 0
#define RCC_CFGR3_USART1SW0_gm ((uint32_t)0x00000001)
#define RCC_CFGR3_USART1SW0_gp 0
#define RCC_CFGR3_USART1SW1_gm ((uint32_t)0x00000002)
#define RCC_CFGR3_USART1SW1_gp 1
#define RCC_CFGR3_I2CSW_gm ((uint32_t)0x00000030)
#define RCC_CFGR3_I2CSW_gp 4
#define RCC_CFGR3_I2C1SW_gm ((uint32_t)0x00000010)
#define RCC_CFGR3_I2C1SW_gp 4
#define RCC_CFGR3_I2C2SW_gm ((uint32_t)0x00000020)
#define RCC_CFGR3_I2C2SW_gp 5
#define RCC_CFGR3_TIMSW_gm ((uint32_t)0x00000300)
#define RCC_CFGR3_TIMSW_gp 8
#define RCC_CFGR3_TIM1SW_gm ((uint32_t)0x00000100)
#define RCC_CFGR3_TIM1SW_gp 8
#define RCC_CFGR3_TIM8SW_gm ((uint32_t)0x00000200)
#define RCC_CFGR3_TIM8SW_gp 9
#define RCC_CFGR3_USART2SW_gm ((uint32_t)0x00030000)
#define RCC_CFGR3_USART2SW_gp 16
#define RCC_CFGR3_USART2SW0_gm ((uint32_t)0x00010000)
#define RCC_CFGR3_USART2SW0_gp 16
#define RCC_CFGR3_USART2SW1_gm ((uint32_t)0x00020000)
#define RCC_CFGR3_USART2SW1_gp 17
#define RCC_CFGR3_USART3SW_gm ((uint32_t)0x000C0000)
#define RCC_CFGR3_USART3SW_gp 18
#define RCC_CFGR3_USART3SW0_gm ((uint32_t)0x00040000)
#define RCC_CFGR3_USART3SW0_gp 18
#define RCC_CFGR3_USART3SW1_gm ((uint32_t)0x00080000)
#define RCC_CFGR3_USART3SW1_gp 19
#define RCC_CFGR3_UART4SW_gm ((uint32_t)0x00300000)
#define RCC_CFGR3_UART4SW_gp 20
#define RCC_CFGR3_UART4SW0_gm ((uint32_t)0x00100000)
#define RCC_CFGR3_UART4SW0_gp 20
#define RCC_CFGR3_UART4SW1_gm ((uint32_t)0x00200000)
#define RCC_CFGR3_UART4SW1_gp 21
#define RCC_CFGR3_UART5SW_gm ((uint32_t)0x00C00000)
#define RCC_CFGR3_UART5SW_gp 22
#define RCC_CFGR3_UART5SW0_gm ((uint32_t)0x00400000)
#define RCC_CFGR3_UART5SW0_gp 22
#define RCC_CFGR3_UART5SW1_gm ((uint32_t)0x00800000)
#define RCC_CFGR3_UART5SW1_gp 23


/********** PERIPHERAL: RTC **********/

