a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: RTC_TR ***/
#define RTC_TR_PM_gm ((uint32_t)0x00400000)
#define RTC_TR_PM_gp 22
#define RTC_TR_HT_gm ((uint32_t)0x00300000)
#define RTC_TR_HT_gp 20
#define RTC_TR_HT0_gm ((uint32_t)0x00100000)
#define RTC_TR_HT0_gp 20
#define RTC_TR_HT1_gm ((uint32_t)0x00200000)
#define RTC_TR_HT1_gp 21
#define RTC_TR_HU_gm ((uint32_t)0x000F0000)
#define RTC_TR_HU_gp 16
#define RTC_TR_HU0_gm ((uint32_t)0x00010000)
#define RTC_TR_HU0_gp 16
#define RTC_TR_HU1_gm ((uint32_t)0x00020000)
#define RTC_TR_HU1_gp 17
#define RTC_TR_HU2_gm ((uint32_t)0x00040000)
#define RTC_TR_HU2_gp 18
#define RTC_TR_HU3_gm ((uint32_t)0x00080000)
#define RTC_TR_HU3_gp 19
#define RTC_TR_MNT_gm ((uint32_t)0x00007000)
#define RTC_TR_MNT_gp 12
#define RTC_TR_MNT0_gm ((uint32_t)0x00001000)
#define RTC_TR_MNT0_gp 12
#define RTC_TR_MNT1_gm ((uint32_t)0x00002000)
#define RTC_TR_MNT1_gp 13
#define RTC_TR_MNT2_gm ((uint32_t)0x00004000)
#define RTC_TR_MNT2_gp 14
#define RTC_TR_MNU_gm ((uint32_t)0x00000F00)
#define RTC_TR_MNU_gp 8
#define RTC_TR_MNU0_gm ((uint32_t)0x00000100)
#define RTC_TR_MNU0_gp 8
#define RTC_TR_MNU1_gm ((uint32_t)0x00000200)
#define RTC_TR_MNU1_gp 9
#define RTC_TR_MNU2_gm ((uint32_t)0x00000400)
#define RTC_TR_MNU2_gp 10
#define RTC_TR_MNU3_gm ((uint32_t)0x00000800)
#define RTC_TR_MNU3_gp 11
#define RTC_TR_ST_gm ((uint32_t)0x00000070)
#define RTC_TR_ST_gp 4
#define RTC_TR_ST0_gm ((uint32_t)0x00000010)
#define RTC_TR_ST0_gp 4
#define RTC_TR_ST1_gm ((uint32_t)0x00000020)
#define RTC_TR_ST1_gp 5
#define RTC_TR_ST2_gm ((uint32_t)0x00000040)
#define RTC_TR_ST2_gp 6
#define RTC_TR_SU_gm ((uint32_t)0x0000000F)
#define RTC_TR_SU_gp 0
#define RTC_TR_SU0_gm ((uint32_t)0x00000001)
#define RTC_TR_SU0_gp 0
#define RTC_TR_SU1_gm ((uint32_t)0x00000002)
#define RTC_TR_SU1_gp 1
#define RTC_TR_SU2_gm ((uint32_t)0x00000004)
#define RTC_TR_SU2_gp 2
#define RTC_TR_SU3_gm ((uint32_t)0x00000008)
#define RTC_TR_SU3_gp 3

/*** REGISTER: RTC_DR ***/
#define RTC_DR_YT_gm ((uint32_t)0x00F00000)
#define RTC_DR_YT_gp 20
#define RTC_DR_YT0_gm ((uint32_t)0x00100000)
#define RTC_DR_YT0_gp 20
#define RTC_DR_YT1_gm ((uint32_t)0x00200000)
#define RTC_DR_YT1_gp 21
#define RTC_DR_YT2_gm ((uint32_t)0x00400000)
#define RTC_DR_YT2_gp 22
#define RTC_DR_YT3_gm ((uint32_t)0x00800000)
#define RTC_DR_YT3_gp 23
#define RTC_DR_YU_gm ((uint32_t)0x000F0000)
#define RTC_DR_YU_gp 16
#define RTC_DR_YU0_gm ((uint32_t)0x00010000)
#define RTC_DR_YU0_gp 16
#define RTC_DR_YU1_gm ((uint32_t)0x00020000)
#define RTC_DR_YU1_gp 17
#define RTC_DR_YU2_gm ((uint32_t)0x00040000)
#define RTC_DR_YU2_gp 18
#define RTC_DR_YU3_gm ((uint32_t)0x00080000)
#define RTC_DR_YU3_gp 19
#define RTC_DR_WDU_gm ((uint32_t)0x0000E000)
#define RTC_DR_WDU_gp 13
#define RTC_DR_WDU0_gm ((uint32_t)0x00002000)
#define RTC_DR_WDU0_gp 13
#define RTC_DR_WDU1_gm ((uint32_t)0x00004000)
#define RTC_DR_WDU1_gp 14
#define RTC_DR_WDU2_gm ((uint32_t)0x00008000)
#define RTC_DR_WDU2_gp 15
#define RTC_DR_MT_gm ((uint32_t)0x00001000)
#define RTC_DR_MT_gp 12
#define RTC_DR_MU_gm ((uint32_t)0x00000F00)
#define RTC_DR_MU_gp 8
#define RTC_DR_MU0_gm ((uint32_t)0x00000100)
#define RTC_DR_MU0_gp 8
#define RTC_DR_MU1_gm ((uint32_t)0x00000200)
#define RTC_DR_MU1_gp 9
#define RTC_DR_MU2_gm ((uint32_t)0x00000400)
#define RTC_DR_MU2_gp 10
#define RTC_DR_MU3_gm ((uint32_t)0x00000800)
#define RTC_DR_MU3_gp 11
#define RTC_DR_DT_gm ((uint32_t)0x00000030)
#define RTC_DR_DT_gp 4
#define RTC_DR_DT0_gm ((uint32_t)0x00000010)
#define RTC_DR_DT0_gp 4
#define RTC_DR_DT1_gm ((uint32_t)0x00000020)
#define RTC_DR_DT1_gp 5
#define RTC_DR_DU_gm ((uint32_t)0x0000000F)
#define RTC_DR_DU_gp 0
#define RTC_DR_DU0_gm ((uint32_t)0x00000001)
#define RTC_DR_DU0_gp 0
#define RTC_DR_DU1_gm ((uint32_t)0x00000002)
#define RTC_DR_DU1_gp 1
#define RTC_DR_DU2_gm ((uint32_t)0x00000004)
#define RTC_DR_DU2_gp 2
#define RTC_DR_DU3_gm ((uint32_t)0x00000008)
#define RTC_DR_DU3_gp 3

/*** REGISTER: RTC_CR ***/
#define RTC_CR_COE_gm ((uint32_t)0x00800000)
#define RTC_CR_COE_gp 23
#define RTC_CR_OSEL_gm ((uint32_t)0x00600000)
#define RTC_CR_OSEL_gp 21
#define RTC_CR_OSEL0_gm ((uint32_t)0x00200000)
#define RTC_CR_OSEL0_gp 21
#define RTC_CR_OSEL1_gm ((uint32_t)0x00400000)
#define RTC_CR_OSEL1_gp 22
#define RTC_CR_POL_gm ((uint32_t)0x00100000)
#define RTC_CR_POL_gp 20
#define RTC_CR_COSEL_gm ((uint32_t)0x00080000)
#define RTC_CR_COSEL_gp 19
#define RTC_CR_BCK_gm ((uint32_t)0x00040000)
#define RTC_CR_BCK_gp 18
#define RTC_CR_SUB1H_gm ((uint32_t)0x00020000)
#define RTC_CR_SUB1H_gp 17
#define RTC_CR_ADD1H_gm ((uint32_t)0x00010000)
#define RTC_CR_ADD1H_gp 16
#define RTC_CR_TSIE_gm ((uint32_t)0x00008000)
#define RTC_CR_TSIE_gp 15
#define RTC_CR_WUTIE_gm ((uint32_t)0x00004000)
#define RTC_CR_WUTIE_gp 14
#define RTC_CR_ALRBIE_gm ((uint32_t)0x00002000)
#define RTC_CR_ALRBIE_gp 13
#define RTC_CR_ALRAIE_gm ((uint32_t)0x00001000)
#define RTC_CR_ALRAIE_gp 12
#define RTC_CR_TSE_gm ((uint32_t)0x00000800)
#define RTC_CR_TSE_gp 11
#define RTC_CR_WUTE_gm ((uint32_t)0x00000400)
#define RTC_CR_WUTE_gp 10
#define RTC_CR_ALRBE_gm ((uint32_t)0x00000200)
#define RTC_CR_ALRBE_gp 9
#define RTC_CR_ALRAE_gm ((uint32_t)0x00000100)
#define RTC_CR_ALRAE_gp 8
#define RTC_CR_FMT_gm ((uint32_t)0x00000040)
#define RTC_CR_FMT_gp 6
#define RTC_CR_BYPSHAD_gm ((uint32_t)0x00000020)
#define RTC_CR_BYPSHAD_gp 5
#define RTC_CR_REFCKON_gm ((uint32_t)0x00000010)
#define RTC_CR_REFCKON_gp 4
#define RTC_CR_TSEDGE_gm ((uint32_t)0x00000008)
#define RTC_CR_TSEDGE_gp 3
#define RTC_CR_WUCKSEL_gm ((uint32_t)0x00000007)
#define RTC_CR_WUCKSEL_gp 0
#define RTC_CR_WUCKSEL0_gm ((uint32_t)0x00000001)
#define RTC_CR_WUCKSEL0_gp 0
#define RTC_CR_WUCKSEL1_gm ((uint32_t)0x00000002)
#define RTC_CR_WUCKSEL1_gp 1
#define RTC_CR_WUCKSEL2_gm ((uint32_t)0x00000004)
#define RTC_CR_WUCKSEL2_gp 2

/*** REGISTER: RTC_ISR ***/
#define RTC_ISR_RECALPF_gm ((uint32_t)0x00010000)
#define RTC_ISR_RECALPF_gp 16
#define RTC_ISR_TAMP3F_gm ((uint32_t)0x00008000)
#define RTC_ISR_TAMP3F_gp 15
#define RTC_ISR_TAMP2F_gm ((uint32_t)0x00004000)
#define RTC_ISR_TAMP2F_gp 14
#define RTC_ISR_TAMP1F_gm ((uint32_t)0x00002000)
#define RTC_ISR_TAMP1F_gp 13
#define RTC_ISR_TSOVF_gm ((uint32_t)0x00001000)
#define RTC_ISR_TSOVF_gp 12
#define RTC_ISR_TSF_gm ((uint32_t)0x00000800)
#define RTC_ISR_TSF_gp 11
#define RTC_ISR_WUTF_gm ((uint32_t)0x00000400)
#define RTC_ISR_WUTF_gp 10
#define RTC_ISR_ALRBF_gm ((uint32_t)0x00000200)
#define RTC_ISR_ALRBF_gp 9
#define RTC_ISR_ALRAF_gm ((uint32_t)0x00000100)
#define RTC_ISR_ALRAF_gp 8
#define RTC_ISR_INIT_gm ((uint32_t)0x00000080)
#define RTC_ISR_INIT_gp 7
#define RTC_ISR_INITF_gm ((uint32_t)0x00000040)
#define RTC_ISR_INITF_gp 6
#define RTC_ISR_RSF_gm ((uint32_t)0x00000020)
#define RTC_ISR_RSF_gp 5
#define RTC_ISR_INITS_gm ((uint32_t)0x00000010)
#define RTC_ISR_INITS_gp 4
#define RTC_ISR_SHPF_gm ((uint32_t)0x00000008)
#define RTC_ISR_SHPF_gp 3
#define RTC_ISR_WUTWF_gm ((uint32_t)0x00000004)
#define RTC_ISR_WUTWF_gp 2
#define RTC_ISR_ALRBWF_gm ((uint32_t)0x00000002)
#define RTC_ISR_ALRBWF_gp 1
#define RTC_ISR_ALRAWF_gm ((uint32_t)0x00000001)
#define RTC_ISR_ALRAWF_gp 0

/*** REGISTER: RTC_PRER ***/
#define RTC_PRER_PREDIV_A_gm ((uint32_t)0x007F0000)
#define RTC_PRER_PREDIV_A_gp 16
#define RTC_PRER_PREDIV_S_gm ((uint32_t)0x00007FFF)
#define RTC_PRER_PREDIV_S_gp 0

