a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: RTC_WUTR ***/
#define RTC_WUTR_WUT_gm ((uint32_t)0x0000FFFF)
#define RTC_WUTR_WUT_gp 0

/*** REGISTER: RTC_ALRMAR ***/
#define RTC_ALRMAR_MSK4_gm ((uint32_t)0x80000000)
#define RTC_ALRMAR_MSK4_gp 31
#define RTC_ALRMAR_WDSEL_gm ((uint32_t)0x40000000)
#define RTC_ALRMAR_WDSEL_gp 30
#define RTC_ALRMAR_DT_gm ((uint32_t)0x30000000)
#define RTC_ALRMAR_DT_gp 28
#define RTC_ALRMAR_DT0_gm ((uint32_t)0x10000000)
#define RTC_ALRMAR_DT0_gp 28
#define RTC_ALRMAR_DT1_gm ((uint32_t)0x20000000)
#define RTC_ALRMAR_DT1_gp 29
#define RTC_ALRMAR_DU_gm ((uint32_t)0x0F000000)
#define RTC_ALRMAR_DU_gp 24
#define RTC_ALRMAR_DU0_gm ((uint32_t)0x01000000)
#define RTC_ALRMAR_DU0_gp 24
#define RTC_ALRMAR_DU1_gm ((uint32_t)0x02000000)
#define RTC_ALRMAR_DU1_gp 25
#define RTC_ALRMAR_DU2_gm ((uint32_t)0x04000000)
#define RTC_ALRMAR_DU2_gp 26
#define RTC_ALRMAR_DU3_gm ((uint32_t)0x08000000)
#define RTC_ALRMAR_DU3_gp 27
#define RTC_ALRMAR_MSK3_gm ((uint32_t)0x00800000)
#define RTC_ALRMAR_MSK3_gp 23
#define RTC_ALRMAR_PM_gm ((uint32_t)0x00400000)
#define RTC_ALRMAR_PM_gp 22
#define RTC_ALRMAR_HT_gm ((uint32_t)0x00300000)
#define RTC_ALRMAR_HT_gp 20
#define RTC_ALRMAR_HT0_gm ((uint32_t)0x00100000)
#define RTC_ALRMAR_HT0_gp 20
#define RTC_ALRMAR_HT1_gm ((uint32_t)0x00200000)
#define RTC_ALRMAR_HT1_gp 21
#define RTC_ALRMAR_HU_gm ((uint32_t)0x000F0000)
#define RTC_ALRMAR_HU_gp 16
#define RTC_ALRMAR_HU0_gm ((uint32_t)0x00010000)
#define RTC_ALRMAR_HU0_gp 16
#define RTC_ALRMAR_HU1_gm ((uint32_t)0x00020000)
#define RTC_ALRMAR_HU1_gp 17
#define RTC_ALRMAR_HU2_gm ((uint32_t)0x00040000)
#define RTC_ALRMAR_HU2_gp 18
#define RTC_ALRMAR_HU3_gm ((uint32_t)0x00080000)
#define RTC_ALRMAR_HU3_gp 19
#define RTC_ALRMAR_MSK2_gm ((uint32_t)0x00008000)
#define RTC_ALRMAR_MSK2_gp 15
#define RTC_ALRMAR_MNT_gm ((uint32_t)0x00007000)
#define RTC_ALRMAR_MNT_gp 12
#define RTC_ALRMAR_MNT0_gm ((uint32_t)0x00001000)
#define RTC_ALRMAR_MNT0_gp 12
#define RTC_ALRMAR_MNT1_gm ((uint32_t)0x00002000)
#define RTC_ALRMAR_MNT1_gp 13
#define RTC_ALRMAR_MNT2_gm ((uint32_t)0x00004000)
#define RTC_ALRMAR_MNT2_gp 14
#define RTC_ALRMAR_MNU_gm ((uint32_t)0x00000F00)
#define RTC_ALRMAR_MNU_gp 8
#define RTC_ALRMAR_MNU0_gm ((uint32_t)0x00000100)
#define RTC_ALRMAR_MNU0_gp 8
#define RTC_ALRMAR_MNU1_gm ((uint32_t)0x00000200)
#define RTC_ALRMAR_MNU1_gp 9
#define RTC_ALRMAR_MNU2_gm ((uint32_t)0x00000400)
#define RTC_ALRMAR_MNU2_gp 10
#define RTC_ALRMAR_MNU3_gm ((uint32_t)0x00000800)
#define RTC_ALRMAR_MNU3_gp 11
#define RTC_ALRMAR_MSK1_gm ((uint32_t)0x00000080)
#define RTC_ALRMAR_MSK1_gp 7
#define RTC_ALRMAR_ST_gm ((uint32_t)0x00000070)
#define RTC_ALRMAR_ST_gp 4
#define RTC_ALRMAR_ST0_gm ((uint32_t)0x00000010)
#define RTC_ALRMAR_ST0_gp 4
#define RTC_ALRMAR_ST1_gm ((uint32_t)0x00000020)
#define RTC_ALRMAR_ST1_gp 5
#define RTC_ALRMAR_ST2_gm ((uint32_t)0x00000040)
#define RTC_ALRMAR_ST2_gp 6
#define RTC_ALRMAR_SU_gm ((uint32_t)0x0000000F)
#define RTC_ALRMAR_SU_gp 0
#define RTC_ALRMAR_SU0_gm ((uint32_t)0x00000001)
#define RTC_ALRMAR_SU0_gp 0
#define RTC_ALRMAR_SU1_gm ((uint32_t)0x00000002)
#define RTC_ALRMAR_SU1_gp 1
#define RTC_ALRMAR_SU2_gm ((uint32_t)0x00000004)
#define RTC_ALRMAR_SU2_gp 2
#define RTC_ALRMAR_SU3_gm ((uint32_t)0x00000008)
#define RTC_ALRMAR_SU3_gp 3

/*** REGISTER: RTC_ALRMBR ***/
#define RTC_ALRMBR_MSK4_gm ((uint32_t)0x80000000)
#define RTC_ALRMBR_MSK4_gp 31
#define RTC_ALRMBR_WDSEL_gm ((uint32_t)0x40000000)
#define RTC_ALRMBR_WDSEL_gp 30
#define RTC_ALRMBR_DT_gm ((uint32_t)0x30000000)
#define RTC_ALRMBR_DT_gp 28
#define RTC_ALRMBR_DT0_gm ((uint32_t)0x10000000)
#define RTC_ALRMBR_DT0_gp 28
#define RTC_ALRMBR_DT1_gm ((uint32_t)0x20000000)
#define RTC_ALRMBR_DT1_gp 29
#define RTC_ALRMBR_DU_gm ((uint32_t)0x0F000000)
#define RTC_ALRMBR_DU_gp 24
#define RTC_ALRMBR_DU0_gm ((uint32_t)0x01000000)
#define RTC_ALRMBR_DU0_gp 24
#define RTC_ALRMBR_DU1_gm ((uint32_t)0x02000000)
#define RTC_ALRMBR_DU1_gp 25
#define RTC_ALRMBR_DU2_gm ((uint32_t)0x04000000)
#define RTC_ALRMBR_DU2_gp 26
#define RTC_ALRMBR_DU3_gm ((uint32_t)0x08000000)
#define RTC_ALRMBR_DU3_gp 27
#define RTC_ALRMBR_MSK3_gm ((uint32_t)0x00800000)
#define RTC_ALRMBR_MSK3_gp 23
#define RTC_ALRMBR_PM_gm ((uint32_t)0x00400000)
#define RTC_ALRMBR_PM_gp 22
#define RTC_ALRMBR_HT_gm ((uint32_t)0x00300000)
#define RTC_ALRMBR_HT_gp 20
#define RTC_ALRMBR_HT0_gm ((uint32_t)0x00100000)
#define RTC_ALRMBR_HT0_gp 20
#define RTC_ALRMBR_HT1_gm ((uint32_t)0x00200000)
#define RTC_ALRMBR_HT1_gp 21
#define RTC_ALRMBR_HU_gm ((uint32_t)0x000F0000)
#define RTC_ALRMBR_HU_gp 16
#define RTC_ALRMBR_HU0_gm ((uint32_t)0x00010000)
#define RTC_ALRMBR_HU0_gp 16
#define RTC_ALRMBR_HU1_gm ((uint32_t)0x00020000)
#define RTC_ALRMBR_HU1_gp 17
#define RTC_ALRMBR_HU2_gm ((uint32_t)0x00040000)
#define RTC_ALRMBR_HU2_gp 18
#define RTC_ALRMBR_HU3_gm ((uint32_t)0x00080000)
#define RTC_ALRMBR_HU3_gp 19
#define RTC_ALRMBR_MSK2_gm ((uint32_t)0x00008000)
#define RTC_ALRMBR_MSK2_gp 15
#define RTC_ALRMBR_MNT_gm ((uint32_t)0x00007000)
#define RTC_ALRMBR_MNT_gp 12
#define RTC_ALRMBR_MNT0_gm ((uint32_t)0x00001000)
#define RTC_ALRMBR_MNT0_gp 12
#define RTC_ALRMBR_MNT1_gm ((uint32_t)0x00002000)
#define RTC_ALRMBR_MNT1_gp 13
#define RTC_ALRMBR_MNT2_gm ((uint32_t)0x00004000)
#define RTC_ALRMBR_MNT2_gp 14
#define RTC_ALRMBR_MNU_gm ((uint32_t)0x00000F00)
#define RTC_ALRMBR_MNU_gp 8
#define RTC_ALRMBR_MNU0_gm ((uint32_t)0x00000100)
#define RTC_ALRMBR_MNU0_gp 8
#define RTC_ALRMBR_MNU1_gm ((uint32_t)0x00000200)
#define RTC_ALRMBR_MNU1_gp 9
#define RTC_ALRMBR_MNU2_gm ((uint32_t)0x00000400)
#define RTC_ALRMBR_MNU2_gp 10
#define RTC_ALRMBR_MNU3_gm ((uint32_t)0x00000800)
#define RTC_ALRMBR_MNU3_gp 11
#define RTC_ALRMBR_MSK1_gm ((uint32_t)0x00000080)
#define RTC_ALRMBR_MSK1_gp 7
#define RTC_ALRMBR_ST_gm ((uint32_t)0x00000070)
#define RTC_ALRMBR_ST_gp 4
#define RTC_ALRMBR_ST0_gm ((uint32_t)0x00000010)
#define RTC_ALRMBR_ST0_gp 4
#define RTC_ALRMBR_ST1_gm ((uint32_t)0x00000020)
#define RTC_ALRMBR_ST1_gp 5
#define RTC_ALRMBR_ST2_gm ((uint32_t)0x00000040)
#define RTC_ALRMBR_ST2_gp 6
#define RTC_ALRMBR_SU_gm ((uint32_t)0x0000000F)
#define RTC_ALRMBR_SU_gp 0
#define RTC_ALRMBR_SU0_gm ((uint32_t)0x00000001)
#define RTC_ALRMBR_SU0_gp 0
#define RTC_ALRMBR_SU1_gm ((uint32_t)0x00000002)
#define RTC_ALRMBR_SU1_gp 1
#define RTC_ALRMBR_SU2_gm ((uint32_t)0x00000004)
#define RTC_ALRMBR_SU2_gp 2
#define RTC_ALRMBR_SU3_gm ((uint32_t)0x00000008)
#define RTC_ALRMBR_SU3_gp 3

/*** REGISTER: RTC_WPR ***/
#define RTC_WPR_KEY_gm ((uint32_t)0x000000FF)
#define RTC_WPR_KEY_gp 0

/*** REGISTER: RTC_SSR ***/
#define RTC_SSR_SS_gm ((uint32_t)0x0000FFFF)
#define RTC_SSR_SS_gp 0

/*** REGISTER: RTC_SHIFTR ***/
#define RTC_SHIFTR_SUBFS_gm ((uint32_t)0x00007FFF)
#define RTC_SHIFTR_SUBFS_gp 0
#define RTC_SHIFTR_ADD1S_gm ((uint32_t)0x80000000)
#define RTC_SHIFTR_ADD1S_gp 31

/*** REGISTER: RTC_TSTR ***/
#define RTC_TSTR_PM_gm ((uint32_t)0x00400000)
#define RTC_TSTR_PM_gp 22
#define RTC_TSTR_HT_gm ((uint32_t)0x00300000)
#define RTC_TSTR_HT_gp 20
#define RTC_TSTR_HT0_gm ((uint32_t)0x00100000)
#define RTC_TSTR_HT0_gp 20
#define RTC_TSTR_HT1_gm ((uint32_t)0x00200000)
#define RTC_TSTR_HT1_gp 21
#define RTC_TSTR_HU_gm ((uint32_t)0x000F0000)
#define RTC_TSTR_HU_gp 16
#define RTC_TSTR_HU0_gm ((uint32_t)0x00010000)
#define RTC_TSTR_HU0_gp 16
#define RTC_TSTR_HU1_gm ((uint32_t)0x00020000)
#define RTC_TSTR_HU1_gp 17
#define RTC_TSTR_HU2_gm ((uint32_t)0x00040000)
#define RTC_TSTR_HU2_gp 18
#define RTC_TSTR_HU3_gm ((uint32_t)0x00080000)
#define RTC_TSTR_HU3_gp 19
#define RTC_TSTR_MNT_gm ((uint32_t)0x00007000)
#define RTC_TSTR_MNT_gp 12
#define RTC_TSTR_MNT0_gm ((uint32_t)0x00001000)
#define RTC_TSTR_MNT0_gp 12
#define RTC_TSTR_MNT1_gm ((uint32_t)0x00002000)
#define RTC_TSTR_MNT1_gp 13
#define RTC_TSTR_MNT2_gm ((uint32_t)0x00004000)
#define RTC_TSTR_MNT2_gp 14
#define RTC_TSTR_MNU_gm ((uint32_t)0x00000F00)
#define RTC_TSTR_MNU_gp 8
#define RTC_TSTR_MNU0_gm ((uint32_t)0x00000100)
#define RTC_TSTR_MNU0_gp 8
#define RTC_TSTR_MNU1_gm ((uint32_t)0x00000200)
#define RTC_TSTR_MNU1_gp 9
#define RTC_TSTR_MNU2_gm ((uint32_t)0x00000400)
#define RTC_TSTR_MNU2_gp 10
#define RTC_TSTR_MNU3_gm ((uint32_t)0x00000800)
#define RTC_TSTR_MNU3_gp 11
#define RTC_TSTR_ST_gm ((uint32_t)0x00000070)
#define RTC_TSTR_ST_gp 4
#define RTC_TSTR_ST0_gm ((uint32_t)0x00000010)
#define RTC_TSTR_ST0_gp 4
#define RTC_TSTR_ST1_gm ((uint32_t)0x00000020)
#define RTC_TSTR_ST1_gp 5
#define RTC_TSTR_ST2_gm ((uint32_t)0x00000040)
#define RTC_TSTR_ST2_gp 6
#define RTC_TSTR_SU_gm ((uint32_t)0x0000000F)
#define RTC_TSTR_SU_gp 0
#define RTC_TSTR_SU0_gm ((uint32_t)0x00000001)
#define RTC_TSTR_SU0_gp 0
#define RTC_TSTR_SU1_gm ((uint32_t)0x00000002)
#define RTC_TSTR_SU1_gp 1
#define RTC_TSTR_SU2_gm ((uint32_t)0x00000004)
#define RTC_TSTR_SU2_gp 2
#define RTC_TSTR_SU3_gm ((uint32_t)0x00000008)
#define RTC_TSTR_SU3_gp 3

