a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: RTC_TSDR ***/
#define RTC_TSDR_WDU_gm ((uint32_t)0x0000E000)
#define RTC_TSDR_WDU_gp 13
#define RTC_TSDR_WDU0_gm ((uint32_t)0x00002000)
#define RTC_TSDR_WDU0_gp 13
#define RTC_TSDR_WDU1_gm ((uint32_t)0x00004000)
#define RTC_TSDR_WDU1_gp 14
#define RTC_TSDR_WDU2_gm ((uint32_t)0x00008000)
#define RTC_TSDR_WDU2_gp 15
#define RTC_TSDR_MT_gm ((uint32_t)0x00001000)
#define RTC_TSDR_MT_gp 12
#define RTC_TSDR_MU_gm ((uint32_t)0x00000F00)
#define RTC_TSDR_MU_gp 8
#define RTC_TSDR_MU0_gm ((uint32_t)0x00000100)
#define RTC_TSDR_MU0_gp 8
#define RTC_TSDR_MU1_gm ((uint32_t)0x00000200)
#define RTC_TSDR_MU1_gp 9
#define RTC_TSDR_MU2_gm ((uint32_t)0x00000400)
#define RTC_TSDR_MU2_gp 10
#define RTC_TSDR_MU3_gm ((uint32_t)0x00000800)
#define RTC_TSDR_MU3_gp 11
#define RTC_TSDR_DT_gm ((uint32_t)0x00000030)
#define RTC_TSDR_DT_gp 4
#define RTC_TSDR_DT0_gm ((uint32_t)0x00000010)
#define RTC_TSDR_DT0_gp 4
#define RTC_TSDR_DT1_gm ((uint32_t)0x00000020)
#define RTC_TSDR_DT1_gp 5
#define RTC_TSDR_DU_gm ((uint32_t)0x0000000F)
#define RTC_TSDR_DU_gp 0
#define RTC_TSDR_DU0_gm ((uint32_t)0x00000001)
#define RTC_TSDR_DU0_gp 0
#define RTC_TSDR_DU1_gm ((uint32_t)0x00000002)
#define RTC_TSDR_DU1_gp 1
#define RTC_TSDR_DU2_gm ((uint32_t)0x00000004)
#define RTC_TSDR_DU2_gp 2
#define RTC_TSDR_DU3_gm ((uint32_t)0x00000008)
#define RTC_TSDR_DU3_gp 3

/*** REGISTER: RTC_TSSSR ***/
#define RTC_TSSSR_SS_gm ((uint32_t)0x0000FFFF)
#define RTC_TSSSR_SS_gp 0

/*** REGISTER: RTC_CALR ***/
#define RTC_CALR_CALP_gm ((uint32_t)0x00008000)
#define RTC_CALR_CALP_gp 15
#define RTC_CALR_CALW8_gm ((uint32_t)0x00004000)
#define RTC_CALR_CALW8_gp 14
#define RTC_CALR_CALW16_gm ((uint32_t)0x00002000)
#define RTC_CALR_CALW16_gp 13
#define RTC_CALR_CALM_gm ((uint32_t)0x000001FF)
#define RTC_CALR_CALM_gp 0
#define RTC_CALR_CALM0_gm ((uint32_t)0x00000001)
#define RTC_CALR_CALM0_gp 0
#define RTC_CALR_CALM1_gm ((uint32_t)0x00000002)
#define RTC_CALR_CALM1_gp 1
#define RTC_CALR_CALM2_gm ((uint32_t)0x00000004)
#define RTC_CALR_CALM2_gp 2
#define RTC_CALR_CALM3_gm ((uint32_t)0x00000008)
#define RTC_CALR_CALM3_gp 3
#define RTC_CALR_CALM4_gm ((uint32_t)0x00000010)
#define RTC_CALR_CALM4_gp 4
#define RTC_CALR_CALM5_gm ((uint32_t)0x00000020)
#define RTC_CALR_CALM5_gp 5
#define RTC_CALR_CALM6_gm ((uint32_t)0x00000040)
#define RTC_CALR_CALM6_gp 6
#define RTC_CALR_CALM7_gm ((uint32_t)0x00000080)
#define RTC_CALR_CALM7_gp 7
#define RTC_CALR_CALM8_gm ((uint32_t)0x00000100)
#define RTC_CALR_CALM8_gp 8

/*** REGISTER: RTC_TAFCR ***/
#define RTC_TAFCR_ALARMOUTTYPE_gm ((uint32_t)0x00040000)
#define RTC_TAFCR_ALARMOUTTYPE_gp 18
#define RTC_TAFCR_TAMPPUDIS_gm ((uint32_t)0x00008000)
#define RTC_TAFCR_TAMPPUDIS_gp 15
#define RTC_TAFCR_TAMPPRCH_gm ((uint32_t)0x00006000)
#define RTC_TAFCR_TAMPPRCH_gp 13
#define RTC_TAFCR_TAMPPRCH0_gm ((uint32_t)0x00002000)
#define RTC_TAFCR_TAMPPRCH0_gp 13
#define RTC_TAFCR_TAMPPRCH1_gm ((uint32_t)0x00004000)
#define RTC_TAFCR_TAMPPRCH1_gp 14
#define RTC_TAFCR_TAMPFLT_gm ((uint32_t)0x00001800)
#define RTC_TAFCR_TAMPFLT_gp 11
#define RTC_TAFCR_TAMPFLT0_gm ((uint32_t)0x00000800)
#define RTC_TAFCR_TAMPFLT0_gp 11
#define RTC_TAFCR_TAMPFLT1_gm ((uint32_t)0x00001000)
#define RTC_TAFCR_TAMPFLT1_gp 12
#define RTC_TAFCR_TAMPFREQ_gm ((uint32_t)0x00000700)
#define RTC_TAFCR_TAMPFREQ_gp 8
#define RTC_TAFCR_TAMPFREQ0_gm ((uint32_t)0x00000100)
#define RTC_TAFCR_TAMPFREQ0_gp 8
#define RTC_TAFCR_TAMPFREQ1_gm ((uint32_t)0x00000200)
#define RTC_TAFCR_TAMPFREQ1_gp 9
#define RTC_TAFCR_TAMPFREQ2_gm ((uint32_t)0x00000400)
#define RTC_TAFCR_TAMPFREQ2_gp 10
#define RTC_TAFCR_TAMPTS_gm ((uint32_t)0x00000080)
#define RTC_TAFCR_TAMPTS_gp 7
#define RTC_TAFCR_TAMP3TRG_gm ((uint32_t)0x00000040)
#define RTC_TAFCR_TAMP3TRG_gp 6
#define RTC_TAFCR_TAMP3E_gm ((uint32_t)0x00000020)
#define RTC_TAFCR_TAMP3E_gp 5
#define RTC_TAFCR_TAMP2TRG_gm ((uint32_t)0x00000010)
#define RTC_TAFCR_TAMP2TRG_gp 4
#define RTC_TAFCR_TAMP2E_gm ((uint32_t)0x00000008)
#define RTC_TAFCR_TAMP2E_gp 3
#define RTC_TAFCR_TAMPIE_gm ((uint32_t)0x00000004)
#define RTC_TAFCR_TAMPIE_gp 2
#define RTC_TAFCR_TAMP1TRG_gm ((uint32_t)0x00000002)
#define RTC_TAFCR_TAMP1TRG_gp 1
#define RTC_TAFCR_TAMP1E_gm ((uint32_t)0x00000001)
#define RTC_TAFCR_TAMP1E_gp 0

/*** REGISTER: RTC_ALRMASSR ***/
#define RTC_ALRMASSR_MASKSS_gm ((uint32_t)0x0F000000)
#define RTC_ALRMASSR_MASKSS_gp 24
#define RTC_ALRMASSR_MASKSS0_gm ((uint32_t)0x01000000)
#define RTC_ALRMASSR_MASKSS0_gp 24
#define RTC_ALRMASSR_MASKSS1_gm ((uint32_t)0x02000000)
#define RTC_ALRMASSR_MASKSS1_gp 25
#define RTC_ALRMASSR_MASKSS2_gm ((uint32_t)0x04000000)
#define RTC_ALRMASSR_MASKSS2_gp 26
#define RTC_ALRMASSR_MASKSS3_gm ((uint32_t)0x08000000)
#define RTC_ALRMASSR_MASKSS3_gp 27
#define RTC_ALRMASSR_SS_gm ((uint32_t)0x00007FFF)
#define RTC_ALRMASSR_SS_gp 0

/*** REGISTER: RTC_ALRMBSSR ***/
#define RTC_ALRMBSSR_MASKSS_gm ((uint32_t)0x0F000000)
#define RTC_ALRMBSSR_MASKSS_gp 24
#define RTC_ALRMBSSR_MASKSS0_gm ((uint32_t)0x01000000)
#define RTC_ALRMBSSR_MASKSS0_gp 24
#define RTC_ALRMBSSR_MASKSS1_gm ((uint32_t)0x02000000)
#define RTC_ALRMBSSR_MASKSS1_gp 25
#define RTC_ALRMBSSR_MASKSS2_gm ((uint32_t)0x04000000)
#define RTC_ALRMBSSR_MASKSS2_gp 26
#define RTC_ALRMBSSR_MASKSS3_gm ((uint32_t)0x08000000)
#define RTC_ALRMBSSR_MASKSS3_gp 27
#define RTC_ALRMBSSR_SS_gm ((uint32_t)0x00007FFF)
#define RTC_ALRMBSSR_SS_gp 0


/********** PERIPHERAL: SPI **********/

/*** REGISTER: SPI_CR1 ***/
#define SPI_CR1_CPHA_gm ((uint16_t)0x0001)
#define SPI_CR1_CPHA_gp 0
#define SPI_CR1_CPOL_gm ((uint16_t)0x0002)
#define SPI_CR1_CPOL_gp 1
#define SPI_CR1_MSTR_gm ((uint16_t)0x0004)
#define SPI_CR1_MSTR_gp 2
#define SPI_CR1_BR_gm ((uint16_t)0x0038)
#define SPI_CR1_BR_gp 3
#define SPI_CR1_BR0_gm ((uint16_t)0x0008)
#define SPI_CR1_BR0_gp 3
#define SPI_CR1_BR1_gm ((uint16_t)0x0010)
#define SPI_CR1_BR1_gp 4
#define SPI_CR1_BR2_gm ((uint16_t)0x0020)
#define SPI_CR1_BR2_gp 5
#define SPI_CR1_SPE_gm ((uint16_t)0x0040)
#define SPI_CR1_SPE_gp 6
#define SPI_CR1_LSBFIRST_gm ((uint16_t)0x0080)
#define SPI_CR1_LSBFIRST_gp 7
#define SPI_CR1_SSI_gm ((uint16_t)0x0100)
#define SPI_CR1_SSI_gp 8
#define SPI_CR1_SSM_gm ((uint16_t)0x0200)
#define SPI_CR1_SSM_gp 9
#define SPI_CR1_RXONLY_gm ((uint16_t)0x0400)
#define SPI_CR1_RXONLY_gp 10
#define SPI_CR1_CRCL_gm ((uint16_t)0x0800)
#define SPI_CR1_CRCL_gp 11
#define SPI_CR1_CRCNEXT_gm ((uint16_t)0x1000)
#define SPI_CR1_CRCNEXT_gp 12
#define SPI_CR1_CRCEN_gm ((uint16_t)0x2000)
#define SPI_CR1_CRCEN_gp 13
#define SPI_CR1_BIDIOE_gm ((uint16_t)0x4000)
#define SPI_CR1_BIDIOE_gp 14
#define SPI_CR1_BIDIMODE_gm ((uint16_t)0x8000)
#define SPI_CR1_BIDIMODE_gp 15

/*** REGISTER: SPI_CR2 ***/
#define SPI_CR2_RXDMAEN_gm ((uint16_t)0x0001)
#define SPI_CR2_RXDMAEN_gp 0
#define SPI_CR2_TXDMAEN_gm ((uint16_t)0x0002)
#define SPI_CR2_TXDMAEN_gp 1
#define SPI_CR2_SSOE_gm ((uint16_t)0x0004)
#define SPI_CR2_SSOE_gp 2
#define SPI_CR2_NSSP_gm ((uint16_t)0x0008)
#define SPI_CR2_NSSP_gp 3
#define SPI_CR2_FRF_gm ((uint16_t)0x0010)
#define SPI_CR2_FRF_gp 4
#define SPI_CR2_ERRIE_gm ((uint16_t)0x0020)
#define SPI_CR2_ERRIE_gp 5
#define SPI_CR2_RXNEIE_gm ((uint16_t)0x0040)
#define SPI_CR2_RXNEIE_gp 6
#define SPI_CR2_TXEIE_gm ((uint16_t)0x0080)
#define SPI_CR2_TXEIE_gp 7
#define SPI_CR2_DS_gm ((uint16_t)0x0F00)
#define SPI_CR2_DS_gp 8
#define SPI_CR2_DS0_gm ((uint16_t)0x0100)
#define SPI_CR2_DS0_gp 8
#define SPI_CR2_DS1_gm ((uint16_t)0x0200)
#define SPI_CR2_DS1_gp 9
#define SPI_CR2_DS2_gm ((uint16_t)0x0400)
#define SPI_CR2_DS2_gp 10
#define SPI_CR2_DS3_gm ((uint16_t)0x0800)
#define SPI_CR2_DS3_gp 11
#define SPI_CR2_FRXTH_gm ((uint16_t)0x1000)
#define SPI_CR2_FRXTH_gp 12
#define SPI_CR2_LDMARX_gm ((uint16_t)0x2000)
#define SPI_CR2_LDMARX_gp 13
#define SPI_CR2_LDMATX_gm ((uint16_t)0x4000)
#define SPI_CR2_LDMATX_gp 14

/*** REGISTER: SPI_SR ***/
#define SPI_SR_RXNE_gm ((uint16_t)0x0001)
#define SPI_SR_RXNE_gp 0
#define SPI_SR_TXE_gm ((uint16_t)0x0002)
#define SPI_SR_TXE_gp 1
#define SPI_SR_CRCERR_gm ((uint16_t)0x0010)
#define SPI_SR_CRCERR_gp 4
#define SPI_SR_MODF_gm ((uint16_t)0x0020)
#define SPI_SR_MODF_gp 5
#define SPI_SR_OVR_gm ((uint16_t)0x0040)
#define SPI_SR_OVR_gp 6
#define SPI_SR_BSY_gm ((uint16_t)0x0080)
#define SPI_SR_BSY_gp 7
#define SPI_SR_FRE_gm ((uint16_t)0x0100)
#define SPI_SR_FRE_gp 8
#define SPI_SR_FRLVL_gm ((uint16_t)0x0600)
#define SPI_SR_FRLVL_gp 9
#define SPI_SR_FRLVL0_gm ((uint16_t)0x0200)
#define SPI_SR_FRLVL0_gp 9
#define SPI_SR_FRLVL1_gm ((uint16_t)0x0400)
#define SPI_SR_FRLVL1_gp 10
#define SPI_SR_FTLVL_gm ((uint16_t)0x1800)
#define SPI_SR_FTLVL_gp 11
#define SPI_SR_FTLVL0_gm ((uint16_t)0x0800)
#define SPI_SR_FTLVL0_gp 11
#define SPI_SR_FTLVL1_gm ((uint16_t)0x1000)
#define SPI_SR_FTLVL1_gp 12

/*** REGISTER: SPI_DR ***/
#define SPI_DR_DR_gm ((uint16_t)0xFFFF)
#define SPI_DR_DR_gp 0

