a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: SPI_CRCPR ***/
#define SPI_CRCPR_CRCPOLY_gm ((uint16_t)0xFFFF)
#define SPI_CRCPR_CRCPOLY_gp 0

/*** REGISTER: SPI_RXCRCR ***/
#define SPI_RXCRCR_RXCRC_gm ((uint16_t)0xFFFF)
#define SPI_RXCRCR_RXCRC_gp 0

/*** REGISTER: SPI_TXCRCR ***/
#define SPI_TXCRCR_TXCRC_gm ((uint16_t)0xFFFF)
#define SPI_TXCRCR_TXCRC_gp 0

/*** REGISTER: SPI_I2SCFGR ***/
#define SPI_I2SCFGR_CHLEN_gm ((uint16_t)0x0001)
#define SPI_I2SCFGR_CHLEN_gp 0
#define SPI_I2SCFGR_DATLEN_gm ((uint16_t)0x0006)
#define SPI_I2SCFGR_DATLEN_gp 1
#define SPI_I2SCFGR_DATLEN0_gm ((uint16_t)0x0002)
#define SPI_I2SCFGR_DATLEN0_gp 1
#define SPI_I2SCFGR_DATLEN1_gm ((uint16_t)0x0004)
#define SPI_I2SCFGR_DATLEN1_gp 2
#define SPI_I2SCFGR_CKPOL_gm ((uint16_t)0x0008)
#define SPI_I2SCFGR_CKPOL_gp 3
#define SPI_I2SCFGR_I2SSTD_gm ((uint16_t)0x0030)
#define SPI_I2SCFGR_I2SSTD_gp 4
#define SPI_I2SCFGR_I2SSTD0_gm ((uint16_t)0x0010)
#define SPI_I2SCFGR_I2SSTD0_gp 4
#define SPI_I2SCFGR_I2SSTD1_gm ((uint16_t)0x0020)
#define SPI_I2SCFGR_I2SSTD1_gp 5
#define SPI_I2SCFGR_PCMSYNC_gm ((uint16_t)0x0080)
#define SPI_I2SCFGR_PCMSYNC_gp 7
#define SPI_I2SCFGR_I2SCFG_gm ((uint16_t)0x0300)
#define SPI_I2SCFGR_I2SCFG_gp 8
#define SPI_I2SCFGR_I2SCFG0_gm ((uint16_t)0x0100)
#define SPI_I2SCFGR_I2SCFG0_gp 8
#define SPI_I2SCFGR_I2SCFG1_gm ((uint16_t)0x0200)
#define SPI_I2SCFGR_I2SCFG1_gp 9
#define SPI_I2SCFGR_I2SE_gm ((uint16_t)0x0400)
#define SPI_I2SCFGR_I2SE_gp 10
#define SPI_I2SCFGR_I2SMOD_gm ((uint16_t)0x0800)
#define SPI_I2SCFGR_I2SMOD_gp 11

/*** REGISTER: SPI_I2SPR ***/
#define SPI_I2SPR_I2SDIV_gm ((uint16_t)0x00FF)
#define SPI_I2SPR_I2SDIV_gp 0
#define SPI_I2SPR_ODD_gm ((uint16_t)0x0100)
#define SPI_I2SPR_ODD_gp 8
#define SPI_I2SPR_MCKOE_gm ((uint16_t)0x0200)
#define SPI_I2SPR_MCKOE_gp 9


/********** PERIPHERAL: SYSCFG **********/

/*** REGISTER: SYSCFG_CFGR1 ***/
#define SYSCFG_CFGR1_MEM_MODE_gm ((uint32_t)0x00000003)
#define SYSCFG_CFGR1_MEM_MODE_gp 0
#define SYSCFG_CFGR1_MEM_MODE_0_gm ((uint32_t)0x00000001)
#define SYSCFG_CFGR1_MEM_MODE_0_gp 0
#define SYSCFG_CFGR1_MEM_MODE_1_gm ((uint32_t)0x00000002)
#define SYSCFG_CFGR1_MEM_MODE_1_gp 1
#define SYSCFG_CFGR1_USB_IT_RMP_gm ((uint32_t)0x00000020)
#define SYSCFG_CFGR1_USB_IT_RMP_gp 5
#define SYSCFG_CFGR1_TIM1_ITR3_RMP_gm ((uint32_t)0x00000040)
#define SYSCFG_CFGR1_TIM1_ITR3_RMP_gp 6
#define SYSCFG_CFGR1_DAC_TRIG_RMP_gm ((uint32_t)0x00000080)
#define SYSCFG_CFGR1_DAC_TRIG_RMP_gp 7
#define SYSCFG_CFGR1_ADC24_DMA_RMP_gm ((uint32_t)0x00000100)
#define SYSCFG_CFGR1_ADC24_DMA_RMP_gp 8
#define SYSCFG_CFGR1_TIM16_DMA_RMP_gm ((uint32_t)0x00000800)
#define SYSCFG_CFGR1_TIM16_DMA_RMP_gp 11
#define SYSCFG_CFGR1_TIM17_DMA_RMP_gm ((uint32_t)0x00001000)
#define SYSCFG_CFGR1_TIM17_DMA_RMP_gp 12
#define SYSCFG_CFGR1_TIM6DAC1_DMA_RMP_gm ((uint32_t)0x00002000)
#define SYSCFG_CFGR1_TIM6DAC1_DMA_RMP_gp 13
#define SYSCFG_CFGR1_TIM7DAC2_DMA_RMP_gm ((uint32_t)0x00004000)
#define SYSCFG_CFGR1_TIM7DAC2_DMA_RMP_gp 14
#define SYSCFG_CFGR1_I2C_PB6_FMP_gm ((uint32_t)0x00010000)
#define SYSCFG_CFGR1_I2C_PB6_FMP_gp 16
#define SYSCFG_CFGR1_I2C_PB7_FMP_gm ((uint32_t)0x00020000)
#define SYSCFG_CFGR1_I2C_PB7_FMP_gp 17
#define SYSCFG_CFGR1_I2C_PB8_FMP_gm ((uint32_t)0x00040000)
#define SYSCFG_CFGR1_I2C_PB8_FMP_gp 18
#define SYSCFG_CFGR1_I2C_PB9_FMP_gm ((uint32_t)0x00080000)
#define SYSCFG_CFGR1_I2C_PB9_FMP_gp 19
#define SYSCFG_CFGR1_I2C1_FMP_gm ((uint32_t)0x00100000)
#define SYSCFG_CFGR1_I2C1_FMP_gp 20
#define SYSCFG_CFGR1_I2C2_FMP_gm ((uint32_t)0x00200000)
#define SYSCFG_CFGR1_I2C2_FMP_gp 21
#define SYSCFG_CFGR1_ENCODER_MODE_gm ((uint32_t)0x00C00000)
#define SYSCFG_CFGR1_ENCODER_MODE_gp 22
#define SYSCFG_CFGR1_ENCODER_MODE_0_gm ((uint32_t)0x00400000)
#define SYSCFG_CFGR1_ENCODER_MODE_0_gp 22
#define SYSCFG_CFGR1_ENCODER_MODE_1_gm ((uint32_t)0x00800000)
#define SYSCFG_CFGR1_ENCODER_MODE_1_gp 23
#define SYSCFG_CFGR1_FPU_IE_gm ((uint32_t)0xFC000000)
#define SYSCFG_CFGR1_FPU_IE_gp 26
#define SYSCFG_CFGR1_FPU_IE_0_gm ((uint32_t)0x04000000)
#define SYSCFG_CFGR1_FPU_IE_0_gp 26
#define SYSCFG_CFGR1_FPU_IE_1_gm ((uint32_t)0x08000000)
#define SYSCFG_CFGR1_FPU_IE_1_gp 27
#define SYSCFG_CFGR1_FPU_IE_2_gm ((uint32_t)0x10000000)
#define SYSCFG_CFGR1_FPU_IE_2_gp 28
#define SYSCFG_CFGR1_FPU_IE_3_gm ((uint32_t)0x20000000)
#define SYSCFG_CFGR1_FPU_IE_3_gp 29
#define SYSCFG_CFGR1_FPU_IE_4_gm ((uint32_t)0x40000000)
#define SYSCFG_CFGR1_FPU_IE_4_gp 30
#define SYSCFG_CFGR1_FPU_IE_5_gm ((uint32_t)0x80000000)
#define SYSCFG_CFGR1_FPU_IE_5_gp 31

/*** REGISTER: SYSCFG_RCR ***/
#define SYSCFG_RCR_PAGE0_gm ((uint32_t)0x00000001)
#define SYSCFG_RCR_PAGE0_gp 0
#define SYSCFG_RCR_PAGE1_gm ((uint32_t)0x00000002)
#define SYSCFG_RCR_PAGE1_gp 1
#define SYSCFG_RCR_PAGE2_gm ((uint32_t)0x00000004)
#define SYSCFG_RCR_PAGE2_gp 2
#define SYSCFG_RCR_PAGE3_gm ((uint32_t)0x00000008)
#define SYSCFG_RCR_PAGE3_gp 3
#define SYSCFG_RCR_PAGE4_gm ((uint32_t)0x00000010)
#define SYSCFG_RCR_PAGE4_gp 4
#define SYSCFG_RCR_PAGE5_gm ((uint32_t)0x00000020)
#define SYSCFG_RCR_PAGE5_gp 5
#define SYSCFG_RCR_PAGE6_gm ((uint32_t)0x00000040)
#define SYSCFG_RCR_PAGE6_gp 6
#define SYSCFG_RCR_PAGE7_gm ((uint32_t)0x00000080)
#define SYSCFG_RCR_PAGE7_gp 7

/*** REGISTER: SYSCFG_EXTICR1 ***/
#define SYSCFG_EXTICR1_EXTI0_gm ((uint16_t)0x000F)
#define SYSCFG_EXTICR1_EXTI0_gp 0
#define SYSCFG_EXTICR1_EXTI1_gm ((uint16_t)0x00F0)
#define SYSCFG_EXTICR1_EXTI1_gp 4
#define SYSCFG_EXTICR1_EXTI2_gm ((uint16_t)0x0F00)
#define SYSCFG_EXTICR1_EXTI2_gp 8
#define SYSCFG_EXTICR1_EXTI3_gm ((uint16_t)0xF000)
#define SYSCFG_EXTICR1_EXTI3_gp 12
#define SYSCFG_EXTICR1_EXTI0_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR1_EXTI0_PB_gc ((uint16_t)0x0001)
#define SYSCFG_EXTICR1_EXTI0_PC_gc ((uint16_t)0x0002)
#define SYSCFG_EXTICR1_EXTI0_PD_gc ((uint16_t)0x0003)
#define SYSCFG_EXTICR1_EXTI0_PE_gc ((uint16_t)0x0004)
#define SYSCFG_EXTICR1_EXTI0_PF_gc ((uint16_t)0x0005)
#define SYSCFG_EXTICR1_EXTI1_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR1_EXTI1_PB_gc ((uint16_t)0x0010)
#define SYSCFG_EXTICR1_EXTI1_PC_gc ((uint16_t)0x0020)
#define SYSCFG_EXTICR1_EXTI1_PD_gc ((uint16_t)0x0030)
#define SYSCFG_EXTICR1_EXTI1_PE_gc ((uint16_t)0x0040)
#define SYSCFG_EXTICR1_EXTI1_PF_gc ((uint16_t)0x0050)
#define SYSCFG_EXTICR1_EXTI2_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR1_EXTI2_PB_gc ((uint16_t)0x0100)
#define SYSCFG_EXTICR1_EXTI2_PC_gc ((uint16_t)0x0200)
#define SYSCFG_EXTICR1_EXTI2_PD_gc ((uint16_t)0x0300)
#define SYSCFG_EXTICR1_EXTI2_PE_gc ((uint16_t)0x0400)
#define SYSCFG_EXTICR1_EXTI2_PF_gc ((uint16_t)0x0500)
#define SYSCFG_EXTICR1_EXTI3_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR1_EXTI3_PB_gc ((uint16_t)0x1000)
#define SYSCFG_EXTICR1_EXTI3_PC_gc ((uint16_t)0x2000)
#define SYSCFG_EXTICR1_EXTI3_PD_gc ((uint16_t)0x3000)
#define SYSCFG_EXTICR1_EXTI3_PE_gc ((uint16_t)0x4000)

/*** REGISTER: SYSCFG_EXTIRCR ***/
#define SYSCFG_EXTIRCR_EXTI4_gm ((uint16_t)0x000F)
#define SYSCFG_EXTIRCR_EXTI4_gp 0
#define SYSCFG_EXTIRCR_EXTI5_gm ((uint16_t)0x00F0)
#define SYSCFG_EXTIRCR_EXTI5_gp 4
#define SYSCFG_EXTIRCR_EXTI6_gm ((uint16_t)0x0F00)
#define SYSCFG_EXTIRCR_EXTI6_gp 8
#define SYSCFG_EXTIRCR_EXTI7_gm ((uint16_t)0xF000)
#define SYSCFG_EXTIRCR_EXTI7_gp 12
#define SYSCFG_EXTIRCR_EXTI4_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTIRCR_EXTI4_PB_gc ((uint16_t)0x0001)
#define SYSCFG_EXTIRCR_EXTI4_PC_gc ((uint16_t)0x0002)
#define SYSCFG_EXTIRCR_EXTI4_PD_gc ((uint16_t)0x0003)
#define SYSCFG_EXTIRCR_EXTI4_PE_gc ((uint16_t)0x0004)
#define SYSCFG_EXTIRCR_EXTI4_PF_gc ((uint16_t)0x0005)
#define SYSCFG_EXTIRCR_EXTI5_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTIRCR_EXTI5_PB_gc ((uint16_t)0x0010)
#define SYSCFG_EXTIRCR_EXTI5_PC_gc ((uint16_t)0x0020)
#define SYSCFG_EXTIRCR_EXTI5_PD_gc ((uint16_t)0x0030)
#define SYSCFG_EXTIRCR_EXTI5_PE_gc ((uint16_t)0x0040)
#define SYSCFG_EXTIRCR_EXTI5_PF_gc ((uint16_t)0x0050)
#define SYSCFG_EXTIRCR_EXTI6_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTIRCR_EXTI6_PB_gc ((uint16_t)0x0100)
#define SYSCFG_EXTIRCR_EXTI6_PC_gc ((uint16_t)0x0200)
#define SYSCFG_EXTIRCR_EXTI6_PD_gc ((uint16_t)0x0300)
#define SYSCFG_EXTIRCR_EXTI6_PE_gc ((uint16_t)0x0400)
#define SYSCFG_EXTIRCR_EXTI6_PF_gc ((uint16_t)0x0500)
#define SYSCFG_EXTIRCR_EXTI7_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTIRCR_EXTI7_PB_gc ((uint16_t)0x1000)
#define SYSCFG_EXTIRCR_EXTI7_PC_gc ((uint16_t)0x2000)
#define SYSCFG_EXTIRCR_EXTI7_PD_gc ((uint16_t)0x3000)
#define SYSCFG_EXTIRCR_EXTI7_PE_gc ((uint16_t)0x4000)

/*** REGISTER: SYSCFG_EXTICR3 ***/
#define SYSCFG_EXTICR3_EXTI8_gm ((uint16_t)0x000F)
#define SYSCFG_EXTICR3_EXTI8_gp 0
#define SYSCFG_EXTICR3_EXTI9_gm ((uint16_t)0x00F0)
#define SYSCFG_EXTICR3_EXTI9_gp 4
#define SYSCFG_EXTICR3_EXTI10_gm ((uint16_t)0x0F00)
#define SYSCFG_EXTICR3_EXTI10_gp 8
#define SYSCFG_EXTICR3_EXTI11_gm ((uint16_t)0xF000)
#define SYSCFG_EXTICR3_EXTI11_gp 12
#define SYSCFG_EXTICR3_EXTI8_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR3_EXTI8_PB_gc ((uint16_t)0x0001)
#define SYSCFG_EXTICR3_EXTI8_PC_gc ((uint16_t)0x0002)
#define SYSCFG_EXTICR3_EXTI8_PD_gc ((uint16_t)0x0003)
#define SYSCFG_EXTICR3_EXTI8_PE_gc ((uint16_t)0x0004)
#define SYSCFG_EXTICR3_EXTI9_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR3_EXTI9_PB_gc ((uint16_t)0x0010)
#define SYSCFG_EXTICR3_EXTI9_PC_gc ((uint16_t)0x0020)
#define SYSCFG_EXTICR3_EXTI9_PD_gc ((uint16_t)0x0030)
#define SYSCFG_EXTICR3_EXTI9_PE_gc ((uint16_t)0x0040)
#define SYSCFG_EXTICR3_EXTI9_PF_gc ((uint16_t)0x0050)
#define SYSCFG_EXTICR3_EXTI10_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR3_EXTI10_PB_gc ((uint16_t)0x0100)
#define SYSCFG_EXTICR3_EXTI10_PC_gc ((uint16_t)0x0200)
#define SYSCFG_EXTICR3_EXTI10_PD_gc ((uint16_t)0x0300)
#define SYSCFG_EXTICR3_EXTI10_PE_gc ((uint16_t)0x0400)
#define SYSCFG_EXTICR3_EXTI10_PF_gc ((uint16_t)0x0500)
#define SYSCFG_EXTICR3_EXTI11_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR3_EXTI11_PB_gc ((uint16_t)0x1000)
#define SYSCFG_EXTICR3_EXTI11_PC_gc ((uint16_t)0x2000)
#define SYSCFG_EXTICR3_EXTI11_PD_gc ((uint16_t)0x3000)
#define SYSCFG_EXTICR3_EXTI11_PE_gc ((uint16_t)0x4000)

/*** REGISTER: SYSCFG_EXTICR4 ***/
#define SYSCFG_EXTICR4_EXTI12_gm ((uint16_t)0x000F)
#define SYSCFG_EXTICR4_EXTI12_gp 0
#define SYSCFG_EXTICR4_EXTI13_gm ((uint16_t)0x00F0)
#define SYSCFG_EXTICR4_EXTI13_gp 4
#define SYSCFG_EXTICR4_EXTI14_gm ((uint16_t)0x0F00)
#define SYSCFG_EXTICR4_EXTI14_gp 8
#define SYSCFG_EXTICR4_EXTI15_gm ((uint16_t)0xF000)
#define SYSCFG_EXTICR4_EXTI15_gp 12
#define SYSCFG_EXTICR4_EXTI12_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR4_EXTI12_PB_gc ((uint16_t)0x0001)
#define SYSCFG_EXTICR4_EXTI12_PC_gc ((uint16_t)0x0002)
#define SYSCFG_EXTICR4_EXTI12_PD_gc ((uint16_t)0x0003)
#define SYSCFG_EXTICR4_EXTI12_PE_gc ((uint16_t)0x0004)
#define SYSCFG_EXTICR4_EXTI13_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR4_EXTI13_PB_gc ((uint16_t)0x0010)
#define SYSCFG_EXTICR4_EXTI13_PC_gc ((uint16_t)0x0020)
#define SYSCFG_EXTICR4_EXTI13_PD_gc ((uint16_t)0x0030)
#define SYSCFG_EXTICR4_EXTI13_PE_gc ((uint16_t)0x0040)
#define SYSCFG_EXTICR4_EXTI14_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR4_EXTI14_PB_gc ((uint16_t)0x0100)
#define SYSCFG_EXTICR4_EXTI14_PC_gc ((uint16_t)0x0200)
#define SYSCFG_EXTICR4_EXTI14_PD_gc ((uint16_t)0x0300)
#define SYSCFG_EXTICR4_EXTI14_PE_gc ((uint16_t)0x0400)
#define SYSCFG_EXTICR4_EXTI15_PA_gc ((uint16_t)0x0000)
#define SYSCFG_EXTICR4_EXTI15_PB_gc ((uint16_t)0x1000)
#define SYSCFG_EXTICR4_EXTI15_PC_gc ((uint16_t)0x2000)
#define SYSCFG_EXTICR4_EXTI15_PD_gc ((uint16_t)0x3000)
#define SYSCFG_EXTICR4_EXTI15_PE_gc ((uint16_t)0x4000)

