a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: SYSCFG_CFGR2 ***/
#define SYSCFG_CFGR2_LOCKUP_LOCK_gm ((uint32_t)0x00000001)
#define SYSCFG_CFGR2_LOCKUP_LOCK_gp 0
#define SYSCFG_CFGR2_SRAM_PARITY_LOCK_gm ((uint32_t)0x00000002)
#define SYSCFG_CFGR2_SRAM_PARITY_LOCK_gp 1
#define SYSCFG_CFGR2_PVD_LOCK_gm ((uint32_t)0x00000004)
#define SYSCFG_CFGR2_PVD_LOCK_gp 2
#define SYSCFG_CFGR2_BYP_ADDR_PAR_gm ((uint32_t)0x00000010)
#define SYSCFG_CFGR2_BYP_ADDR_PAR_gp 4
#define SYSCFG_CFGR2_SRAM_PE_gm ((uint32_t)0x00000100)
#define SYSCFG_CFGR2_SRAM_PE_gp 8


/********** PERIPHERAL: TIM **********/

/*** REGISTER: TIM_CR1 ***/
#define TIM_CR1_CEN_gm ((uint16_t)0x0001)
#define TIM_CR1_CEN_gp 0
#define TIM_CR1_UDIS_gm ((uint16_t)0x0002)
#define TIM_CR1_UDIS_gp 1
#define TIM_CR1_URS_gm ((uint16_t)0x0004)
#define TIM_CR1_URS_gp 2
#define TIM_CR1_OPM_gm ((uint16_t)0x0008)
#define TIM_CR1_OPM_gp 3
#define TIM_CR1_DIR_gm ((uint16_t)0x0010)
#define TIM_CR1_DIR_gp 4
#define TIM_CR1_CMS_gm ((uint16_t)0x0060)
#define TIM_CR1_CMS_gp 5
#define TIM_CR1_CMS0_gm ((uint16_t)0x0020)
#define TIM_CR1_CMS0_gp 5
#define TIM_CR1_CMS1_gm ((uint16_t)0x0040)
#define TIM_CR1_CMS1_gp 6
#define TIM_CR1_ARPE_gm ((uint16_t)0x0080)
#define TIM_CR1_ARPE_gp 7
#define TIM_CR1_CKD_gm ((uint16_t)0x0300)
#define TIM_CR1_CKD_gp 8
#define TIM_CR1_CKD0_gm ((uint16_t)0x0100)
#define TIM_CR1_CKD0_gp 8
#define TIM_CR1_CKD1_gm ((uint16_t)0x0200)
#define TIM_CR1_CKD1_gp 9
#define TIM_CR1_UIFREMAP_gm ((uint16_t)0x0800)
#define TIM_CR1_UIFREMAP_gp 11

/*** REGISTER: TIM_CR2 ***/
#define TIM_CR2_CCPC_gm ((uint32_t)0x00000001)
#define TIM_CR2_CCPC_gp 0
#define TIM_CR2_CCUS_gm ((uint32_t)0x00000004)
#define TIM_CR2_CCUS_gp 2
#define TIM_CR2_CCDS_gm ((uint32_t)0x00000008)
#define TIM_CR2_CCDS_gp 3
#define TIM_CR2_MMS_gm ((uint32_t)0x00000070)
#define TIM_CR2_MMS_gp 4
#define TIM_CR2_TI1S_gm ((uint32_t)0x00000080)
#define TIM_CR2_TI1S_gp 7
#define TIM_CR2_OIS1_gm ((uint32_t)0x00000100)
#define TIM_CR2_OIS1_gp 8
#define TIM_CR2_OIS1N_gm ((uint32_t)0x00000200)
#define TIM_CR2_OIS1N_gp 9
#define TIM_CR2_OIS2_gm ((uint32_t)0x00000400)
#define TIM_CR2_OIS2_gp 10
#define TIM_CR2_OIS2N_gm ((uint32_t)0x00000800)
#define TIM_CR2_OIS2N_gp 11
#define TIM_CR2_OIS3_gm ((uint32_t)0x00001000)
#define TIM_CR2_OIS3_gp 12
#define TIM_CR2_OIS3N_gm ((uint32_t)0x00002000)
#define TIM_CR2_OIS3N_gp 13
#define TIM_CR2_OIS4_gm ((uint32_t)0x00004000)
#define TIM_CR2_OIS4_gp 14
#define TIM_CR2_OIS5_gm ((uint32_t)0x00010000)
#define TIM_CR2_OIS5_gp 16
#define TIM_CR2_OIS6_gm ((uint32_t)0x00020000)
#define TIM_CR2_OIS6_gp 17
#define TIM_CR2_MMS2_gm ((uint32_t)0x00F00000)
#define TIM_CR2_MMS2_gp 20

/*** REGISTER: TIM_SMCR ***/
#define TIM_SMCR_SMS_gm ((uint32_t)0x00010007)
#define TIM_SMCR_SMS_gp 0
#define TIM_SMCR_SMS0_gm ((uint32_t)0x00000001)
#define TIM_SMCR_SMS0_gp 0
#define TIM_SMCR_SMS1_gm ((uint32_t)0x00000002)
#define TIM_SMCR_SMS1_gp 1
#define TIM_SMCR_SMS2_gm ((uint32_t)0x00000004)
#define TIM_SMCR_SMS2_gp 2
#define TIM_SMCR_SMS3_gm ((uint32_t)0x00010000)
#define TIM_SMCR_SMS3_gp 16
#define TIM_SMCR_OCCS_gm ((uint32_t)0x00000008)
#define TIM_SMCR_OCCS_gp 3
#define TIM_SMCR_TS_gm ((uint32_t)0x00000070)
#define TIM_SMCR_TS_gp 4
#define TIM_SMCR_TS0_gm ((uint32_t)0x00000010)
#define TIM_SMCR_TS0_gp 4
#define TIM_SMCR_TS1_gm ((uint32_t)0x00000020)
#define TIM_SMCR_TS1_gp 5
#define TIM_SMCR_TS2_gm ((uint32_t)0x00000040)
#define TIM_SMCR_TS2_gp 6
#define TIM_SMCR_MSM_gm ((uint32_t)0x00000080)
#define TIM_SMCR_MSM_gp 7
#define TIM_SMCR_ETF_gm ((uint32_t)0x00000F00)
#define TIM_SMCR_ETF_gp 8
#define TIM_SMCR_ETF0_gm ((uint32_t)0x00000100)
#define TIM_SMCR_ETF0_gp 8
#define TIM_SMCR_ETF1_gm ((uint32_t)0x00000200)
#define TIM_SMCR_ETF1_gp 9
#define TIM_SMCR_ETF2_gm ((uint32_t)0x00000400)
#define TIM_SMCR_ETF2_gp 10
#define TIM_SMCR_ETF3_gm ((uint32_t)0x00000800)
#define TIM_SMCR_ETF3_gp 11
#define TIM_SMCR_ETPS_gm ((uint32_t)0x00003000)
#define TIM_SMCR_ETPS_gp 12
#define TIM_SMCR_ETPS0_gm ((uint32_t)0x00001000)
#define TIM_SMCR_ETPS0_gp 12
#define TIM_SMCR_ETPS1_gm ((uint32_t)0x00002000)
#define TIM_SMCR_ETPS1_gp 13
#define TIM_SMCR_ECE_gm ((uint32_t)0x00004000)
#define TIM_SMCR_ECE_gp 14
#define TIM_SMCR_ETP_gm ((uint32_t)0x00008000)
#define TIM_SMCR_ETP_gp 15

/*** REGISTER: TIM_DIER ***/
#define TIM_DIER_UIE_gm ((uint16_t)0x0001)
#define TIM_DIER_UIE_gp 0
#define TIM_DIER_CC1IE_gm ((uint16_t)0x0002)
#define TIM_DIER_CC1IE_gp 1
#define TIM_DIER_CC2IE_gm ((uint16_t)0x0004)
#define TIM_DIER_CC2IE_gp 2
#define TIM_DIER_CC3IE_gm ((uint16_t)0x0008)
#define TIM_DIER_CC3IE_gp 3
#define TIM_DIER_CC4IE_gm ((uint16_t)0x0010)
#define TIM_DIER_CC4IE_gp 4
#define TIM_DIER_COMIE_gm ((uint16_t)0x0020)
#define TIM_DIER_COMIE_gp 5
#define TIM_DIER_TIE_gm ((uint16_t)0x0040)
#define TIM_DIER_TIE_gp 6
#define TIM_DIER_BIE_gm ((uint16_t)0x0080)
#define TIM_DIER_BIE_gp 7
#define TIM_DIER_UDE_gm ((uint16_t)0x0100)
#define TIM_DIER_UDE_gp 8
#define TIM_DIER_CC1DE_gm ((uint16_t)0x0200)
#define TIM_DIER_CC1DE_gp 9
#define TIM_DIER_CC2DE_gm ((uint16_t)0x0400)
#define TIM_DIER_CC2DE_gp 10
#define TIM_DIER_CC3DE_gm ((uint16_t)0x0800)
#define TIM_DIER_CC3DE_gp 11
#define TIM_DIER_CC4DE_gm ((uint16_t)0x1000)
#define TIM_DIER_CC4DE_gp 12
#define TIM_DIER_COMDE_gm ((uint16_t)0x2000)
#define TIM_DIER_COMDE_gp 13
#define TIM_DIER_TDE_gm ((uint16_t)0x4000)
#define TIM_DIER_TDE_gp 14

/*** REGISTER: TIM_SR ***/
#define TIM_SR_UIF_gm ((uint32_t)0x00000001)
#define TIM_SR_UIF_gp 0
#define TIM_SR_CC1IF_gm ((uint32_t)0x00000002)
#define TIM_SR_CC1IF_gp 1
#define TIM_SR_CC2IF_gm ((uint32_t)0x00000004)
#define TIM_SR_CC2IF_gp 2
#define TIM_SR_CC3IF_gm ((uint32_t)0x00000008)
#define TIM_SR_CC3IF_gp 3
#define TIM_SR_CC4IF_gm ((uint32_t)0x00000010)
#define TIM_SR_CC4IF_gp 4
#define TIM_SR_COMIF_gm ((uint32_t)0x00000020)
#define TIM_SR_COMIF_gp 5
#define TIM_SR_TIF_gm ((uint32_t)0x00000040)
#define TIM_SR_TIF_gp 6
#define TIM_SR_BIF_gm ((uint32_t)0x00000080)
#define TIM_SR_BIF_gp 7
#define TIM_SR_B2IF_gm ((uint32_t)0x00000100)
#define TIM_SR_B2IF_gp 8
#define TIM_SR_CC1OF_gm ((uint32_t)0x00000200)
#define TIM_SR_CC1OF_gp 9
#define TIM_SR_CC2OF_gm ((uint32_t)0x00000400)
#define TIM_SR_CC2OF_gp 10
#define TIM_SR_CC3OF_gm ((uint32_t)0x00000800)
#define TIM_SR_CC3OF_gp 11
#define TIM_SR_CC4OF_gm ((uint32_t)0x00001000)
#define TIM_SR_CC4OF_gp 12
#define TIM_SR_CC5IF_gm ((uint32_t)0x00010000)
#define TIM_SR_CC5IF_gp 16
#define TIM_SR_CC6IF_gm ((uint32_t)0x00020000)
#define TIM_SR_CC6IF_gp 17

