a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: TIM_EGR ***/
#define TIM_EGR_UG_gm ((uint16_t)0x0001)
#define TIM_EGR_UG_gp 0
#define TIM_EGR_CC1G_gm ((uint16_t)0x0002)
#define TIM_EGR_CC1G_gp 1
#define TIM_EGR_CC2G_gm ((uint16_t)0x0004)
#define TIM_EGR_CC2G_gp 2
#define TIM_EGR_CC3G_gm ((uint16_t)0x0008)
#define TIM_EGR_CC3G_gp 3
#define TIM_EGR_CC4G_gm ((uint16_t)0x0010)
#define TIM_EGR_CC4G_gp 4
#define TIM_EGR_COMG_gm ((uint16_t)0x0020)
#define TIM_EGR_COMG_gp 5
#define TIM_EGR_TG_gm ((uint16_t)0x0040)
#define TIM_EGR_TG_gp 6
#define TIM_EGR_BG_gm ((uint16_t)0x0080)
#define TIM_EGR_BG_gp 7
#define TIM_EGR_B2G_gm ((uint16_t)0x0100)
#define TIM_EGR_B2G_gp 8

/*** REGISTER: TIM_CCMR1 ***/
#define TIM_CCMR1_CC1S_gm ((uint32_t)0x00000003)
#define TIM_CCMR1_CC1S_gp 0
#define TIM_CCMR1_CC1S0_gm ((uint32_t)0x00000001)
#define TIM_CCMR1_CC1S0_gp 0
#define TIM_CCMR1_CC1S1_gm ((uint32_t)0x00000002)
#define TIM_CCMR1_CC1S1_gp 1
#define TIM_CCMR1_OC1FE_gm ((uint32_t)0x00000004)
#define TIM_CCMR1_OC1FE_gp 2
#define TIM_CCMR1_OC1PE_gm ((uint32_t)0x00000008)
#define TIM_CCMR1_OC1PE_gp 3
#define TIM_CCMR1_OC1M_gm ((uint32_t)0x00010070)
#define TIM_CCMR1_OC1M_gp 4
#define TIM_CCMR1_OC1M0_gm ((uint32_t)0x00000010)
#define TIM_CCMR1_OC1M0_gp 4
#define TIM_CCMR1_OC1M1_gm ((uint32_t)0x00000020)
#define TIM_CCMR1_OC1M1_gp 5
#define TIM_CCMR1_OC1M2_gm ((uint32_t)0x00000040)
#define TIM_CCMR1_OC1M2_gp 6
#define TIM_CCMR1_OC1M3_gm ((uint32_t)0x00010000)
#define TIM_CCMR1_OC1M3_gp 16
#define TIM_CCMR1_OC1CE_gm ((uint32_t)0x00000080)
#define TIM_CCMR1_OC1CE_gp 7
#define TIM_CCMR1_CC2S_gm ((uint32_t)0x00000300)
#define TIM_CCMR1_CC2S_gp 8
#define TIM_CCMR1_CC2S0_gm ((uint32_t)0x00000100)
#define TIM_CCMR1_CC2S0_gp 8
#define TIM_CCMR1_CC2S1_gm ((uint32_t)0x00000200)
#define TIM_CCMR1_CC2S1_gp 9
#define TIM_CCMR1_OC2FE_gm ((uint32_t)0x00000400)
#define TIM_CCMR1_OC2FE_gp 10
#define TIM_CCMR1_OC2PE_gm ((uint32_t)0x00000800)
#define TIM_CCMR1_OC2PE_gp 11
#define TIM_CCMR1_OC2M_gm ((uint32_t)0x01007000)
#define TIM_CCMR1_OC2M_gp 12
#define TIM_CCMR1_OC2M0_gm ((uint32_t)0x00001000)
#define TIM_CCMR1_OC2M0_gp 12
#define TIM_CCMR1_OC2M1_gm ((uint32_t)0x00002000)
#define TIM_CCMR1_OC2M1_gp 13
#define TIM_CCMR1_OC2M2_gm ((uint32_t)0x00004000)
#define TIM_CCMR1_OC2M2_gp 14
#define TIM_CCMR1_OC2M3_gm ((uint32_t)0x01000000)
#define TIM_CCMR1_OC2M3_gp 24
#define TIM_CCMR1_OC2CE_gm ((uint32_t)0x00008000)
#define TIM_CCMR1_OC2CE_gp 15
#define TIM_CCMR1_IC1PSC_gm ((uint32_t)0x0000000C)
#define TIM_CCMR1_IC1PSC_gp 2
#define TIM_CCMR1_IC1PSC0_gm ((uint32_t)0x00000004)
#define TIM_CCMR1_IC1PSC0_gp 2
#define TIM_CCMR1_IC1PSC1_gm ((uint32_t)0x00000008)
#define TIM_CCMR1_IC1PSC1_gp 3
#define TIM_CCMR1_IC1F_gm ((uint32_t)0x000000F0)
#define TIM_CCMR1_IC1F_gp 4
#define TIM_CCMR1_IC1F0_gm ((uint32_t)0x00000010)
#define TIM_CCMR1_IC1F0_gp 4
#define TIM_CCMR1_IC1F1_gm ((uint32_t)0x00000020)
#define TIM_CCMR1_IC1F1_gp 5
#define TIM_CCMR1_IC1F2_gm ((uint32_t)0x00000040)
#define TIM_CCMR1_IC1F2_gp 6
#define TIM_CCMR1_IC1F3_gm ((uint32_t)0x00000080)
#define TIM_CCMR1_IC1F3_gp 7
#define TIM_CCMR1_IC2PSC_gm ((uint32_t)0x00000C00)
#define TIM_CCMR1_IC2PSC_gp 10
#define TIM_CCMR1_IC2PSC0_gm ((uint32_t)0x00000400)
#define TIM_CCMR1_IC2PSC0_gp 10
#define TIM_CCMR1_IC2PSC1_gm ((uint32_t)0x00000800)
#define TIM_CCMR1_IC2PSC1_gp 11
#define TIM_CCMR1_IC2F_gm ((uint32_t)0x0000F000)
#define TIM_CCMR1_IC2F_gp 12
#define TIM_CCMR1_IC2F0_gm ((uint32_t)0x00001000)
#define TIM_CCMR1_IC2F0_gp 12
#define TIM_CCMR1_IC2F1_gm ((uint32_t)0x00002000)
#define TIM_CCMR1_IC2F1_gp 13
#define TIM_CCMR1_IC2F2_gm ((uint32_t)0x00004000)
#define TIM_CCMR1_IC2F2_gp 14
#define TIM_CCMR1_IC2F3_gm ((uint32_t)0x00008000)
#define TIM_CCMR1_IC2F3_gp 15

/*** REGISTER: TIM_CCMR2 ***/
#define TIM_CCMR2_CC3S_gm ((uint32_t)0x00000003)
#define TIM_CCMR2_CC3S_gp 0
#define TIM_CCMR2_CC3S0_gm ((uint32_t)0x00000001)
#define TIM_CCMR2_CC3S0_gp 0
#define TIM_CCMR2_CC3S1_gm ((uint32_t)0x00000002)
#define TIM_CCMR2_CC3S1_gp 1
#define TIM_CCMR2_OC3FE_gm ((uint32_t)0x00000004)
#define TIM_CCMR2_OC3FE_gp 2
#define TIM_CCMR2_OC3PE_gm ((uint32_t)0x00000008)
#define TIM_CCMR2_OC3PE_gp 3
#define TIM_CCMR2_OC3M_gm ((uint32_t)0x00000070)
#define TIM_CCMR2_OC3M_gp 4
#define TIM_CCMR2_OC3M0_gm ((uint32_t)0x00000010)
#define TIM_CCMR2_OC3M0_gp 4
#define TIM_CCMR2_OC3M1_gm ((uint32_t)0x00000020)
#define TIM_CCMR2_OC3M1_gp 5
#define TIM_CCMR2_OC3M2_gm ((uint32_t)0x00000040)
#define TIM_CCMR2_OC3M2_gp 6
#define TIM_CCMR2_OC3M3_gm ((uint32_t)0x00010000)
#define TIM_CCMR2_OC3M3_gp 16
#define TIM_CCMR2_OC3CE_gm ((uint32_t)0x00000080)
#define TIM_CCMR2_OC3CE_gp 7
#define TIM_CCMR2_CC4S_gm ((uint32_t)0x00000300)
#define TIM_CCMR2_CC4S_gp 8
#define TIM_CCMR2_CC4S0_gm ((uint32_t)0x00000100)
#define TIM_CCMR2_CC4S0_gp 8
#define TIM_CCMR2_CC4S1_gm ((uint32_t)0x00000200)
#define TIM_CCMR2_CC4S1_gp 9
#define TIM_CCMR2_OC4FE_gm ((uint32_t)0x00000400)
#define TIM_CCMR2_OC4FE_gp 10
#define TIM_CCMR2_OC4PE_gm ((uint32_t)0x00000800)
#define TIM_CCMR2_OC4PE_gp 11
#define TIM_CCMR2_OC4M_gm ((uint32_t)0x00007000)
#define TIM_CCMR2_OC4M_gp 12
#define TIM_CCMR2_OC4M0_gm ((uint32_t)0x00001000)
#define TIM_CCMR2_OC4M0_gp 12
#define TIM_CCMR2_OC4M1_gm ((uint32_t)0x00002000)
#define TIM_CCMR2_OC4M1_gp 13
#define TIM_CCMR2_OC4M2_gm ((uint32_t)0x00004000)
#define TIM_CCMR2_OC4M2_gp 14
#define TIM_CCMR2_OC4M3_gm ((uint32_t)0x00100000)
#define TIM_CCMR2_OC4M3_gp 20
#define TIM_CCMR2_OC4CE_gm ((uint32_t)0x00008000)
#define TIM_CCMR2_OC4CE_gp 15
#define TIM_CCMR2_IC3PSC_gm ((uint16_t)0x0000000C)
#define TIM_CCMR2_IC3PSC_gp 2
#define TIM_CCMR2_IC3PSC0_gm ((uint16_t)0x00000004)
#define TIM_CCMR2_IC3PSC0_gp 2
#define TIM_CCMR2_IC3PSC1_gm ((uint16_t)0x00000008)
#define TIM_CCMR2_IC3PSC1_gp 3
#define TIM_CCMR2_IC3F_gm ((uint16_t)0x000000F0)
#define TIM_CCMR2_IC3F_gp 4
#define TIM_CCMR2_IC3F0_gm ((uint16_t)0x00000010)
#define TIM_CCMR2_IC3F0_gp 4
#define TIM_CCMR2_IC3F1_gm ((uint16_t)0x00000020)
#define TIM_CCMR2_IC3F1_gp 5
#define TIM_CCMR2_IC3F2_gm ((uint16_t)0x00000040)
#define TIM_CCMR2_IC3F2_gp 6
#define TIM_CCMR2_IC3F3_gm ((uint16_t)0x00000080)
#define TIM_CCMR2_IC3F3_gp 7
#define TIM_CCMR2_IC4PSC_gm ((uint16_t)0x00000C00)
#define TIM_CCMR2_IC4PSC_gp 10
#define TIM_CCMR2_IC4PSC0_gm ((uint16_t)0x00000400)
#define TIM_CCMR2_IC4PSC0_gp 10
#define TIM_CCMR2_IC4PSC1_gm ((uint16_t)0x00000800)
#define TIM_CCMR2_IC4PSC1_gp 11
#define TIM_CCMR2_IC4F_gm ((uint16_t)0x0000F000)
#define TIM_CCMR2_IC4F_gp 12
#define TIM_CCMR2_IC4F0_gm ((uint16_t)0x00001000)
#define TIM_CCMR2_IC4F0_gp 12
#define TIM_CCMR2_IC4F1_gm ((uint16_t)0x00002000)
#define TIM_CCMR2_IC4F1_gp 13
#define TIM_CCMR2_IC4F2_gm ((uint16_t)0x00004000)
#define TIM_CCMR2_IC4F2_gp 14
#define TIM_CCMR2_IC4F3_gm ((uint16_t)0x00008000)
#define TIM_CCMR2_IC4F3_gp 15

/*** REGISTER: TIM_CCER ***/
#define TIM_CCER_CC1E_gm ((uint32_t)0x00000001)
#define TIM_CCER_CC1E_gp 0
#define TIM_CCER_CC1P_gm ((uint32_t)0x00000002)
#define TIM_CCER_CC1P_gp 1
#define TIM_CCER_CC1NE_gm ((uint32_t)0x00000004)
#define TIM_CCER_CC1NE_gp 2
#define TIM_CCER_CC1NP_gm ((uint32_t)0x00000008)
#define TIM_CCER_CC1NP_gp 3
#define TIM_CCER_CC2E_gm ((uint32_t)0x00000010)
#define TIM_CCER_CC2E_gp 4
#define TIM_CCER_CC2P_gm ((uint32_t)0x00000020)
#define TIM_CCER_CC2P_gp 5
#define TIM_CCER_CC2NE_gm ((uint32_t)0x00000040)
#define TIM_CCER_CC2NE_gp 6
#define TIM_CCER_CC2NP_gm ((uint32_t)0x00000080)
#define TIM_CCER_CC2NP_gp 7
#define TIM_CCER_CC3E_gm ((uint32_t)0x00000100)
#define TIM_CCER_CC3E_gp 8
#define TIM_CCER_CC3P_gm ((uint32_t)0x00000200)
#define TIM_CCER_CC3P_gp 9
#define TIM_CCER_CC3NE_gm ((uint32_t)0x00000400)
#define TIM_CCER_CC3NE_gp 10
#define TIM_CCER_CC3NP_gm ((uint32_t)0x00000800)
#define TIM_CCER_CC3NP_gp 11
#define TIM_CCER_CC4E_gm ((uint32_t)0x00001000)
#define TIM_CCER_CC4E_gp 12
#define TIM_CCER_CC4P_gm ((uint32_t)0x00002000)
#define TIM_CCER_CC4P_gp 13
#define TIM_CCER_CC4NP_gm ((uint32_t)0x00008000)
#define TIM_CCER_CC4NP_gp 15
#define TIM_CCER_CC5E_gm ((uint32_t)0x00010000)
#define TIM_CCER_CC5E_gp 16
#define TIM_CCER_CC5P_gm ((uint32_t)0x00020000)
#define TIM_CCER_CC5P_gp 17
#define TIM_CCER_CC6E_gm ((uint32_t)0x00100000)
#define TIM_CCER_CC6E_gp 20
#define TIM_CCER_CC6P_gm ((uint32_t)0x00200000)
#define TIM_CCER_CC6P_gp 21

/*** REGISTER: TIM_CNT ***/
#define TIM_CNT_CNT_gm ((uint32_t)0xFFFFFFFF)
#define TIM_CNT_CNT_gp 0
#define TIM_CNT_UIFCPY_gm ((uint32_t)0x80000000)
#define TIM_CNT_UIFCPY_gp 31

