a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: TIM_PSC ***/
#define TIM_PSC_PSC_gm ((uint16_t)0xFFFF)
#define TIM_PSC_PSC_gp 0

/*** REGISTER: TIM_ARR ***/
#define TIM_ARR_ARR_gm ((uint32_t)0xFFFFFFFF)
#define TIM_ARR_ARR_gp 0

/*** REGISTER: TIM_RCR ***/
#define TIM_RCR_REP_gm ((uint8_t)0xFF)
#define TIM_RCR_REP_gp 0

/*** REGISTER: TIM_CCR1 ***/
#define TIM_CCR1_CCR1_gm ((uint16_t)0xFFFF)
#define TIM_CCR1_CCR1_gp 0

/*** REGISTER: TIM_CCR2 ***/
#define TIM_CCR2_CCR2_gm ((uint16_t)0xFFFF)
#define TIM_CCR2_CCR2_gp 0

/*** REGISTER: TIM_CCR3 ***/
#define TIM_CCR3_CCR3_gm ((uint16_t)0xFFFF)
#define TIM_CCR3_CCR3_gp 0

/*** REGISTER: TIM_CCR4 ***/
#define TIM_CCR4_CCR4_gm ((uint16_t)0xFFFF)
#define TIM_CCR4_CCR4_gp 0

/*** REGISTER: TIM_CCR5 ***/
#define TIM_CCR5_CCR5_gm ((uint32_t)0xFFFFFFFF)
#define TIM_CCR5_CCR5_gp 0
#define TIM_CCR5_GC5C1_gm ((uint32_t)0x20000000)
#define TIM_CCR5_GC5C1_gp 29
#define TIM_CCR5_GC5C2_gm ((uint32_t)0x40000000)
#define TIM_CCR5_GC5C2_gp 30
#define TIM_CCR5_GC5C3_gm ((uint32_t)0x80000000)
#define TIM_CCR5_GC5C3_gp 31

/*** REGISTER: TIM_CCR6 ***/
#define TIM_CCR6_CCR6_gm ((uint16_t)0xFFFF)
#define TIM_CCR6_CCR6_gp 0

/*** REGISTER: TIM_BDTR ***/
#define TIM_BDTR_DTG_gm ((uint32_t)0x000000FF)
#define TIM_BDTR_DTG_gp 0
#define TIM_BDTR_DTG0_gm ((uint32_t)0x00000001)
#define TIM_BDTR_DTG0_gp 0
#define TIM_BDTR_DTG1_gm ((uint32_t)0x00000002)
#define TIM_BDTR_DTG1_gp 1
#define TIM_BDTR_DTG2_gm ((uint32_t)0x00000004)
#define TIM_BDTR_DTG2_gp 2
#define TIM_BDTR_DTG3_gm ((uint32_t)0x00000008)
#define TIM_BDTR_DTG3_gp 3
#define TIM_BDTR_DTG4_gm ((uint32_t)0x00000010)
#define TIM_BDTR_DTG4_gp 4
#define TIM_BDTR_DTG5_gm ((uint32_t)0x00000020)
#define TIM_BDTR_DTG5_gp 5
#define TIM_BDTR_DTG6_gm ((uint32_t)0x00000040)
#define TIM_BDTR_DTG6_gp 6
#define TIM_BDTR_DTG7_gm ((uint32_t)0x00000080)
#define TIM_BDTR_DTG7_gp 7
#define TIM_BDTR_LOCK_gm ((uint32_t)0x00000300)
#define TIM_BDTR_LOCK_gp 8
#define TIM_BDTR_LOCK0_gm ((uint32_t)0x00000100)
#define TIM_BDTR_LOCK0_gp 8
#define TIM_BDTR_LOCK1_gm ((uint32_t)0x00000200)
#define TIM_BDTR_LOCK1_gp 9
#define TIM_BDTR_OSSI_gm ((uint32_t)0x00000400)
#define TIM_BDTR_OSSI_gp 10
#define TIM_BDTR_OSSR_gm ((uint32_t)0x00000800)
#define TIM_BDTR_OSSR_gp 11
#define TIM_BDTR_BKE_gm ((uint32_t)0x00001000)
#define TIM_BDTR_BKE_gp 12
#define TIM_BDTR_BKP_gm ((uint32_t)0x00002000)
#define TIM_BDTR_BKP_gp 13
#define TIM_BDTR_AOE_gm ((uint32_t)0x00004000)
#define TIM_BDTR_AOE_gp 14
#define TIM_BDTR_MOE_gm ((uint32_t)0x00008000)
#define TIM_BDTR_MOE_gp 15
#define TIM_BDTR_BKF_gm ((uint32_t)0x000F0000)
#define TIM_BDTR_BKF_gp 16
#define TIM_BDTR_BK2F_gm ((uint32_t)0x00F00000)
#define TIM_BDTR_BK2F_gp 20
#define TIM_BDTR_BK2E_gm ((uint32_t)0x01000000)
#define TIM_BDTR_BK2E_gp 24
#define TIM_BDTR_BK2P_gm ((uint32_t)0x02000000)
#define TIM_BDTR_BK2P_gp 25

/*** REGISTER: TIM_DCR ***/
#define TIM_DCR_DBA_gm ((uint16_t)0x001F)
#define TIM_DCR_DBA_gp 0
#define TIM_DCR_DBA0_gm ((uint16_t)0x0001)
#define TIM_DCR_DBA0_gp 0
#define TIM_DCR_DBA1_gm ((uint16_t)0x0002)
#define TIM_DCR_DBA1_gp 1
#define TIM_DCR_DBA2_gm ((uint16_t)0x0004)
#define TIM_DCR_DBA2_gp 2
#define TIM_DCR_DBA3_gm ((uint16_t)0x0008)
#define TIM_DCR_DBA3_gp 3
#define TIM_DCR_DBA4_gm ((uint16_t)0x0010)
#define TIM_DCR_DBA4_gp 4
#define TIM_DCR_DBL_gm ((uint16_t)0x1F00)
#define TIM_DCR_DBL_gp 8
#define TIM_DCR_DBL0_gm ((uint16_t)0x0100)
#define TIM_DCR_DBL0_gp 8
#define TIM_DCR_DBL1_gm ((uint16_t)0x0200)
#define TIM_DCR_DBL1_gp 9
#define TIM_DCR_DBL2_gm ((uint16_t)0x0400)
#define TIM_DCR_DBL2_gp 10
#define TIM_DCR_DBL3_gm ((uint16_t)0x0800)
#define TIM_DCR_DBL3_gp 11
#define TIM_DCR_DBL4_gm ((uint16_t)0x1000)
#define TIM_DCR_DBL4_gp 12

/*** REGISTER: TIM_DMAR ***/
#define TIM_DMAR_DMAB_gm ((uint16_t)0xFFFF)
#define TIM_DMAR_DMAB_gp 0


/********** PERIPHERAL: TIM16 **********/

/*** REGISTER: TIM16_OR ***/
#define TIM16_OR_TI1_RMP_gm ((uint16_t)0x00C0)
#define TIM16_OR_TI1_RMP_gp 6
#define TIM16_OR_TI1_RMP_0_gm ((uint16_t)0x0040)
#define TIM16_OR_TI1_RMP_0_gp 6
#define TIM16_OR_TI1_RMP_1_gm ((uint16_t)0x0080)
#define TIM16_OR_TI1_RMP_1_gp 7


/********** PERIPHERAL: TIM1 **********/
#define TIM1_OR_ETR_RMP_gm ((uint16_t)0x000F)
#define TIM1_OR_ETR_RMP_gp 0
#define TIM1_OR_ETR_RMP_0_gm ((uint16_t)0x0001)
#define TIM1_OR_ETR_RMP_0_gp 0
#define TIM1_OR_ETR_RMP_1_gm ((uint16_t)0x0002)
#define TIM1_OR_ETR_RMP_1_gp 1
#define TIM1_OR_ETR_RMP_2_gm ((uint16_t)0x0004)
#define TIM1_OR_ETR_RMP_2_gp 2
#define TIM1_OR_ETR_RMP_3_gm ((uint16_t)0x0008)
#define TIM1_OR_ETR_RMP_3_gp 3


/********** PERIPHERAL: TIM8 **********/
#define TIM8_OR_ETR_RMP_gm ((uint16_t)0x000F)
#define TIM8_OR_ETR_RMP_gp 0
#define TIM8_OR_ETR_RMP_0_gm ((uint16_t)0x0001)
#define TIM8_OR_ETR_RMP_0_gp 0
#define TIM8_OR_ETR_RMP_1_gm ((uint16_t)0x0002)
#define TIM8_OR_ETR_RMP_1_gp 1
#define TIM8_OR_ETR_RMP_2_gm ((uint16_t)0x0004)
#define TIM8_OR_ETR_RMP_2_gp 2
#define TIM8_OR_ETR_RMP_3_gm ((uint16_t)0x0008)
#define TIM8_OR_ETR_RMP_3_gp 3


/********** PERIPHERAL: TIM **********/

/*** REGISTER: TIM_CCMR3 ***/
#define TIM_CCMR3_OC5FE_gm ((uint32_t)0x00000004)
#define TIM_CCMR3_OC5FE_gp 2
#define TIM_CCMR3_OC5PE_gm ((uint32_t)0x00000008)
#define TIM_CCMR3_OC5PE_gp 3
#define TIM_CCMR3_OC5M_gm ((uint32_t)0x00000070)
#define TIM_CCMR3_OC5M_gp 4
#define TIM_CCMR3_OC5M0_gm ((uint32_t)0x00000010)
#define TIM_CCMR3_OC5M0_gp 4
#define TIM_CCMR3_OC5M1_gm ((uint32_t)0x00000020)
#define TIM_CCMR3_OC5M1_gp 5
#define TIM_CCMR3_OC5M2_gm ((uint32_t)0x00000040)
#define TIM_CCMR3_OC5M2_gp 6
#define TIM_CCMR3_OC5M3_gm ((uint32_t)0x00010000)
#define TIM_CCMR3_OC5M3_gp 16
#define TIM_CCMR3_OC5CE_gm ((uint32_t)0x00000080)
#define TIM_CCMR3_OC5CE_gp 7
#define TIM_CCMR3_OC6FE_gm ((uint32_t)0x00000400)
#define TIM_CCMR3_OC6FE_gp 10
#define TIM_CCMR3_OC6PE_gm ((uint32_t)0x00000800)
#define TIM_CCMR3_OC6PE_gp 11
#define TIM_CCMR3_OC6M_gm ((uint32_t)0x00007000)
#define TIM_CCMR3_OC6M_gp 12
#define TIM_CCMR3_OC6M0_gm ((uint32_t)0x00001000)
#define TIM_CCMR3_OC6M0_gp 12
#define TIM_CCMR3_OC6M1_gm ((uint32_t)0x00002000)
#define TIM_CCMR3_OC6M1_gp 13
#define TIM_CCMR3_OC6M2_gm ((uint32_t)0x00004000)
#define TIM_CCMR3_OC6M2_gp 14
#define TIM_CCMR3_OC6M3_gm ((uint32_t)0x00100000)
#define TIM_CCMR3_OC6M3_gp 20
#define TIM_CCMR3_OC6CE_gm ((uint32_t)0x00008000)
#define TIM_CCMR3_OC6CE_gp 15


