a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/********** PERIPHERAL: USART **********/

/*** REGISTER: USART_CR1 ***/
#define USART_CR1_UE_gm ((uint32_t)0x00000001)
#define USART_CR1_UE_gp 0
#define USART_CR1_UESM_gm ((uint32_t)0x00000002)
#define USART_CR1_UESM_gp 1
#define USART_CR1_RE_gm ((uint32_t)0x00000004)
#define USART_CR1_RE_gp 2
#define USART_CR1_TE_gm ((uint32_t)0x00000008)
#define USART_CR1_TE_gp 3
#define USART_CR1_IDLEIE_gm ((uint32_t)0x00000010)
#define USART_CR1_IDLEIE_gp 4
#define USART_CR1_RXNEIE_gm ((uint32_t)0x00000020)
#define USART_CR1_RXNEIE_gp 5
#define USART_CR1_TCIE_gm ((uint32_t)0x00000040)
#define USART_CR1_TCIE_gp 6
#define USART_CR1_TXEIE_gm ((uint32_t)0x00000080)
#define USART_CR1_TXEIE_gp 7
#define USART_CR1_PEIE_gm ((uint32_t)0x00000100)
#define USART_CR1_PEIE_gp 8
#define USART_CR1_PS_gm ((uint32_t)0x00000200)
#define USART_CR1_PS_gp 9
#define USART_CR1_PCE_gm ((uint32_t)0x00000400)
#define USART_CR1_PCE_gp 10
#define USART_CR1_WAKE_gm ((uint32_t)0x00000800)
#define USART_CR1_WAKE_gp 11
#define USART_CR1_M_gm ((uint32_t)0x00001000)
#define USART_CR1_M_gp 12
#define USART_CR1_MME_gm ((uint32_t)0x00002000)
#define USART_CR1_MME_gp 13
#define USART_CR1_CMIE_gm ((uint32_t)0x00004000)
#define USART_CR1_CMIE_gp 14
#define USART_CR1_OVER8_gm ((uint32_t)0x00008000)
#define USART_CR1_OVER8_gp 15
#define USART_CR1_DEDT_gm ((uint32_t)0x001F0000)
#define USART_CR1_DEDT_gp 16
#define USART_CR1_DEDT0_gm ((uint32_t)0x00010000)
#define USART_CR1_DEDT0_gp 16
#define USART_CR1_DEDT1_gm ((uint32_t)0x00020000)
#define USART_CR1_DEDT1_gp 17
#define USART_CR1_DEDT2_gm ((uint32_t)0x00040000)
#define USART_CR1_DEDT2_gp 18
#define USART_CR1_DEDT3_gm ((uint32_t)0x00080000)
#define USART_CR1_DEDT3_gp 19
#define USART_CR1_DEDT4_gm ((uint32_t)0x00100000)
#define USART_CR1_DEDT4_gp 20
#define USART_CR1_DEAT_gm ((uint32_t)0x03E00000)
#define USART_CR1_DEAT_gp 21
#define USART_CR1_DEAT0_gm ((uint32_t)0x00200000)
#define USART_CR1_DEAT0_gp 21
#define USART_CR1_DEAT1_gm ((uint32_t)0x00400000)
#define USART_CR1_DEAT1_gp 22
#define USART_CR1_DEAT2_gm ((uint32_t)0x00800000)
#define USART_CR1_DEAT2_gp 23
#define USART_CR1_DEAT3_gm ((uint32_t)0x01000000)
#define USART_CR1_DEAT3_gp 24
#define USART_CR1_DEAT4_gm ((uint32_t)0x02000000)
#define USART_CR1_DEAT4_gp 25
#define USART_CR1_RTOIE_gm ((uint32_t)0x04000000)
#define USART_CR1_RTOIE_gp 26
#define USART_CR1_EOBIE_gm ((uint32_t)0x08000000)
#define USART_CR1_EOBIE_gp 27

/*** REGISTER: USART_CR2 ***/
#define USART_CR2_ADDM7_gm ((uint32_t)0x00000010)
#define USART_CR2_ADDM7_gp 4
#define USART_CR2_LBDL_gm ((uint32_t)0x00000020)
#define USART_CR2_LBDL_gp 5
#define USART_CR2_LBDIE_gm ((uint32_t)0x00000040)
#define USART_CR2_LBDIE_gp 6
#define USART_CR2_LBCL_gm ((uint32_t)0x00000100)
#define USART_CR2_LBCL_gp 8
#define USART_CR2_CPHA_gm ((uint32_t)0x00000200)
#define USART_CR2_CPHA_gp 9
#define USART_CR2_CPOL_gm ((uint32_t)0x00000400)
#define USART_CR2_CPOL_gp 10
#define USART_CR2_CLKEN_gm ((uint32_t)0x00000800)
#define USART_CR2_CLKEN_gp 11
#define USART_CR2_STOP_gm ((uint32_t)0x00003000)
#define USART_CR2_STOP_gp 12
#define USART_CR2_STOP0_gm ((uint32_t)0x00001000)
#define USART_CR2_STOP0_gp 12
#define USART_CR2_STOP1_gm ((uint32_t)0x00002000)
#define USART_CR2_STOP1_gp 13
#define USART_CR2_LINEN_gm ((uint32_t)0x00004000)
#define USART_CR2_LINEN_gp 14
#define USART_CR2_SWAP_gm ((uint32_t)0x00008000)
#define USART_CR2_SWAP_gp 15
#define USART_CR2_RXINV_gm ((uint32_t)0x00010000)
#define USART_CR2_RXINV_gp 16
#define USART_CR2_TXINV_gm ((uint32_t)0x00020000)
#define USART_CR2_TXINV_gp 17
#define USART_CR2_DATAINV_gm ((uint32_t)0x00040000)
#define USART_CR2_DATAINV_gp 18
#define USART_CR2_MSBFIRST_gm ((uint32_t)0x00080000)
#define USART_CR2_MSBFIRST_gp 19
#define USART_CR2_ABREN_gm ((uint32_t)0x00100000)
#define USART_CR2_ABREN_gp 20
#define USART_CR2_ABRMODE_gm ((uint32_t)0x00600000)
#define USART_CR2_ABRMODE_gp 21
#define USART_CR2_ABRMODE0_gm ((uint32_t)0x00200000)
#define USART_CR2_ABRMODE0_gp 21
#define USART_CR2_ABRMODE1_gm ((uint32_t)0x00400000)
#define USART_CR2_ABRMODE1_gp 22
#define USART_CR2_RTOEN_gm ((uint32_t)0x00800000)
#define USART_CR2_RTOEN_gp 23
#define USART_CR2_ADD_gm ((uint32_t)0xFF000000)
#define USART_CR2_ADD_gp 24

/*** REGISTER: USART_CR3 ***/
#define USART_CR3_EIE_gm ((uint32_t)0x00000001)
#define USART_CR3_EIE_gp 0
#define USART_CR3_IREN_gm ((uint32_t)0x00000002)
#define USART_CR3_IREN_gp 1
#define USART_CR3_IRLP_gm ((uint32_t)0x00000004)
#define USART_CR3_IRLP_gp 2
#define USART_CR3_HDSEL_gm ((uint32_t)0x00000008)
#define USART_CR3_HDSEL_gp 3
#define USART_CR3_NACK_gm ((uint32_t)0x00000010)
#define USART_CR3_NACK_gp 4
#define USART_CR3_SCEN_gm ((uint32_t)0x00000020)
#define USART_CR3_SCEN_gp 5
#define USART_CR3_DMAR_gm ((uint32_t)0x00000040)
#define USART_CR3_DMAR_gp 6
#define USART_CR3_DMAT_gm ((uint32_t)0x00000080)
#define USART_CR3_DMAT_gp 7
#define USART_CR3_RTSE_gm ((uint32_t)0x00000100)
#define USART_CR3_RTSE_gp 8
#define USART_CR3_CTSE_gm ((uint32_t)0x00000200)
#define USART_CR3_CTSE_gp 9
#define USART_CR3_CTSIE_gm ((uint32_t)0x00000400)
#define USART_CR3_CTSIE_gp 10
#define USART_CR3_ONEBIT_gm ((uint32_t)0x00000800)
#define USART_CR3_ONEBIT_gp 11
#define USART_CR3_OVRDIS_gm ((uint32_t)0x00001000)
#define USART_CR3_OVRDIS_gp 12
#define USART_CR3_DDRE_gm ((uint32_t)0x00002000)
#define USART_CR3_DDRE_gp 13
#define USART_CR3_DEM_gm ((uint32_t)0x00004000)
#define USART_CR3_DEM_gp 14
#define USART_CR3_DEP_gm ((uint32_t)0x00008000)
#define USART_CR3_DEP_gp 15
#define USART_CR3_SCARCNT_gm ((uint32_t)0x000E0000)
#define USART_CR3_SCARCNT_gp 17
#define USART_CR3_SCARCNT0_gm ((uint32_t)0x00020000)
#define USART_CR3_SCARCNT0_gp 17
#define USART_CR3_SCARCNT1_gm ((uint32_t)0x00040000)
#define USART_CR3_SCARCNT1_gp 18
#define USART_CR3_SCARCNT2_gm ((uint32_t)0x00080000)
#define USART_CR3_SCARCNT2_gp 19
#define USART_CR3_WUS_gm ((uint32_t)0x00300000)
#define USART_CR3_WUS_gp 20
#define USART_CR3_WUS0_gm ((uint32_t)0x00100000)
#define USART_CR3_WUS0_gp 20
#define USART_CR3_WUS1_gm ((uint32_t)0x00200000)
#define USART_CR3_WUS1_gp 21
#define USART_CR3_WUFIE_gm ((uint32_t)0x00400000)
#define USART_CR3_WUFIE_gp 22

