a-downing/stm32f3_discovery_quadcopter/src/stm32f30x_bitmask.h
/*** REGISTER: USART_BRR ***/
#define USART_BRR_DIV_FRACTION_gm ((uint16_t)0x000F)
#define USART_BRR_DIV_FRACTION_gp 0
#define USART_BRR_DIV_MANTISSA_gm ((uint16_t)0xFFF0)
#define USART_BRR_DIV_MANTISSA_gp 4

/*** REGISTER: USART_GTPR ***/
#define USART_GTPR_PSC_gm ((uint16_t)0x00FF)
#define USART_GTPR_PSC_gp 0
#define USART_GTPR_GT_gm ((uint16_t)0xFF00)
#define USART_GTPR_GT_gp 8

/*** REGISTER: USART_RTOR ***/
#define USART_RTOR_RTO_gm ((uint32_t)0x00FFFFFF)
#define USART_RTOR_RTO_gp 0
#define USART_RTOR_BLEN_gm ((uint32_t)0xFF000000)
#define USART_RTOR_BLEN_gp 24

/*** REGISTER: USART_RQR ***/
#define USART_RQR_ABRRQ_gm ((uint16_t)0x0001)
#define USART_RQR_ABRRQ_gp 0
#define USART_RQR_SBKRQ_gm ((uint16_t)0x0002)
#define USART_RQR_SBKRQ_gp 1
#define USART_RQR_MMRQ_gm ((uint16_t)0x0004)
#define USART_RQR_MMRQ_gp 2
#define USART_RQR_RXFRQ_gm ((uint16_t)0x0008)
#define USART_RQR_RXFRQ_gp 3
#define USART_RQR_TXFRQ_gm ((uint16_t)0x0010)
#define USART_RQR_TXFRQ_gp 4

/*** REGISTER: USART_ISR ***/
#define USART_ISR_PE_gm ((uint32_t)0x00000001)
#define USART_ISR_PE_gp 0
#define USART_ISR_FE_gm ((uint32_t)0x00000002)
#define USART_ISR_FE_gp 1
#define USART_ISR_NE_gm ((uint32_t)0x00000004)
#define USART_ISR_NE_gp 2
#define USART_ISR_ORE_gm ((uint32_t)0x00000008)
#define USART_ISR_ORE_gp 3
#define USART_ISR_IDLE_gm ((uint32_t)0x00000010)
#define USART_ISR_IDLE_gp 4
#define USART_ISR_RXNE_gm ((uint32_t)0x00000020)
#define USART_ISR_RXNE_gp 5
#define USART_ISR_TC_gm ((uint32_t)0x00000040)
#define USART_ISR_TC_gp 6
#define USART_ISR_TXE_gm ((uint32_t)0x00000080)
#define USART_ISR_TXE_gp 7
#define USART_ISR_LBD_gm ((uint32_t)0x00000100)
#define USART_ISR_LBD_gp 8
#define USART_ISR_CTSIF_gm ((uint32_t)0x00000200)
#define USART_ISR_CTSIF_gp 9
#define USART_ISR_CTS_gm ((uint32_t)0x00000400)
#define USART_ISR_CTS_gp 10
#define USART_ISR_RTOF_gm ((uint32_t)0x00000800)
#define USART_ISR_RTOF_gp 11
#define USART_ISR_EOBF_gm ((uint32_t)0x00001000)
#define USART_ISR_EOBF_gp 12
#define USART_ISR_ABRE_gm ((uint32_t)0x00004000)
#define USART_ISR_ABRE_gp 14
#define USART_ISR_ABRF_gm ((uint32_t)0x00008000)
#define USART_ISR_ABRF_gp 15
#define USART_ISR_BUSY_gm ((uint32_t)0x00010000)
#define USART_ISR_BUSY_gp 16
#define USART_ISR_CMF_gm ((uint32_t)0x00020000)
#define USART_ISR_CMF_gp 17
#define USART_ISR_SBKF_gm ((uint32_t)0x00040000)
#define USART_ISR_SBKF_gp 18
#define USART_ISR_RWU_gm ((uint32_t)0x00080000)
#define USART_ISR_RWU_gp 19
#define USART_ISR_WUF_gm ((uint32_t)0x00100000)
#define USART_ISR_WUF_gp 20
#define USART_ISR_TEACK_gm ((uint32_t)0x00200000)
#define USART_ISR_TEACK_gp 21
#define USART_ISR_REACK_gm ((uint32_t)0x00400000)
#define USART_ISR_REACK_gp 22

/*** REGISTER: USART_ICR ***/
#define USART_ICR_PECF_gm ((uint32_t)0x00000001)
#define USART_ICR_PECF_gp 0
#define USART_ICR_FECF_gm ((uint32_t)0x00000002)
#define USART_ICR_FECF_gp 1
#define USART_ICR_NCF_gm ((uint32_t)0x00000004)
#define USART_ICR_NCF_gp 2
#define USART_ICR_ORECF_gm ((uint32_t)0x00000008)
#define USART_ICR_ORECF_gp 3
#define USART_ICR_IDLECF_gm ((uint32_t)0x00000010)
#define USART_ICR_IDLECF_gp 4
#define USART_ICR_TCCF_gm ((uint32_t)0x00000040)
#define USART_ICR_TCCF_gp 6
#define USART_ICR_LBDCF_gm ((uint32_t)0x00000100)
#define USART_ICR_LBDCF_gp 8
#define USART_ICR_CTSCF_gm ((uint32_t)0x00000200)
#define USART_ICR_CTSCF_gp 9
#define USART_ICR_RTOCF_gm ((uint32_t)0x00000800)
#define USART_ICR_RTOCF_gp 11
#define USART_ICR_EOBCF_gm ((uint32_t)0x00001000)
#define USART_ICR_EOBCF_gp 12
#define USART_ICR_CMCF_gm ((uint32_t)0x00020000)
#define USART_ICR_CMCF_gp 17
#define USART_ICR_WUCF_gm ((uint32_t)0x00100000)
#define USART_ICR_WUCF_gp 20

/*** REGISTER: USART_RDR ***/
#define USART_RDR_RDR_gm ((uint16_t)0x01FF)
#define USART_RDR_RDR_gp 0

/*** REGISTER: USART_TDR ***/
#define USART_TDR_TDR_gm ((uint16_t)0x01FF)
#define USART_TDR_TDR_gp 0


/********** PERIPHERAL: WWDG **********/

/*** REGISTER: WWDG_CR ***/
#define WWDG_CR_T_gm ((uint8_t)0x7F)
#define WWDG_CR_T_gp 0
#define WWDG_CR_T0_gm ((uint8_t)0x01)
#define WWDG_CR_T0_gp 0
#define WWDG_CR_T1_gm ((uint8_t)0x02)
#define WWDG_CR_T1_gp 1
#define WWDG_CR_T2_gm ((uint8_t)0x04)
#define WWDG_CR_T2_gp 2
#define WWDG_CR_T3_gm ((uint8_t)0x08)
#define WWDG_CR_T3_gp 3
#define WWDG_CR_T4_gm ((uint8_t)0x10)
#define WWDG_CR_T4_gp 4
#define WWDG_CR_T5_gm ((uint8_t)0x20)
#define WWDG_CR_T5_gp 5
#define WWDG_CR_T6_gm ((uint8_t)0x40)
#define WWDG_CR_T6_gp 6
#define WWDG_CR_WDGA_gm ((uint8_t)0x80)
#define WWDG_CR_WDGA_gp 7

/*** REGISTER: WWDG_CFR ***/
#define WWDG_CFR_W_gm ((uint16_t)0x007F)
#define WWDG_CFR_W_gp 0
#define WWDG_CFR_W0_gm ((uint16_t)0x0001)
#define WWDG_CFR_W0_gp 0
#define WWDG_CFR_W1_gm ((uint16_t)0x0002)
#define WWDG_CFR_W1_gp 1
#define WWDG_CFR_W2_gm ((uint16_t)0x0004)
#define WWDG_CFR_W2_gp 2
#define WWDG_CFR_W3_gm ((uint16_t)0x0008)
#define WWDG_CFR_W3_gp 3
#define WWDG_CFR_W4_gm ((uint16_t)0x0010)
#define WWDG_CFR_W4_gp 4
#define WWDG_CFR_W5_gm ((uint16_t)0x0020)
#define WWDG_CFR_W5_gp 5
#define WWDG_CFR_W6_gm ((uint16_t)0x0040)
#define WWDG_CFR_W6_gp 6
#define WWDG_CFR_WDGTB_gm ((uint16_t)0x0180)
#define WWDG_CFR_WDGTB_gp 7
#define WWDG_CFR_WDGTB0_gm ((uint16_t)0x0080)
#define WWDG_CFR_WDGTB0_gp 7
#define WWDG_CFR_WDGTB1_gm ((uint16_t)0x0100)
#define WWDG_CFR_WDGTB1_gp 8
#define WWDG_CFR_EWI_gm ((uint16_t)0x0200)
#define WWDG_CFR_EWI_gp 9

/*** REGISTER: WWDG_SR ***/
#define WWDG_SR_EWIF_gm ((uint8_t)0x01)
#define WWDG_SR_EWIF_gp 0
